<HTML><HEAD><TITLE>Amplificateur op&eacute;rationnel</TITLE></HEAD><BODY><CENTER><IMG SRC="../BASE/ICONES/NAV.GIF"></CENTER><P align=center>Cette page fait partie d'un site complet. Si votre &eacute;cran ne se pr&eacute;sente pas comme ceci, <A HREF="AOP.HTM" target="_top"> cliquez l&agrave; </A><OL TYPE=I><P>&nbsp;<P>&nbsp;<LI><H3><A NAME=AO01>INTRODUCTION.</A></H3>Comme nous avons pu le constater dans les chapitres pr&eacute;c&eacute;dents, les montages amplificateurs de base &agrave; transistors ne sont pas tr&egrave;s commodes d'emploi&nbsp;:<P> - ils ne transmettent pas le continu&nbsp;;<P> - ils sont tributaires des dispersions des transistors, ce qui fait que leurs caract&eacute;ristiques sont impr&eacute;cises et non r&eacute;p&eacute;tables&nbsp;;<P> - leurs performances sont moyennes, et &agrave; moins d'aligner un montage &agrave; plusieurs transistors, on ne peut pas avoir simultan&eacute;ment fort gain en tension, haute imp&eacute;dance d'entr&eacute;e et faible imp&eacute;dance de sortie.<P>Les amplificateurs op&eacute;rationnels sont n&eacute;s au d&eacute;but des ann&eacute;es 60, quand on a commenc&eacute; &agrave; int&eacute;grer plusieurs transistors et r&eacute;sistances sur le m&ecirc;me substrat de silicium&nbsp;; cette technologie a permis de b&acirc;tir des montages complexes, et de les faire tenir sur une petite plaquette de silicium encapsul&eacute;e dans un bo&icirc;tier (g&eacute;n&eacute;ralement &agrave; 8 broches) commode d'emploi.<P>Avec ces composants, on a eu acc&egrave;s &agrave; des amplificateurs simples d'utilisation, transmettant des signaux continus, et &agrave; mise en &#156;uvre facile &agrave; l'aide de quelques composants annexes (r&eacute;sistances, condensateurs...)&nbsp;; les caract&eacute;ristiques des montages obtenus ne d&eacute;pendent quasiment plus de l'amplificateur op&eacute;rationnel, mais uniquement des composants passifs qui l'accompagnent, ce qui garantit une bonne fiabilit&eacute; du r&eacute;sultat et assure sa r&eacute;p&eacute;tabilit&eacute;.<P>Les amplificateurs op&eacute;rationnels ont beaucoup progress&eacute; depuis leur cr&eacute;ation, et tendent maintenant &agrave; devenir tr&egrave;s proches de l'amplificateur id&eacute;al (l'amplificateur op&eacute;rationnel parfait, AOP).<P>&nbsp;<P>&nbsp;<LI><H3><A NAME=AO02>L'AMPLIFICATEUR OP&Eacute;RATIONNEL PARFAIT.</A></H3><OL TYPE=A><P>&nbsp;<LI><H4><A NAME=AO03>PRINCIPE.</A></H4>A la base, l'AOP est un amplificateur diff&eacute;rentiel, donc muni de deux entr&eacute;es , l'une dite non inverseuse (V<SUB>+</SUB>) et l'autre inverseuse (V<SUB>-</SUB>), et d'une sortie (s)&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP001.GIF"></CENTER><P><CENTER>Fig. 1. Symbole d'un amplificateur diff&eacute;rentiel.</CENTER><BR><P>La fonction de transfert compl&egrave;te en continu (en pratique, A<SUB>vd</SUB> et A<SUB>vmc</SUB> <A HREF="#AO63">d&eacute;pendent de la fr&eacute;quence</A>) de cet amplificateur est donn&eacute;e par la formule&nbsp;:<P><CENTER><A NAME="EQ01"><IMG SRC="AOP.FIG/AOP002.GIF"></A></CENTER><P>A<SUB>vd</SUB> est le gain en tension diff&eacute;rentiel de l'amplificateur, et A<SUB>vmc</SUB> le gain en tension de mode commun. Dans le cas d'un amplificateur parfait, on fait l'hypoth&egrave;se que ces gains ne d&eacute;pendent pas de la fr&eacute;quence.<P>Les gains, ainsi que les imp&eacute;dances d'entr&eacute;e et de sortie d'un AOP doivent r&eacute;pondre &agrave; des crit&egrave;res pr&eacute;cis. On peut donner un sch&eacute;ma &eacute;quivalent de l'AOP&nbsp;:<P><CENTER><A NAME="F02"><IMG SRC="AOP.FIG/AOP003.GIF"></A></CENTER><P><CENTER>Fig. 2. Sch&eacute;ma &eacute;quivalent d'un AOP.</CENTER><BR><P>&nbsp;<LI><H4><A NAME=AO04>CARACT&Eacute;RISTIQUES.</A></H4>Pour que cet amplificateur soit parfait, les gains en tension doivent r&eacute;pondre aux caract&eacute;ristiques suivantes&nbsp;:<P> - A<SUB>vd</SUB> = <IMG SRC="../BASE/ICONES/INF.GIF" align=bottom><P> - A<SUB>vmc</SUB> = 0<P>On distingue deux types d'imp&eacute;dances d'entr&eacute;e dans un AOP&nbsp;: l'imp&eacute;dance diff&eacute;rentielle et celles de mode commun, qui sont d&eacute;finies sur le sch&eacute;ma de la <A HREF="#F02">figure 2</A>.<P>Un ampli parfait doit r&eacute;pondre aux crit&egrave;res suivants du point de vue des imp&eacute;dances&nbsp;:<P> - Z<SUB>ed</SUB> = <IMG SRC="../BASE/ICONES/INF.GIF" align=bottom><P> - Z<SUB>emc</SUB> = <IMG SRC="../BASE/ICONES/INF.GIF" align=bottom><P> - Z<SUB>s</SUB> = 0<P><STRONG>En r&eacute;sum&eacute;&nbsp;: un amplificateur op&eacute;rationnel parfait est un amplificateur de diff&eacute;rence pur &agrave; gain diff&eacute;rentiel infini, rejetant parfaitement le mode commun, dont les imp&eacute;dances d'entr&eacute;es sont infinies et l'imp&eacute;dance de sortie est nulle.</STRONG>En pratique, nous verrons que l'amplificateur op&eacute;rationnel r&eacute;el <A HREF="#AO39">pr&eacute;sente des d&eacute;fauts</A> par rapport &agrave; l'id&eacute;alisation que constitue l'AOP, mais le mod&egrave;le de ce dernier est suffisant pour &eacute;tudier la plupart des montages simples sans faire des calculs laborieux et inutiles&nbsp;: en effet, du point de vue imp&eacute;dances et gains, et sauf &agrave; utiliser les composants &agrave; leurs limites, les amplis r&eacute;els sont suffisamment pr&egrave;s des AOP pour qu'on fasse les approximations avec une erreur minime (tr&egrave;s souvent mieux que le %). Seul le <A HREF="#AO63">comportement fr&eacute;quentiel</A> pose vraiment probl&egrave;me par rapport au mod&egrave;le id&eacute;al.<P>&nbsp;<LI><H4><A NAME=AO05>FONCTIONNEMENT D'UN SYST&#200;ME BOUCL&Eacute;.</A></H4>Tous les montages fondamentaux vont &ecirc;tre &eacute;tudi&eacute;s avec les hypoth&egrave;ses relatives au mod&egrave;le d'AOP parfait telles que d&eacute;crites pr&eacute;c&eacute;demment.<P>Dans ces hypoth&egrave;ses, on a vu que le gain en tension diff&eacute;rentiel tendait vers l'infini&nbsp;: cela implique que la tension d'entr&eacute;e diff&eacute;rentielle (V<SUB>+</SUB> - V<SUB>-</SUB>) va devoir tendre vers 0 pour que la tension de sortie soit finie (voir &eacute;quation <A HREF="#EQ01">[1]</A>).<P>Une grande cons&eacute;quence de ceci est qu'on n'utilisera (quasiment) jamais un amplificateur op&eacute;rationnel en boucle ouverte pour un fonctionnement lin&eacute;aire&nbsp;; on l'utilisera toujours avec une contre r&eacute;action, soit en boucle ferm&eacute;e&nbsp;: on r&eacute;injectera une fraction de la tension de sortie sur l'entr&eacute;e inverseuse (retour du signal en opposition de phase). Nous allons maintenant &eacute;tudier quelques rudiments de la th&eacute;orie des syst&egrave;mes boucl&eacute;s pour mieux comprendre le fonctionnement des montages classiques utilisant des AOP.<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO06>Sch&eacute;ma-bloc d'un syst&egrave;me boucl&eacute;.</A></FONT></H5>On peut repr&eacute;senter un syst&egrave;me boucl&eacute; &agrave; une entr&eacute;e et une sortie de la mani&egrave;re suivante&nbsp;:<P><CENTER><A NAME="F03"><IMG SRC="AOP.FIG/AOP004.GIF"></A></CENTER><P><CENTER>Fig. 3. Syst&egrave;me boucl&eacute;.</CENTER><BR>Le signal est d'abord att&eacute;nu&eacute; en passant dans le bloc de fonction de transfert <IMG SRC="../BASE/ICONES/ALPHA.GIF" align=bottom> (qui dans beaucoup de cas est &eacute;gale &agrave; l'unit&eacute;&nbsp;: on peut alors supprimer ce bloc), et arrive ensuite dans un m&eacute;langeur diff&eacute;rentiel.<P>Dans ce m&eacute;langeur, une fraction du signal de sortie est soustraite du signal d'entr&eacute;e att&eacute;nu&eacute;. Le tout est multipli&eacute; par la fonction de transfert du bloc A. On obtient l'&eacute;quation suivante&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP005.GIF"></CENTER><P>On peut en tirer le rapport H=s/e, qui est la fonction de transfert du syst&egrave;me boucl&eacute;&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP006.GIF"></CENTER><P>Le produit AB est le <STRONG>gain de boucle</STRONG> du syst&egrave;me&nbsp;; dans un syst&egrave;me boucl&eacute;, on cherche &agrave; ce qu'il soit le plus grand possible de mani&egrave;re &agrave; ce que H d&eacute;pende tr&egrave;s peu de A. En effet, si AB>>1, on peut &eacute;crire&nbsp;:<P><CENTER><A NAME="EQ04"><IMG SRC="AOP.FIG/AOP007.GIF"></A></CENTER><P>Si <IMG SRC="../BASE/ICONES/ALPHA.GIF" align=bottom> et B sont bien ma&icirc;tris&eacute;s (ce sont la plupart du temps des r&eacute;seaux constitu&eacute;s de composants passifs de pr&eacute;cision correcte), la fonction de transfert H ne d&eacute;pendra quasiment plus de la fonction de transfert A, qui pourra &ecirc;tre assez impr&eacute;cise, pourvu que sa valeur soit &eacute;lev&eacute;e. On r&eacute;alise un asservissement de la sortie &agrave; l'entr&eacute;e au facteur <IMG SRC="../BASE/ICONES/ALPHA.GIF" align=bottom>/B pr&egrave;s.<P>Deux autres avantages (que nous ne d&eacute;montrerons pas ici) concernent les imp&eacute;dances d'entr&eacute;e et de sortie&nbsp;:<P> - l'imp&eacute;dance diff&eacute;rentielle d'entr&eacute;e est multipli&eacute;e par le gain de boucle.<P> - l'imp&eacute;dance de sortie est divis&eacute;e par le gain de boucle.<P>Ces deux propri&eacute;t&eacute;s sont importantes, car elles vont permettre d'am&eacute;liorer les performances apparentes des amplificateurs r&eacute;els, et donc de justifier encore mieux le fait qu'on utilise le mod&egrave;le de l'AOP pour faire les calculs.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO07>Application &agrave; l'AOP.</A></FONT></H5>Le fonctionnement en asservissement tel que d&eacute;crit pr&eacute;c&eacute;demment va convenir id&eacute;alement aux amplificateurs op&eacute;rationnels&nbsp;: ceux-ci pr&eacute;sentent un <A HREF="#AO34">gain en tension tr&egrave;s &eacute;lev&eacute;</A>, mais d&eacute;fini &agrave; un facteur trois ou quatre pr&egrave;s sur un lot de composants et en fonction des conditions d'utilisation (charge, temp&eacute;rature...). Le fait de les boucler va permettre de s'affranchir de leurs imperfections.<P>L'AOP est un amplificateur diff&eacute;rentiel &agrave; grand gain. On peut reprendre le sch&eacute;ma de la <A HREF="#F03">figure 3 </A>et l'adapter &agrave; son cas.<P><CENTER><A NAME="F04"><IMG SRC="AOP.FIG/AOP008.GIF"></A></CENTER><P><CENTER>Fig. 4. L'AOP boucl&eacute;.</CENTER><BR>Ce montage appelle quelques commentaires&nbsp;:<P> - La fonction de transfert A est le gain diff&eacute;rentiel de l'amplificateur (infini pour un AOP, tr&egrave;s grand et d&eacute;pendant de la fr&eacute;quence pour un ampli r&eacute;el).<P> - les blocs <IMG SRC="../BASE/ICONES/ALPHA.GIF" align=bottom> et B sont des quadrip&ocirc;les (donc munis de deux entr&eacute;es et de deux sorties)&nbsp;; dans le cas des montages &agrave; AOP, ces quadrip&ocirc;les ont en fait une entr&eacute;e et une sortie reli&eacute;es &agrave; la masse&nbsp;: elles ne sont pas repr&eacute;sent&eacute;es sur les sch&eacute;mas blocs.<P> - si le signal d'entr&eacute;e e rentre (via le bloc <IMG SRC="../BASE/ICONES/ALPHA.GIF" align=bottom>) sur l'entr&eacute;e V<SUB>-</SUB>, il faudra rajouter un signe - &agrave; <IMG SRC="../BASE/ICONES/ALPHA.GIF" align=bottom> pour que les &eacute;quations pr&eacute;c&eacute;dentes soient v&eacute;rifi&eacute;es.<P>On a vu que dans le cas de l'AOP, le gain A est infini. Le gain de boucle sera donc lui aussi infini, et &agrave; la sortie du m&eacute;langeur diff&eacute;rentiel, on va avoir un signal qui tend vers 0 pour que le signal de sortie s ait une valeur finie.<P>L'amplificateur ne va pas amplifier le signal proprement dit, mais l'&eacute;cart entre l'entr&eacute;e et la sortie qui va donc copier fid&egrave;lement l'entr&eacute;e au facteur <IMG SRC="../BASE/ICONES/ALPHA.GIF" align=bottom>/B pr&egrave;s. On parle alors d'amplificateur d'erreur.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO08>Calcul des montages &agrave; AOP.</A></FONT></H5>Il existe deux alternatives pour calculer les montages &agrave; amplificateurs op&eacute;rationnels&nbsp;: utiliser la loi d'ohm, ou les traiter par la m&eacute;thode des sch&eacute;mas-blocs.<P>Pour la suite du cours, les montages (qui sont des montages de base, donc simples) seront calcul&eacute;s &agrave; l'aide de la loi d'ohm&nbsp;; toutefois, pour illustrer au moins une fois le calcul par sch&eacute;ma-blocs, nous allons traiter <A HREF="#AO13">l'amplificateur inverseur par cette m&eacute;thode</A>.<P>Pour des montages un peu compliqu&eacute;s, la loi d'Ohm (et ses d&eacute;riv&eacute;s&nbsp;: <A HREF="../OUTILS/COURS.HTM#O58" target=_blank>th&eacute;or&egrave;me de superposition</A>, <A HREF="../OUTILS/COURS.HTM#O61" target=_blank>Th&eacute;venin</A>...) donnent assez vite des mises en &eacute;quation laborieuses&nbsp;; de plus, si on veut prendre en ligne de compte le comportement fr&eacute;quentiel de l'amplificateur r&eacute;el, les calculs deviennent trop complexes et peu intelligibles.<P>On calculera alors les montages par la m&eacute;thode des blocs. Cette m&eacute;thode est aussi tr&egrave;s pratique dans le cas de calcul de fonctions de transferts &agrave; l'aide d'outils informatiques&nbsp;: le probl&egrave;me est bien d&eacute;compos&eacute; et donc plus facile &agrave; simuler.</OL></OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME=AO09>MONTAGES DE BASE &Agrave; AOP.</A></H3>Dans "amplificateur op&eacute;rationnel", il y a deux mots&nbsp;:<P><STRONG> - amplificateur</STRONG>&nbsp;: c'est la fonction de base de ce composant&nbsp;; on va &eacute;tudier plusieurs montages amplificateurs de base.<P><STRONG> - op&eacute;rationnel</STRONG>&nbsp;: les caract&eacute;ristiques de cet ampli nous donnent la possibilit&eacute; de cr&eacute;er des fonctions math&eacute;matiques telles que d&eacute;riv&eacute;e, int&eacute;grale, Log... Ces fonctions ont autrefois (il y a 25 ans&nbsp;!) &eacute;t&eacute; utilis&eacute;es dans des calculateurs analogiques, et permettaient notamment de r&eacute;soudre des &eacute;quations diff&eacute;rentielles, et ainsi de simuler des r&eacute;ponses de syst&egrave;mes physiques divers (m&eacute;caniques, acoustiques...). D'o&ugrave; le nom "op&eacute;rationnel". Nous &eacute;tudierons les fonctions op&eacute;rationnelles de base.<OL TYPE=A><P>&nbsp;<LI><H4><A NAME=AO10>AMPLIFICATION</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO11>Amplificateur inverseur.</A></FONT></H5>C'est le montage de base &agrave; amplificateur op&eacute;rationnel. L'entr&eacute;e non inverseuse est reli&eacute;e &agrave; la masse&nbsp;; le signal d'entr&eacute;e est reli&eacute; &agrave; l'entr&eacute;e inverseuse par une r&eacute;sistance R<SUB>1</SUB>, et la sortie est reli&eacute;e &agrave; cette entr&eacute;e par une r&eacute;sistance R<SUB>2</SUB>.<P><CENTER><A NAME="F05"><IMG SRC="AOP.FIG/AOP009.GIF"></A></CENTER><P><CENTER>Fig. 5. Amplificateur inverseur.</CENTER><BR><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO12>Calcul par la loi d'ohm.</A></FONT></H5>La mise en &eacute;quation est tr&egrave;s simple, et s'appuie sur les conditions vues lors de la d&eacute;finition de l'AOP&nbsp;:<P> - les imp&eacute;dances d'entr&eacute;e &eacute;tant infinies, il n'y a pas de courant qui rentre dans l'entr&eacute;e inverseuse (V<SUB>-</SUB>)&nbsp;; par cons&eacute;quent, tout le courant i arrivant dans R<SUB>1</SUB> ira par R<SUB>2</SUB> vers la sortie de l'AOP.<P> - Le gain A<SUB>vd</SUB> est infini&nbsp;; dans ces conditions, (V<SUB>+</SUB> - V<SUB>-</SUB>) va tendre vers 0.<P>De cette derni&egrave;re constatation, on peut tirer une &eacute;quation simplissime, mais fondamentale, et toujours vraie en fonctionnement lin&eacute;aire&nbsp;:<P><CENTER><A NAME="EQ05"><IMG SRC="AOP.FIG/AOP010.GIF"></A></CENTER><P>Comme V<SUB>+</SUB> est &agrave; la masse, V<SUB>-</SUB> se retrouve au m&ecirc;me potentiel&nbsp;: comme ce point n'est pas reli&eacute; physiquement &agrave; la masse, on parle de masse virtuelle&nbsp;; pratiquement, et du point de vue calcul, tout se passe comme si V<SUB>-</SUB> &eacute;tait vraiment reli&eacute; &agrave; la masse.<P>Ces constatations &eacute;tant faites, le calcul du gain en tension est un jeu d'enfant&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP011.GIF"></CENTER><P><CENTER><IMG SRC="AOP.FIG/AOP012.GIF"></CENTER><P><CENTER><IMG SRC="AOP.FIG/AOP013.GIF"></CENTER><P>On fera attention &agrave; l'expression [7]&nbsp;: la tension et le courant sont dans le m&ecirc;me sens, d'o&ugrave; le signe -.<P>Le gain en tension est donc n&eacute;gatif, et sa valeur ne d&eacute;pend que des deux r&eacute;sistances R<SUB>1</SUB> et R<SUB>2</SUB>, qui peuvent &ecirc;tre tr&egrave;s pr&eacute;cises&nbsp;: contrairement aux montages &agrave; transistors, le r&eacute;sultat va &ecirc;tre fiable et r&eacute;p&eacute;table&nbsp;!<P>Le calcul de l'imp&eacute;dance d'entr&eacute;e est aussi simple&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP014.GIF"></CENTER><P><CENTER><IMG SRC="AOP.FIG/AOP015.GIF"></CENTER><P>On voit ici les limites de ce montage amplificateur&nbsp;: pour obtenir un fort gain en tension, il faut augmenter R<SUB>2</SUB> et diminuer R<SUB>1</SUB>&nbsp;; or, on va de ce fait diminuer l'imp&eacute;dance d'entr&eacute;e. Comme celle ci devra rester suffisamment grande et que d'autre part, on ne peut pas augmenter R<SUB>2</SUB> au del&agrave; de quelques M<IMG SRC="../BASE/ICONES/OHM.GIF"> (probl&egrave;mes de bruit, les imperfections des amplis r&eacute;els deviennent sensibles...), le gain sera limit&eacute; et ne pourra pas trop d&eacute;passer quelques centaines, ce qui est d&eacute;j&agrave; tr&egrave;s bon&nbsp;!<P>L'imp&eacute;dance de sortie sera nulle, comme celle de l'AOP, et comme celle de tous les autres montages bas&eacute;s sur un AOP&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP016.GIF"></CENTER><BR><BR><LI><H5><A NAME=AO13>Calcul par la m&eacute;thode des sch&eacute;mas-blocs.</A></FONT></H5>On a ici un r&eacute;seau de deux r&eacute;sistances partant de l'entr&eacute;e et aboutissant &agrave; la sortie, en passant par l'entr&eacute;e - de l'ampli.<P>Comment se ramener &agrave; un sch&eacute;ma &eacute;quivalent &agrave; celui de la <A HREF="#F04">figure 4</A>&nbsp;? D'abord, on remarque qu'aucun signal n'arrive sur l'entr&eacute;e&nbsp;+ de l'ampli&nbsp;: c'est un des cas o&ugrave; on va mettre un signe - au terme <IMG SRC="../BASE/ICONES/ALPHA.GIF" align=bottom>. Ensuite, pour calculer <IMG SRC="../BASE/ICONES/ALPHA.GIF" align=bottom> et B, il va falloir utiliser le <A HREF="../OUTILS/COURS.HTM#O58" target=_blank>th&eacute;or&egrave;me de superposition</A>.<P>Partant de ces deux remarques, on peut d&eacute;finir le quadrip&ocirc;le <IMG SRC="../BASE/ICONES/ALPHA.GIF" align=bottom> (figure 6). Il devrait th&eacute;oriquement arriver sur l'entr&eacute;e&nbsp;+ de l'ampli, on compensera le fait qu'il arrive sur l'entr&eacute;e&nbsp;- par un signe -. Pour d&eacute;terminer le quadrip&ocirc;le <IMG SRC="../BASE/ICONES/ALPHA.GIF" align=bottom>, on utilise le <A HREF="../OUTILS/COURS.HTM#O58" target=_blank>th&eacute;or&egrave;me de superposition</A>&nbsp;: on consid&egrave;re que V<SUB>s</SUB> est &eacute;gal &agrave; 0, seule compte la contribution de V<SUB>e</SUB>. La valeur de <IMG SRC="../BASE/ICONES/ALPHA.GIF" align=bottom> est alors triviale (<A HREF="../OUTILS/COURS.HTM#O48" target=_blank>pont diviseur</A>)&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP017.GIF"></CENTER><P><CENTER><IMG SRC="AOP.FIG/AOP018.GIF"></CENTER><P><CENTER>Fig. 6. Quadrip&ocirc;le <IMG SRC="../BASE/ICONES/ALPHA.GIF" align=bottom>.</CENTER><BR>De la m&ecirc;me mani&egrave;re, on va obtenir le quadrip&ocirc;le B&nbsp;: <A HREF="../OUTILS/COURS.HTM#O58" target=_blank>th&eacute;or&egrave;me de superposition</A>, on "&eacute;teint" la source V<SUB>e</SUB>, et ici, pas de signe -, car B reboucle bien sur l'entr&eacute;e - de l'ampli.<P><CENTER><IMG SRC="AOP.FIG/AOP019.GIF"></CENTER><P><CENTER>Fig. 7. Quadrip&ocirc;le B.</CENTER><BR>B vaudra&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP020.GIF"></CENTER><P>Au final, si on applique le r&eacute;sultat de l'&eacute;quation <A HREF="#EQ04">[4]</A> &agrave; nos valeurs, on obtient bien&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP021.GIF"></CENTER><P>On note que dans ce cas, la m&eacute;thode des sch&eacute;mas-blocs est plus longue que l'utilisation de la loi d'ohm&nbsp;: nous l'avons d&eacute;j&agrave; dit, elle devient "rentable" quand le sch&eacute;ma se complique, ou pour faire des simulations sur ordinateur (logiciels de trac&eacute; de courbes travaillant en complexes, calculateurs vectoriels et matriciels...)</UL><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO14>G&eacute;n&eacute;ralisation &agrave; des dip&ocirc;les quelconques.</A></FONT></H5><CENTER><IMG SRC="AOP.FIG/AOP022.GIF"></CENTER><P><CENTER>Fig. 8. Amplificateur inverseur g&eacute;n&eacute;ralis&eacute;.</CENTER><BR>On a pr&eacute;c&eacute;demment &eacute;tabli un r&eacute;sultat pour deux r&eacute;sistances R<SUB>1</SUB> et R<SUB>2</SUB>&nbsp;; on peut appliquer ce r&eacute;sultat &agrave; n'importe quels dip&ocirc;les d'imp&eacute;dances Z<SUB>1</SUB> et Z<SUB>2</SUB>. <STRONG>La condition que Z<SUB>1</SUB> et Z<SUB>2</SUB> soient des dip&ocirc;les est fondamentale</STRONG>. Le gain en tension est le suivant&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP023.GIF"></CENTER><BR>Ceci ouvre la voie &agrave; tout une panoplie de filtres et correcteurs en fr&eacute;quence divers et vari&eacute;s&nbsp;; le gros avantage de l'AOP par rapport &agrave; des circuits purement passifs, c'est qu'on va pouvoir amplifier le signal &agrave; certaines fr&eacute;quences, et non plus seulement l'att&eacute;nuer, ce qui offre des d&eacute;bouch&eacute;s nouveaux et int&eacute;ressants.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO15>Amplificateur non inverseur.</A></FONT></H5>L'amplificateur non inverseur est le deuxi&egrave;me amplificateur de base. Pour calculer le gain en tension, on va se servir de l'&eacute;quation <A HREF="#EQ05">[5]</A> et en d&eacute;duire&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP024.GIF"></CENTER><P>R<SUB>2</SUB> et R<SUB>1</SUB> forment un <A HREF="../OUTILS/COURS.HTM#O48" target=_blank>pont diviseur</A> entre V<SUB>s</SUB> et V<SUB>-</SUB> , soit&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP025.GIF"></CENTER><P>On en tire&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP026.GIF"></CENTER><P><CENTER><IMG SRC="AOP.FIG/AOP027.GIF"></CENTER><P><CENTER>Fig. 9. Amplificateur non inverseur.</CENTER><BR>Le gain est non seulement positif (ampli non inverseur), mais il est aussi toujours sup&eacute;rieur &agrave; 1, alors que l'ampli non inverseur autorisait un gain (en valeur absolue) inf&eacute;rieur &agrave; 1, soit une att&eacute;nuation. Notons que pour un ampli, cette caract&eacute;ristique n'est pas trop g&ecirc;nante...<P>Pour ce qui est de l'imp&eacute;dance d'entr&eacute;e, on attaque directement l'entr&eacute;e de l'ampli&nbsp;: elle sera donc infinie dans le cas d'un AOP, et tr&egrave;s grande dans tous les cas&nbsp;; de plus, elle ne d&eacute;pend pas du gain choisi, ce qui laisse plus de latitude dans le choix de R<SUB>1</SUB> et R<SUB>2</SUB> pour r&eacute;gler le gain que dans le cas du montage inverseur. L'imp&eacute;dance de sortie est nulle&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP028.GIF"></CENTER><P><CENTER><IMG SRC="AOP.FIG/AOP029.GIF"></CENTER><P>On a donc ici un ampli qui pr&eacute;sente des caract&eacute;ristiques id&eacute;ales&nbsp;! En pratique, seul le comportement en fr&eacute;quence de l'amplificateur op&eacute;rationnel r&eacute;el viendra ternir le tableau.<P>On notera la simplicit&eacute; de mise en &#156;uvre du montage, compar&eacute; &agrave; un &eacute;tage &agrave; transistor&nbsp;: imp&eacute;dances id&eacute;ales, gain ajustable &agrave; loisir et de fa&ccedil;on pr&eacute;cise, voire r&eacute;glable par un simple potentiom&egrave;tre, transmission de signaux continus, tout ceci avec un seul amplificateur op&eacute;rationnel (g&eacute;n&eacute;ralement en bo&icirc;tier 8 broches) et deux r&eacute;sistances&nbsp;!<P>Tout comme pour l'amplificateur inverseur, une g&eacute;n&eacute;ralisation de ce montage est faisable avec n'importe quels dip&ocirc;les d'imp&eacute;dance Z<SUB>1</SUB> et Z<SUB>2</SUB> rempla&ccedil;ant respectivement les r&eacute;sistances R<SUB>1</SUB> et R<SUB>2</SUB>. l'expression du gain devient&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP030.GIF"></CENTER><BR><BR><LI><H5><A NAME=AO16>Montage suiveur.</A></FONT></H5>Ce montage est une extrapolation de l'ampli pr&eacute;c&eacute;dent, avec R<SUB>1</SUB> = <IMG SRC="../BASE/ICONES/INF.GIF" align=bottom> et R<SUB>2</SUB> = 0. On obtient un montage tout simple, de gain unit&eacute;, dont la seule fonction est l'adaptation d'imp&eacute;dance. On le placera donc en tampon entre deux portions de circuit de fa&ccedil;on &agrave; les isoler l'une de l'autre pour pr&eacute;venir toute interaction parasite.<P>Ce circuit est aussi id&eacute;al en entr&eacute;e et en sortie d'un montage pour b&eacute;n&eacute;ficier d'imp&eacute;dance d'entr&eacute;e infinie (ou presque) et d'imp&eacute;dance de sortie tr&egrave;s basse.<P><CENTER><IMG SRC="AOP.FIG/AOP031.GIF"></CENTER><P><CENTER>Fig. 10. Amplificateur suiveur.</CENTER><BR></OL><P>&nbsp;<LI><H4><A NAME=AO17>MONTAGES OP&Eacute;RATIONNELS.</A></H4>Apr&egrave;s les fonctions d'amplification de base, on va voir plusieurs montages op&eacute;rationnels, dans le sens o&ugrave; ils vont r&eacute;aliser des op&eacute;rations arithm&eacute;tiques sur un ou plusieurs signaux.<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO18>Additionneur inverseur.</A></FONT></H5><CENTER><IMG SRC="AOP.FIG/AOP032.GIF"></CENTER><P><CENTER>Fig. 11. Amplificateur sommateur inverseur.</CENTER><BR>On a souvent besoin de m&eacute;langer plusieurs signaux ensemble&nbsp;; la difficult&eacute; r&eacute;side dans le fait qu'il faut &eacute;viter toute interaction de r&eacute;glage des gains affect&eacute;s aux diff&eacute;rentes entr&eacute;es, ceci pour deux raisons&nbsp;:<P> - si on doit recalculer tout l'&eacute;chafaudage &agrave; chaque modification du gain d'une entr&eacute;e, ou en cas de rajout d'une entr&eacute;e, le montage n'est pas vraiment pratique.<P> - on ne peut pas faire varier le gain de chaque voie ind&eacute;pendamment des autres, &agrave; l'aide d'un potentiom&egrave;tre, par exemple, alors que c'est une fonction souvent demand&eacute;e &agrave; ce genre de montage.<P>Le circuit d&eacute;crit ici permet de s'affranchir de ces d&eacute;fauts.<P>&Agrave; la base de ce montage, on retrouve l'amplificateur inverseur&nbsp;; on avait vu que l'entr&eacute;e inverseuse &eacute;tait consid&eacute;r&eacute;e comme une masse virtuelle, et qu'aucun courant n'entrait dans l'AOP. De ce fait, chaque courant i<SUB>i</SUB> ne d&eacute;pend que de la tension d'entr&eacute;e V<SUB>ei</SUB> et de R<SUB>i</SUB> relatif &agrave; sa branche&nbsp;: il n'y aura donc pas d'interaction entre les diff&eacute;rentes entr&eacute;es.<P>On a&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP033.GIF"></CENTER><BR><CENTER><IMG SRC="AOP.FIG/AOP034.GIF"></CENTER><BR><CENTER><IMG SRC="AOP.FIG/AOP035.GIF"></CENTER><P>La loi des n&#156;uds en V<SUB>-</SUB> nous donne&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP036.GIF"></CENTER><P>En sortie, on a&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP037.GIF"></CENTER><P>Au global, on obtient pour V<SUB>s</SUB>&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP038.GIF"></CENTER><P>On voit qu'on peut ajuster le gain globalement en jouant sur R, et le gain de chaque entr&eacute;e en jouant sur les r&eacute;sistances R<SUB>i</SUB>. Ce montage offre donc toutes les souplesses.<P>On peut obtenir un additionneur inverseur pur en fixant toutes les r&eacute;sistances du montage &agrave; la m&ecirc;me valeur.<P>Aux chapitre des inconv&eacute;nients, l'imp&eacute;dance d'entr&eacute;e de chaque voie i est &eacute;gale &agrave; la r&eacute;sistance R<SUB>i</SUB>&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP039.GIF"></CENTER><P> La latitude de r&eacute;glage cit&eacute;e pr&eacute;c&eacute;demment baisse donc un peu du fait de cette contrainte, car plus le gain sera &eacute;lev&eacute;, plus l'imp&eacute;dance d'entr&eacute;e sera faible.<P>Comme d'habitude, l'imp&eacute;dance de sortie de ce circuit est voisine de 0.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO19>Montage soustracteur (diff&eacute;rentiel).</A></FONT></H5>Ce montage permet d'amplifier la diff&eacute;rence de deux signaux. C'est un montage de base tr&egrave;s important en mesures.<P><CENTER><IMG SRC="AOP.FIG/AOP040.GIF"></CENTER><P><CENTER>Fig. 12. Amplificateur diff&eacute;rentiel.</CENTER><BR>Pour calculer le gain en tension de cet &eacute;tage, on va faire appel &agrave; la formule du <A HREF="../OUTILS/COURS.HTM#O48" target=_blank>pont diviseur</A> et au <A HREF="../OUTILS/COURS.HTM#O58" target=_blank>th&eacute;or&egrave;me de superposition</A>. Le lien va encore &ecirc;tre l'&eacute;quation&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP041.GIF"></CENTER><P>La tension sur l'entr&eacute;e non inverseuse est&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP042.GIF"></CENTER><P>La formule du <A HREF="../OUTILS/COURS.HTM#O48" target=_blank>pont diviseur</A> est ici appliqu&eacute;e sans approximation, car l'imp&eacute;dance d'entr&eacute;e de l'AOP est infinie.<P>Le calcul de la tension sur l'entr&eacute;e inverseuse se fait en deux temps, et avec l'aide du <A HREF="../OUTILS/COURS.HTM#O58" target=_blank>th&eacute;or&egrave;me de superposition</A>&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP043.GIF"></CENTER><P>Des &eacute;quations [29], [30] et [31], on tire&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP044.GIF"></CENTER><P>La formule g&eacute;n&eacute;rale de la tension de sortie de ce montage est donc&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP045.GIF"></CENTER><P>Tel quel, ce montage n'est pas un ampli de diff&eacute;rence&nbsp;; il faut imposer des conditions sur les r&eacute;sistances. Si on pose&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP046.GIF"></CENTER><P>en rempla&ccedil;ant k par sa valeur dans [33] et compte tenu de la propri&eacute;t&eacute; suivante&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP047.GIF"></CENTER><P>on obtient&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP048.GIF"></CENTER><P>On a bien en sortie la diff&eacute;rence des deux signaux d'entr&eacute;e multipli&eacute;e par le gain k.<P>Si les r&eacute;sistances ne sont pas bien appari&eacute;es deux &agrave; deux dans le rapport de k (condition [34]), le gain ne sera plus purement diff&eacute;rentiel&nbsp;; il va appara&icirc;tre un terme de mode commun. Ce d&eacute;faut sera expliqu&eacute; en d&eacute;tail dans le cours d'&eacute;lectronique 2 (Amplificateur d'instrumentation).<P>Les imp&eacute;dances d'entr&eacute;e Z<SUB>e1</SUB> et Z<SUB>e2</SUB> sont difficiles &agrave; cerner, surtout celle de l'entr&eacute;e inverseuse Z<SUB>e2</SUB>&nbsp;; on retiendra qu'elles sont diff&eacute;rentes, ce qui peut poser des probl&egrave;mes pour certaines applications.<P>On peut aussi d&eacute;finir une imp&eacute;dance d'entr&eacute;e diff&eacute;rentielle Z<SUB>ed</SUB> et une de mode commun Z<SUB>emc</SUB>. Une de ces imp&eacute;dances est constante, c'est l'imp&eacute;dance d'entr&eacute;e diff&eacute;rentielle Z<SUB>ed</SUB>&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP049.GIF"></CENTER><P>Cette valeur est &eacute;quivalente &agrave; ce qu'on obtient avec l'amplificateur inverseur&nbsp;: elle est faible quand le gain devient &eacute;lev&eacute;.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO20>Montage int&eacute;grateur.</A></FONT></H5>Nous attaquons ici les montages op&eacute;rationnels plus sophistiqu&eacute;s que de simples additions ou soustractions.<P><CENTER><IMG SRC="AOP.FIG/AOP050.GIF"></CENTER><P><CENTER>Fig. 13. Montage int&eacute;grateur.</CENTER><BR>Le calcul de la r&eacute;ponse V<SUB>s</SUB> &agrave; un signal d'entr&eacute;e V<SUB>e</SUB> se traite comme dans le cas de l'amplificateur inverseur. On a&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP051.GIF"></CENTER><P>En sortie, le condensateur a aux bornes de ses armatures une charge &eacute;lectrique q &eacute;gale &agrave;&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP052.GIF"></CENTER><P>Cette charge &eacute;lectrique est l'int&eacute;grale du courant i qui traverse le condensateur&nbsp;; compte tenu du sens de i, on a&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP053.GIF"></CENTER><P>Si on remplace dans [40] i et q par leur valeur en fonction de V<SUB>e</SUB> et de V<SUB>s</SUB> (&eacute;quations [38] et [39]), on obtient&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP054.GIF"></CENTER><P>On retrouve en sortie l'int&eacute;grale du signal d'entr&eacute;e. Ce montage est d&eacute;licat &agrave; utiliser et devra faire l'objet de pr&eacute;cautions&nbsp;: en effet, la moindre tension continue pr&eacute;sente &agrave; l'entr&eacute;e (y compris et surtout une tension parasite) sera int&eacute;gr&eacute;e et g&eacute;n&eacute;rera une rampe en sortie. Il faudra donc pr&eacute;voir des dispositifs annexes, soit un syst&egrave;me de stabilisation, soit un syst&egrave;me de remise &agrave; z&eacute;ro de la sortie.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO21>Montage d&eacute;rivateur.</A></FONT></H5>Ce montage est similaire au pr&eacute;c&eacute;dent et se traite de la m&ecirc;me mani&egrave;re.<P><CENTER><IMG SRC="AOP.FIG/AOP055.GIF"></CENTER><P><CENTER>Fig. 14. Montage d&eacute;rivateur.</CENTER><BR>En entr&eacute;e et en sortie, on a&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP056.GIF"></CENTER><P><CENTER><IMG SRC="AOP.FIG/AOP057.GIF"></CENTER><P>Le courant i est la d&eacute;riv&eacute;e de la charge &eacute;lectrique q pr&eacute;sente sur les &eacute;lectrodes du condensateur&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP058.GIF"></CENTER><P>Au final, on obtient&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP059.GIF"></CENTER><P>La sortie est proportionnelle &agrave; la d&eacute;riv&eacute;e de l'entr&eacute;e. Comme pour le montage pr&eacute;c&eacute;dent, avec un amplificateur r&eacute;el, on aura des difficult&eacute;s &agrave; faire fonctionner ce circuit tel quel (syst&egrave;me instable), et il faudra <A HREF="ANNEXE/ANAOP06.HTM" target=_blank>rajouter des &eacute;l&eacute;ments pour le rendre pleinement fonctionnel</A>.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO22>Montage logarithmique.</A></FONT></H5>Dans ce montage, on retrouve la structure traditionnelle de l'ampli inverseur, mais avec une diode en contre-r&eacute;action. Cette diode, dont la caract&eacute;ristique courant/tension est logarithmique va nous donner une fonction de transfert de ce type. En entr&eacute;e, on a&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP060.GIF"></CENTER><P>Et en sortie&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP061.GIF"></CENTER><P><CENTER><IMG SRC="AOP.FIG/AOP062.GIF"></CENTER><P>Lorsque le terme en exponentielle est significativement sup&eacute;rieur &agrave; 1 (V<SUB>d</SUB> > 50mV environ), on peut &eacute;crire&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP063.GIF"></CENTER><P>Soit, en rempla&ccedil;ant i par sa valeur&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP064.GIF"></CENTER><P><CENTER><IMG SRC="AOP.FIG/AOP065.GIF"></CENTER><P><CENTER>Fig. 15. Montage logarithmique.</CENTER><BR>En sortie, on trouve bien une fonction logarithmique du signal d'entr&eacute;e. Tel quel, ce montage aurait peu d'int&eacute;r&ecirc;t&nbsp;; mais, si on se rappelle qu'additionner des logarithmes revient &agrave; faire une multiplication, on en per&ccedil;oit l'utilit&eacute;&nbsp;!<P>En pratique, et une fois de plus, ce montage (bien que fonctionnel) n'est pas utilis&eacute; tel quel&nbsp;: d'abord, il ne fonctionne que pour des tensions d'entr&eacute;e positives, et il n&eacute;cessite de s&eacute;rieuses compensations thermiques pour permettre des op&eacute;rations pr&eacute;cises. De plus, on remplace souvent la diode par une jonction base-&eacute;metteur de transistor, lin&eacute;aire sur une plus grande plage de courant.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO23>Montage exponentiel.</A></FONT></H5>Pour multiplier deux signaux, il ne suffit pas de prendre le Log de chacun des signaux, et d'additionner&nbsp;; il faut ensuite prendre l'exponentielle du r&eacute;sultat. Ce circuit est fait pour &ccedil;a.<P><CENTER><IMG SRC="AOP.FIG/AOP066.GIF"></CENTER><P><CENTER>Fig. 16. Montage exponentiel.</CENTER><BR>Par des calculs analogues aux pr&eacute;c&eacute;dents, on d&eacute;montre facilement et de la m&ecirc;me mani&egrave;re&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP067.GIF"></CENTER><P>En pratique, on trouve des circuits int&eacute;gr&eacute;s tout faits comprenant le montage Log, le montage exponentiel, ainsi que les compensations thermiques et diverses possibilit&eacute;s de r&eacute;glage de gain. Ces montages sont des multiplieurs analogiques, et servent notamment, en mesures, &agrave; lin&eacute;ariser certains capteurs. A noter que ces composants sont d&eacute;licats, co&ucirc;teux, et pr&eacute;sentent des d&eacute;rives importantes. L'utilit&eacute; de tels montages est devenue douteuse avec l'introduction massive du traitement num&eacute;rique.</OL><P>&nbsp;<LI><H4><A NAME=AO24>FILTRAGE.</A></H4>L'amplificateur op&eacute;rationnel ouvre les portes d'une kyrielle de fonctions de filtrage, qu'on d&eacute;nomme filtres actifs, par opposition aux filtres passifs (fabriqu&eacute;s avec des composants du m&ecirc;me nom) qui ne peuvent qu'att&eacute;nuer le signal. Avec un AOP, on va pouvoir amplifier certaines fr&eacute;quences autant qu'en att&eacute;nuer d'autres.<P>Il est hors de question d'aborder ici tous les filtres possibles (exercice qui n'a de limite que la cr&eacute;ativit&eacute; humaine&nbsp;!)&nbsp;: le lecteur d&eacute;sireux d'approfondir le sujet pourra consulter des ouvrages sp&eacute;cialis&eacute;s dans le filtrage, et aussi les data books des fabricants d'amplificateurs, qui sont bien souvent une mine d'id&eacute;es gratuites (qu'on retrouve d'ailleurs souvent telles quelles dans des livres chers...).<P>Les filtres classiques d'ordre 1 pr&eacute;sentent peu d'int&eacute;r&ecirc;t en filtrage actif, l'apport &eacute;tant faible (au mieux, adaptation d'imp&eacute;dance) par rapport au filtrage passif.<P>Nous allons voir deux filtres du deuxi&egrave;me ordre dont la fonction de transfert pr&eacute;sente des racines imaginaires&nbsp;; ceci n'est possible en filtrage passif que si on fait appel &agrave; des inductances, qui sont des composants encombrants, rares, impr&eacute;cis et co&ucirc;teux. Gr&acirc;ce &agrave; l'AOP, on va faire de tels filtres uniquement avec des r&eacute;sistances et des condensateurs. <OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO25>Passe bas 2e ordre.</A></FONT></H5><CENTER><IMG SRC="AOP.FIG/AOP068.GIF"></CENTER><P><CENTER>Fig. 17. Filtre passe bas du deuxi&egrave;me ordre.</CENTER><BR>On peut remarquer qu'&agrave; la base, la structure ressemble fort &agrave; deux filtres passifs R-C passe bas concat&eacute;n&eacute;s. La diff&eacute;rence vient du fait que le premier condensateur n'est pas reli&eacute; &agrave; la masse, mais &agrave; la sortie du filtre qui est isol&eacute;e de la deuxi&egrave;me cellule passe-bas par un montage suiveur.<P>La r&eacute;ponse en fr&eacute;quence de ce montage est du type&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP069.GIF"></CENTER><P>La fonction de transfert "g&eacute;n&eacute;rique" d'un filtre passe bas d'ordre 2 est du type&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP070.GIF"></CENTER><P>On identifie les deux formules pour les valeurs suivantes de <IMG SRC="../BASE/ICONES/PULS.GIF" align=bottom>o et z&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP071.GIF"></CENTER><P><CENTER><IMG SRC="AOP.FIG/AOP072.GIF"></CENTER><P>Le r&eacute;seau de courbes de r&eacute;ponse en fr&eacute;quence (amplitude et phase) de ce filtre est donn&eacute; en <A HREF="ANNEXE/ANAOP01.GIF" target=_blank>annexe 1</A> en fonction du coefficient de surtension z.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO26>Passe haut 2e ordre.</A></FONT></H5><CENTER><IMG SRC="AOP.FIG/AOP073.GIF"></CENTER><P><CENTER>Fig. 18. Filtre passe haut du deuxi&egrave;me ordre.</CENTER><BR>La topologie de ce filtre est la m&ecirc;me que celle du pr&eacute;c&eacute;dent, sauf qu'on a permut&eacute; les r&eacute;sistances et les condensateurs. La fonction de transfert est&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP074.GIF"></CENTER><P>La pulsation de cassure et le coefficient de surtension de ce filtre sont&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP075.GIF"></CENTER><P><CENTER><IMG SRC="AOP.FIG/AOP076.GIF"></CENTER><P>La r&eacute;ponse en fr&eacute;quence (amplitude et phase) de ce filtre est donn&eacute;e en <A HREF="ANNEXE/ANAOP02.GIF" target=_blank>annexe 2</A>.<P>Il est possible de concat&eacute;ner les deux filtres pr&eacute;c&eacute;dents, et de les combiner avec des filtres du premier ordre pour obtenir un filtre d'ordre plus &eacute;lev&eacute;. Des ouvrages traitant des filtres donnent les valeurs des fr&eacute;quences de cassure et coefficients de surtension ad&eacute;quats pour obtenir la r&eacute;ponse en fr&eacute;quence d&eacute;sir&eacute;e.</OL><P>&nbsp;<LI><H4><A NAME=AO27>MONTAGES NON LIN&Eacute;AIRES.</A></H4>Les montages pr&eacute;c&eacute;dents sont qualifi&eacute;s de "lin&eacute;aires" car l'amplificateur fonctionne avec la condition V<SUB>+</SUB> = V<SUB>-</SUB> , soit dans sa plage de fonctionnement en amplificateur lin&eacute;aire. Il convient de noter que certains des montages &eacute;tudi&eacute;s (ex&nbsp;: montage logarithmique) ne sont pas lin&eacute;aires&nbsp;! Mais, l'amplificateur, lui, fonctionne en mode lin&eacute;aire.<P>Nous allons voir maintenant plusieurs montages (et il en existe bien d'autres) dans lesquels cette condition n'est plus v&eacute;rifi&eacute;e.<P>Pour ce faire, on va forcer artificiellement les deux entr&eacute;es &agrave; des valeurs diff&eacute;rentes, ce qui impliquera en sortie, du fait du gain infini (tr&egrave;s grand pour les amplis r&eacute;els), que l'ampli ne pourra prendre que deux valeurs&nbsp;: V<SUB>sat+</SUB> et V<SUB>sat-</SUB>, qui sont respectivement les tensions de saturation positive et n&eacute;gative de l'ampli. En effet , ce dernier est <A HREF="#AO38">aliment&eacute;</A> par deux sources de tension dont on ne pourra pas d&eacute;passer la valeurs en sortie.<P>Vu que l'ampli ne peut prendre que les deux valeurs des tension en sortie, ces montages sont appel&eacute;s montages en commutation, et peuvent &ecirc;tre interfac&eacute;s avec des circuits logiques, qui ne connaissent, eux aussi, que deux &eacute;tats.<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO28>Comparateur de tensions.</A></FONT></H5>C'est un montage qui sert de base &agrave; de nombreux autres sch&eacute;mas plus &eacute;labor&eacute;s.<P>Le principe est simple&nbsp;: on compare un signal d'entr&eacute;e &agrave; une tension de r&eacute;f&eacute;rence, et selon que la valeur du signal est sup&eacute;rieure ou inf&eacute;rieure &agrave; la r&eacute;f&eacute;rence, l'ampli prendra l'une ou l'autre des valeurs V<SUB>sat+</SUB> ou V<SUB>sat-</SUB> en sortie.<P>Il existe deux configurations&nbsp;: le comparateur non inverseur (signal sur l'entr&eacute;e +) et le comparateur inverseur (signal sur l'entr&eacute;e -). Dans le premier cas, si la r&eacute;f&eacute;rence est &eacute;gale &agrave; 0, la sortie vaut V<SUB>sat+</SUB> quand le signal est positif et V<SUB>sat-</SUB> sinon. Dans le deuxi&egrave;me cas, on a l'inverse.<P><CENTER><IMG SRC="AOP.FIG/AOP077.GIF"></CENTER><P><CENTER>Fig. 19. Comparateur non inverseur.</CENTER><BR>Si on met un signal sinuso&iuml;dal &agrave; l'entr&eacute;e, les chronogrammes d'entr&eacute;e et de sortie sont&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP078.GIF"></CENTER><P><CENTER>Fig. 20. Comparateur&nbsp;: chronogrammes</CENTER><BR><STRONG>Important</STRONG>&nbsp;: ce montage est souvent fait avec des amplificateurs op&eacute;rationnels, mais on remplacera avantageusement ce composant par un comparateur diff&eacute;rentiel, qui est une sorte d'amplificateur &agrave; grand gain et deux entr&eacute;es aussi, mais qui est pr&eacute;vu pour fonctionner en mode non lin&eacute;aire (commutation) de fa&ccedil;on bien plus rapide qu'un ampli op qui n'a pas des <A HREF="#AO50">caract&eacute;ristiques exceptionnelles</A> dans ce domaine. De plus, ces composants sont souvent con&ccedil;us pour fonctionner avec une seule alimentation 0-5V de mani&egrave;re &agrave; s'interfacer facilement avec des composants logiques.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO29>Trigger.</A></FONT></H5>Ce montage est tr&egrave;s utilis&eacute; dans tout syst&egrave;me de mesure o&ugrave; l'on doit d&eacute;tecter un seuil&nbsp;: il est donc fondamental.<P>Il est une &eacute;volution du comparateur, destin&eacute;e &agrave; am&eacute;liorer les performances avec des signaux bruit&eacute;s.<P>Il existe plusieurs sch&eacute;mas possibles. Le montage suivant a &eacute;t&eacute; choisi comme cas d'&eacute;cole&nbsp;:<P><CENTER><A NAME="F21"><IMG SRC="AOP.FIG/AOP079.GIF"></A></CENTER><P><CENTER>Fig. 21. Trigger.</CENTER><BR>A premi&egrave;re vue, ce montage ressemble &agrave; un ampli inverseur, mais, il ne faut pas se tromper&nbsp;: le r&eacute;seau de r&eacute;sistances R<SUB>1</SUB>, R<SUB>2</SUB> est reli&eacute; &agrave; l'entr&eacute;e +, ce qui fait que cette fois, le signal de sortie revient en phase sur l'entr&eacute;e&nbsp;; on a non plus une contre r&eacute;action, mais une r&eacute;action positive (effet boule de neige), ce qui entra&icirc;ne la divergence de la tension de sortie vers une des valeurs V<SUB>sat+</SUB> ou V<SUB>sat-</SUB> .<P>Dans ce montage (et les autres montages non lin&eacute;aires), l'amplificateur fonctionne en comparateur&nbsp;: comme le gain est infini (ou tr&egrave;s grand), on a les relations&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP080.GIF"></CENTER><P><CENTER><IMG SRC="AOP.FIG/AOP081.GIF"></CENTER><P>Ici, la valeur de V<SUB>-</SUB> est triviale&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP082.GIF"></CENTER><P>Et la valeur de V<SUB>+</SUB> se calcule ais&eacute;ment &agrave; l'aide du <A HREF="../OUTILS/COURS.HTM#O58" target=_blank>th&eacute;or&egrave;me de superposition</A>&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP083.GIF"></CENTER><P>Le basculement de la sortie de l'ampli se fait pour V<SUB>+</SUB> = V<SUB>-</SUB>&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP084.GIF"></CENTER><P>Dans cette formule, il faut garder &agrave; l'esprit que V<SUB>s</SUB> ne peut prendre que les deux valeurs V<SUB>sat+</SUB> et V<SUB>sat-</SUB> .<P>Dans le cas particulier o&ugrave; V<SUB>ref</SUB> = 0 et V<SUB>sat+</SUB> = |V<SUB>sat-</SUB>| = V<SUB>sat</SUB>, on aura&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP085.GIF"></CENTER><P>La figure 22 donne les signaux d'entr&eacute;e, de sortie, et de l'entr&eacute;e + de l'amplificateur, pour R<SUB>1</SUB>=10k<IMG SRC="../BASE/ICONES/OHM.GIF"> et R<SUB>2</SUB>=33k<IMG SRC="../BASE/ICONES/OHM.GIF">&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP086.GIF"></CENTER><P><CENTER>Fig. 22. Signaux sur le trigger</CENTER><BR>En fait, tout se passe comme si on avait un comparateur de tension ayant deux seuils de basculement li&eacute;s aux &eacute;tats de la sortie&nbsp;: quand la sortie est &agrave; l'&eacute;tat bas, le seuil a une valeur haute&nbsp;; pass&eacute; ce seuil, la sortie bascule &agrave; l'&eacute;tat haut, et le seuil prend une valeur basse. De ce fait, pour faire rebasculer la sortie &agrave; l'&eacute;tat bas, il faut que le signal diminue d'une quantit&eacute; sup&eacute;rieure &agrave; la valeur l'ayant faite basculer pr&eacute;c&eacute;demment&nbsp;: c'est l'hyst&eacute;r&eacute;sis du trigger.<P>Un trigger est caract&eacute;ris&eacute; par son cycle d'hyst&eacute;r&eacute;sis (la r&eacute;ponse est diff&eacute;rente suivant la valeur de l'&eacute;tat de la sortie).<P>Le cycle relatif aux signaux de la figure 22 (m&ecirc;mes valeurs de composants) est le suivant&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP087.GIF"></CENTER><P><CENTER>Fig. 23. Cycle d'hyst&eacute;r&eacute;sis du trigger</CENTER><BR>Ce cycle est centr&eacute; autour de z&eacute;ro, qui est la valeur de la tension de r&eacute;f&eacute;rence V<SUB>ref</SUB>. On y voit les deux seuils de basculement de la sortie&nbsp;; La diff&eacute;rence de ces deux seuils est la valeur de l'hyst&eacute;r&eacute;sis.<P>Ce cycle est ici sym&eacute;trique pour deux raisons&nbsp;:<P> - V<SUB>ref</SUB> = 0<P> - V<SUB>sat+</SUB> = |V<SUB>sat-</SUB>| = V<SUB>sat</SUB><P>Si on modifie ces valeurs, le cycle va devenir asym&eacute;trique par rapport &agrave; la tension de r&eacute;f&eacute;rence.<P>Quelle est l'utilit&eacute; d'un tel montage&nbsp;? Lorsqu'on doit transformer un signal analogique en signal num&eacute;rique binaire (deux &eacute;tats d&eacute;finis par une valeur de seuil sur le signal analogique), si le signal d'entr&eacute;e varie tr&egrave;s lentement et/ou est bruit&eacute;, on peut avoir un ph&eacute;nom&egrave;ne oscillatoire en sortie de l'amplificateur d&ucirc; au bruit ou &agrave; des r&eacute;actions parasites de la sortie sur l'entr&eacute;e. Pour pr&eacute;venir ces oscillations, on "verrouille" le signal de sortie en en r&eacute;injectant une partie sur l'entr&eacute;e +. Pour qu'il y ait des oscillations parasites, il faut que la tension d'entr&eacute;e varie de l'oppos&eacute; de la valeur de l'hyst&eacute;r&eacute;sis juste apr&egrave;s le basculement. Cette derni&egrave;re est ainsi ajust&eacute;e en fonction du bruit pr&eacute;sent sur le signal d'entr&eacute;e.<P>Comme pour le montage comparateur vu pr&eacute;c&eacute;demment, un comparateur diff&eacute;rentiel remplacera avantageusement l'amplificateur op&eacute;rationnel.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO30>Multivibrateur astable.</A></FONT></H5>Le but de ce montage est de d&eacute;livrer un signal carr&eacute; en sortie&nbsp;: c'est un g&eacute;n&eacute;rateur de signal autonome.<P><CENTER><IMG SRC="AOP.FIG/AOP088.GIF"></CENTER><P><CENTER>Fig. 24. Multivibrateur astable.</CENTER><BR>Sur le sch&eacute;ma, on peut distinguer un trigger l&eacute;g&egrave;rement diff&eacute;rent de celui de la <A HREF="#F21">figure 21</A>&nbsp;: l'entr&eacute;e se fait sur l'entr&eacute;e - de l'ampli&nbsp;; l'hyst&eacute;r&eacute;sis se fait l&agrave; aussi par un r&eacute;seau de r&eacute;sistances en r&eacute;action positive sur l'entr&eacute;e +, une des extr&eacute;mit&eacute;s de R<SUB>1</SUB> &eacute;tant reli&eacute;e &agrave; la tension de r&eacute;f&eacute;rence (ici, la masse).<P> L'entr&eacute;e est connect&eacute;e ici &agrave; un circuit R-C aliment&eacute; par la sortie de l'amplificateur.<P>Un oscillogramme est donn&eacute; en figure 25, qui permet de mieux comprendre le fonctionnement de ce montage.<P><CENTER><IMG SRC="AOP.FIG/AOP089.GIF"></CENTER><P><CENTER>Fig. 25. Signaux sur un multivibrateur</CENTER><BR>Nous ferons l'hypoth&egrave;se que V<SUB>sat+</SUB> = |V<SUB>sat-</SUB>| = V<SUB>sat</SUB>.<P>Supposons qu'&agrave; la mise sous tension, le condensateur soit d&eacute;charg&eacute;, et que V<SUB>s</SUB>=+V<SUB>sat</SUB>. La tension aux bornes de V<SUB>+</SUB> est donn&eacute;e par la relation suivante (elle est positive)&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP090.GIF"></CENTER><P>La sortie alimente un circuit R-C, et C se charge selon la loi exponentielle suivante&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP091.GIF"></CENTER><P>Lorsque V<SUB>-</SUB> = V<SUB>+</SUB>, le trigger bascule (voir figure 25), et on applique alors une tension -V<SUB>sat</SUB> sur le R-C qui devra se d&eacute;charger de la valeur de l'hyst&eacute;r&eacute;sis du trigger avant que la sortie ne bascule &agrave; nouveau, et ainsi de suite.<P>Avec les hypoth&egrave;ses pr&eacute;c&eacute;dentes (V<SUB>sat+</SUB> = |V<SUB>sat-</SUB>| = V<SUB>sat</SUB>), on aura en sortie du multivibrateur un signal carr&eacute; (rapport cyclique &eacute;gal &agrave; 0.5), de fr&eacute;quence &eacute;gale &agrave;&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP092.GIF"></CENTER><P>En pratique, le signal aura un rapport cyclique diff&eacute;rent de 1/2 car les tensions de saturation de l'ampli ne sont pas &eacute;gales, et varient avec la temp&eacute;rature, la charge... <P>Pour obtenir un signal "carr&eacute;" convenable, on utilisera un ampli &agrave; fort <A HREF="#AO50">slew rate</A>, ou beaucoup mieux, comme pour le trigger, un comparateur diff&eacute;rentiel.<P>Ce type de montage est important du point de vue principe, mais en pratique, il existe des solutions beaucoup plus "propres" pour g&eacute;n&eacute;rer un signal carr&eacute;. On n'utilisera donc ce montage qu'&agrave; titre de d&eacute;pannage&nbsp;!<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO31>Redresseur sans seuil.</A></FONT></H5><CENTER><IMG SRC="AOP.FIG/AOP093.GIF"></CENTER><P><CENTER>Fig. 26. Redresseur sans seuil.</CENTER><BR>On a vu dans le cours sur les diodes que le gros probl&egrave;me de ce composant, pour redresser des faibles tensions, provient de son seuil &eacute;lev&eacute; (>0.5V pour le silicium), qui d&eacute;pend en plus de la temp&eacute;rature. Cette caract&eacute;ristique interdit le redressement de faibles signaux avec une pr&eacute;cision d&eacute;cente. L'amplificateur op&eacute;rationnel va nous aider&nbsp;!<P>Le montage est celui de la figure 26&nbsp;: le montage ressemble &agrave; un suiveur auquel on a adjoint une diode en s&eacute;rie avec l'amplificateur.<P>Pour des tensions d'entr&eacute;e n&eacute;gatives, la sortie de l'ampli va avoir tendance &agrave; devenir n&eacute;gative, mais, elle est bloqu&eacute;e par la diode&nbsp;: il n'y a pas de contre-r&eacute;action, car le signal de sortie de l'ampli ne peut pas revenir sur l'entr&eacute;e -. Dans ce cas, la tension de sortie de l'amplificateur va prendre la valeur V<SUB>sat-</SUB>, et la tension de sortie du montage va &ecirc;tre nulle.<P>Lorsque la tension d'entr&eacute;e va devenir positive, la sortie de l'amplificateur va devenir positive aussi, et elle va augmenter jusqu'&agrave; la valeur de la tension de seuil de la diode, et la contre r&eacute;action sur l'entr&eacute;e - va pouvoir se faire, la tension en sortie de l'ampli prenant la valeur V<SUB>d</SUB> + V<SUB>e</SUB>, de mani&egrave;re &agrave; ce que V<SUB>+</SUB> soit &eacute;gal &agrave; V<SUB>-</SUB> (donc &agrave; V<SUB>s</SUB>).<P>En bilan, pour des tensions positives, V<SUB>s</SUB> = V<SUB>e</SUB> , et pour des tensions n&eacute;gatives, V<SUB>s</SUB> = 0&nbsp;: on a un redresseur id&eacute;al. <P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO32>D&eacute;tecteur de cr&ecirc;te.</A></FONT></H5><CENTER><IMG SRC="AOP.FIG/AOP094.GIF"></CENTER><P><CENTER>Fig. 27. D&eacute;tecteur de cr&ecirc;te.</CENTER><BR>Pour conserver la valeur cr&ecirc;te d'une tension, on peut commencer par redresser celle-ci, et en adjoignant un condensateur au montage redresseur pr&eacute;c&eacute;dent, il est possible de garder en m&eacute;moire la valeur de cr&ecirc;te.<P>Le fonctionnement est le m&ecirc;me que pour le redresseur sans seuil, sauf que le condensateur va se charger, et quand la tension d'entr&eacute;e va diminuer, le condensateur va conserver sa charge (&agrave; condition que l'entr&eacute;e - de l'ampli soit &agrave; tr&egrave;s haute imp&eacute;dance et que la charge de sortie ait aussi une tr&egrave;s haute imp&eacute;dance -montage suiveur par exemple), et la diode va se bloquer, car la tension de sortie va diminuer jusqu'&agrave; la valeur -V<SUB>sat</SUB> (plus de contre r&eacute;action &agrave; cause de la diode).<P>Il faut pr&eacute;voir un dispositif annexe pour d&eacute;charger le condensateur afin de faire une nouvelle mesure&nbsp;: sur le sch&eacute;ma, on a plac&eacute; un simple transistor de fa&ccedil;on sch&eacute;matique, mais celui-ci pourra &ecirc;tre remplac&eacute; avantageusement par un commutateur analogique &agrave; base de FET ou de MOS.<P>NB&nbsp;: dans ce montage, on peut remplacer la diode par un commutateur analogique bi-directionnel commandable en tension. On va alors pouvoir bloquer le signal &agrave; l'instant d&eacute;sir&eacute; et le conserver&nbsp;; c'est le principe de base de l'&eacute;chantillonneur-bloqueur (voir cours d'&eacute;lectronique 2).</OL></OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME=AO33>L'AMPLIFICATEUR OP&Eacute;RATIONNEL R&Eacute;EL.</A></H3>Avant d'attaquer tous les d&eacute;fauts de l'amplificateur r&eacute;el, et afin de mieux les comprendre, nous allons &eacute;tudier un sch&eacute;ma de principe de cet amplificateur.<P>Ce sch&eacute;ma n'est &eacute;videmment pas un sch&eacute;ma r&eacute;el, mais il contient tous les ingr&eacute;dients fondamentaux d'un amplificateur&nbsp;; c'est cette architecture qui est aussi utilis&eacute;e dans des montages de puissance (amplificateurs HIFI et industriels), et donc, la compr&eacute;hension de cette architecture est importante et permettra d'investiguer des domaines autres que celui de l'amplificateur op&eacute;rationnel.<OL TYPE=A><P>&nbsp;<LI><H4><A NAME=AO34>SCH&Eacute;MA INTERNE DE PRINCIPE.</A></H4>Sur le sch&eacute;ma de la <A HREF="#F28">figure 28</A>, nous avons repr&eacute;sent&eacute; les deux alimentations V<SUB>al+</SUB> (positive) et V<SUB>al-</SUB> (n&eacute;gative), les deux entr&eacute;es V<SUB>+</SUB> et V<SUB>-</SUB>, et la sortie V<SUB>s</SUB> de l'amplificateur.<P>L'ampli est constitu&eacute; de trois &eacute;tages&nbsp;:<P> - un &eacute;tage d'entr&eacute;e diff&eacute;rentiel (T<SUB>1</SUB> et T<SUB>2</SUB>), avec sa charge d'&eacute;metteurs (source de courant I<SUB>1</SUB>) et ses charges de collecteurs (miroir de courant T<SUB>3</SUB> et T<SUB>4</SUB>).<P> - un &eacute;tage de gain form&eacute; de T<SUB>5</SUB> et de sa charge active I<SUB>2</SUB>.<P> - un &eacute;tage de sortie push pull constitu&eacute; par les transistors T<SUB>6</SUB> et T<SUB>7</SUB> polaris&eacute;s par les diodes D<SUB>1</SUB> et D<SUB>2</SUB>.<P> <BR><CENTER><A NAME="F28"><IMG SRC="AOP.FIG/AOP095.GIF"></A></CENTER><P><CENTER>Fig. 28. Sch&eacute;ma de principe d'un amplificateur.</CENTER><BR><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO35>&Eacute;tage diff&eacute;rentiel&nbsp;:</A></FONT></H5>On a repr&eacute;sent&eacute; ici un &eacute;tage diff&eacute;rentiel classique&nbsp;: deux transistors mont&eacute;s dans une configuration de type &eacute;metteur commun (entr&eacute;e sur la base, sortie sur le collecteur) avec les deux &eacute;metteurs reli&eacute;s &agrave; une source de courant. Cette source I<SUB>1</SUB> doit &ecirc;tre la plus proche possible de l'id&eacute;al, car la valeur de sa r&eacute;sistance interne d&eacute;termine le taux de r&eacute;jection du mode commun.<P>Les charges de collecteur ne sont pas des r&eacute;sistances, mais des charges actives, constitu&eacute;es des transistors T<SUB>3</SUB> et T<SUB>4</SUB> mont&eacute;s en miroir de courant&nbsp;: le transistor T<SUB>3</SUB> est utilis&eacute; en diode (le collecteur est reli&eacute; &agrave; la base), et d&eacute;termine le potentiel de base de T<SUB>4</SUB>, donc son courant de collecteur. Sur le circuit int&eacute;gr&eacute;, on peut construire T<SUB>3</SUB> et T<SUB>4</SUB> de mani&egrave;re &agrave; ce qu'ils aient les m&ecirc;mes caract&eacute;ristiques de gain, V<SUB>be</SUB>... (idem pour T<SUB>1</SUB> et T<SUB>2</SUB>)&nbsp;: le courant dans la branche T<SUB>1</SUB>/T<SUB>3</SUB> sera le m&ecirc;me que celui de la branche T<SUB>2</SUB>/T<SUB>4</SUB>.<P>On d&eacute;montre que le miroir de courant est une astuce permettant de doubler le gain de l'&eacute;tage diff&eacute;rentiel.<P>La sortie de cet &eacute;tage se fait sur le collecteur de T<SUB>2</SUB>, et c'est la r&eacute;sistance dynamique de T<SUB>4</SUB> (le 1/h<SUB>22</SUB>) qui charge T<SUB>2</SUB>. Le gain sera donc plus &eacute;lev&eacute; que si on avait une simple r&eacute;sistance &agrave; la place de T<SUB>4</SUB>.<P>Le gain de cet &eacute;tage est de l'ordre de 100.<P>L'imp&eacute;dance d'entr&eacute;e diff&eacute;rentielle de ce montage est &eacute;gale &agrave; 2h<SUB>11</SUB> (le h<SUB>11</SUB> de T<SUB>1</SUB> ou de T<SUB>2</SUB>). Pour que cette imp&eacute;dance soit grande (1M<IMG SRC="../BASE/ICONES/OHM.GIF"> pour un &#181;A741), il faut que le courant de polarisation de base soit tr&egrave;s faible (quelque dizaines de nA).<P>Les amplificateurs plus r&eacute;cents font en g&eacute;n&eacute;ral appel &agrave; des transistors FET en entr&eacute;e (LF356 de NS, TL081 de Texas...) voire MOS (LMC660). La structure de l'&eacute;tage reste similaire.<P>En pratique, les montages sont un peu plus compliqu&eacute;s, et les transistors T<SUB>1</SUB> et T<SUB>2</SUB> sont souvent remplac&eacute;s par 4 transistors, deux collecteurs communs qui attaquent deux bases communes. C'est une astuce technologique permettant d'am&eacute;liorer la plage d'entr&eacute;e diff&eacute;rentielle de l'ampli.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO36>L'&eacute;tage de gain&nbsp;:</A></FONT></H5>Le deuxi&egrave;me &eacute;tage est tr&egrave;s simple, c'est un montage &eacute;metteur commun constitu&eacute; de T<SUB>5</SUB>, charg&eacute; par une source de courant (en g&eacute;n&eacute;ral, c'est encore un montage &agrave; miroir de courant)&nbsp;: la charge dynamique de T<SUB>5</SUB> est donc la r&eacute;sistance parall&egrave;le de la source de courant I<SUB>2</SUB>&nbsp;; le gain est tr&egrave;s &eacute;lev&eacute; (environ 1000, ce qui fait un ordre de grandeur de 10<SUP>5</SUP> pour l'ensemble&nbsp;!).<P>On note la capacit&eacute; C entre base et collecteur du transistor T<SUB>5</SUB>&nbsp;: c'est une capacit&eacute; destin&eacute;e &agrave; la compensation de l'amplificateur&nbsp;; la fr&eacute;quence de cassure de ce filtre est tr&egrave;s basse (quelques dizaines d'hertz) et permet &agrave; la plupart des amplis d'&ecirc;tre <A HREF="#AO72">inconditionnellement stables</A>. Cette capacit&eacute; utilise <A HREF="../TRANS/COURS.HTM#T61" target=_blank>l'effet miller</A>&nbsp;: le filtre est constitu&eacute; de l'imp&eacute;dance de sortie du premier &eacute;tage (tr&egrave;s &eacute;lev&eacute;e) et de la capacit&eacute; C, le tout multipli&eacute;e par le gain en tension du deuxi&egrave;me &eacute;tage. On peut obtenir une fr&eacute;quence de cassure tr&egrave;s faible avec une capacit&eacute; tr&egrave;s petite (quelques dizaines de pF), qui peut ainsi &ecirc;tre int&eacute;gr&eacute;e sur la puce.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO37>L'&eacute;tage de sortie&nbsp;:</A></FONT></H5>C'est un &eacute;tage push pull constitu&eacute; de deux transistors compl&eacute;mentaires qui fonctionnent en collecteur commun, T<SUB>7</SUB> pour les alternances positives, et T<SUB>8</SUB> pour les alternances n&eacute;gatives. Ces transistors sont polaris&eacute;s par les deux diodes D<SUB>1</SUB> et D<SUB>2</SUB> afin de limiter la distorsion de croisement.<P>Du point de vue petits signaux, cet &eacute;tage de sortie (et sa charge, qui est d&eacute;termin&eacute;e par l'utilisation que l'on fait de l'ampli, et donc, va varier) vient se mettre en parall&egrave;le sur la charge de collecteur de T<SUB>5</SUB>&nbsp;: le gain de l'&eacute;tage interm&eacute;diaire va ainsi d&eacute;pendre de la charge qu'on connectera en sortie de l'ampli. <P>Dans les amplis r&eacute;els, l'&eacute;tage de sortie est plus complexe, et comprend notamment des &eacute;tages de protection contre les courts-circuits, qui vont limiter le courant de sortie de l'ampli &agrave; des valeurs raisonnables.</UL><P>&nbsp;<LI><H4><A NAME=AO38>ALIMENTATION.</A></H4>Comme pour tout composant dit "actif", notre amplificateur ne va pas sortir du n&eacute;ant l'&eacute;nergie qu'il fournit &agrave; l'ext&eacute;rieur. Il va falloir l'alimenter afin de polariser tous les transistors qui le composent.<P>Sur le sch&eacute;ma de la <A HREF="#F28">figure 28</A>, on voit deux entr&eacute;es d'alimentation, V<SUB>al+</SUB> et V<SUB>al-</SUB>. On remarque que nulle part sur ce sch&eacute;ma, la masse n'est pr&eacute;sente&nbsp;! En pratique, les deux alimentations sont r&eacute;f&eacute;renc&eacute;es &agrave; la masse, et ce sont les tensions d'entr&eacute;e qui vont fixer tous les potentiels par rapport &agrave; la masse, du fait de la contre r&eacute;action (la tension de sortie est li&eacute;e aux tensions d'entr&eacute;e qui sont li&eacute;es &agrave; la masse).<P>Cette caract&eacute;ristique est int&eacute;ressante, et va nous permettre d'alimenter l'amplificateur op&eacute;rationnel de deux mani&egrave;res diff&eacute;rentes&nbsp;:<P><STRONG> - sym&eacute;trique</STRONG>&nbsp;: on alimente l'ampli par deux sources &eacute;gales et oppos&eacute;es. Tout l'ampli est ainsi polaris&eacute; sym&eacute;triquement par rapport &agrave; la masse. C'est le mode d'alimentation le plus courant. Il faut noter que les deux tensions peuvent &ecirc;tre in&eacute;gales&nbsp;: le fonctionnement de l'ampli ne sera pas affect&eacute;, mais la plage de sortie sera limit&eacute;e par l'alimentation la plus faible (signaux sym&eacute;triques par rapport &agrave; la masse).<P><STRONG> - unipolaire</STRONG>&nbsp;: V<SUB>al+</SUB> est reli&eacute; &agrave; une alimentation positive et V<SUB>al-</SUB> est reli&eacute; &agrave; la masse. Ce syst&egrave;me est pratique pour un fonctionnement sur piles ou batteries, mais il faudra alors polariser les signaux d'entr&eacute;e &agrave; une valeur convenable pour que l'ampli fonctionne correctement (il n'y a pas de miracles, c'est un syst&egrave;me &agrave; transistors qui n&eacute;cessite une polarisation&nbsp;!). Ce mode de fonctionnement interdit l'amplification de signaux continus.<P>Les tensions d'alimentation des amplificateurs op&eacute;rationnels courants peuvent varier dans une large gamme, typiquement de &#177;2.5V &agrave; &#177;5V mini jusqu'&agrave; &#177;18V &agrave; &#177;22V maxi.<P>Certains amplis sont sp&eacute;cialis&eacute;s dans les basses tensions (alimentation par pile) et d'autres dans des tensions plus &eacute;lev&eacute;es. Pour des applications particuli&egrave;res, on consultera l'abondante documentation fournie par les constructeurs.<P>Certains amplificateurs rapides n&eacute;cessitent un d&eacute;couplage soign&eacute; des alimentations&nbsp;: on mettra un condensateur de d&eacute;couplage (typiquement 10 &agrave; 100nF c&eacute;ramique) entre chaque borne d'alimentation et la masse, ceci aux plus pr&egrave;s des broches d'alimentation. Sans ces pr&eacute;cautions, on pourra avoir des montages pr&eacute;sentant des fonctionnements erratiques, voire des oscillations parasites aboutissant &agrave; la destruction de l'ampli (cas du LM318&nbsp;!).<P>Outre la plage de tensions d'alimentation, les amplificateurs sont caract&eacute;ris&eacute;s par leur <STRONG>courant de consommation</STRONG>&nbsp;: il faut alimenter tous les composants internes pour les polariser. Le courant de polarisation va &ecirc;tre plus ou moins important selon la conception de l'ampli, et le compromis recherch&eacute;&nbsp;: il existe des amplis &agrave; tr&egrave;s faible courant de consommation, destin&eacute;s principalement aux applications fonctionnant sur piles et batteries&nbsp;; en corollaire, leurs performances en fr&eacute;quence seront m&eacute;diocres (voir cours sur les transistors&nbsp;: plus la polarisation est faible, plus les imp&eacute;dances mises en jeu sont grandes, et plus les capacit&eacute;s parasites des transistors prennent de l'importance, d&eacute;gradant le comportement &agrave; haute fr&eacute;quence). A c&ocirc;t&eacute; de ces amplis, il en existe d'autres &agrave; courant de consommation &eacute;lev&eacute;, ayant des bonnes performances en haute fr&eacute;quence.<P>Certains amplificateurs, dits "programmables" ont une possibilit&eacute; de r&eacute;glage du courant de polarisation (et donc du compromis consommation/rapidit&eacute;), et peuvent ainsi s'adapter au besoin de l'utilisateur.<P>Exemples de courants de consommation&nbsp;:<P> - LM4250&nbsp;: r&eacute;glable de 1 &agrave; 250&#181;A<P> - LF441&nbsp;: 200&#181;A<P> - &#181;A741&nbsp;: 2mA<P> - LM318 : 5mA<P>Ces amplis sont donn&eacute;s du plus lent au plus rapide&nbsp;: produit gain-bande passante de 10 &agrave; 300kHz pour le LM4250, 1MHz pour le 741, et 15MHz pour le LM318.<P>&nbsp;<LI><H4><A NAME=AO39>CARACT&Eacute;RISTIQUES D'ENTR&Eacute;E.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO40>Imp&eacute;dances d'entr&eacute;e.</A></FONT></H5><A HREF="#AO04">On a vu</A> que l'amplificateur diff&eacute;rentiel pr&eacute;sentait deux imp&eacute;dances d'entr&eacute;e diff&eacute;rentes&nbsp;: l'imp&eacute;dance diff&eacute;rentielle, relative &agrave; la diff&eacute;rence de tension entre les deux entr&eacute;es, et l'imp&eacute;dance de mode commun. On va s'aider du sch&eacute;ma de la <A HREF="#F28">figure 28</A> pour interpr&eacute;ter ces deux imp&eacute;dances.<P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO41>Imp&eacute;dance diff&eacute;rentielle.</A></FONT></H5>Sur le sch&eacute;ma de la <A HREF="#F28">figure 28</A>, l'imp&eacute;dance diff&eacute;rentielle correspond &agrave; 2h<SUB>11</SUB> et d&eacute;pend directement du courant de polarisation choisi.<P>En pratique, cette valeur sera comprise entre quelque centaines de k<IMG SRC="../BASE/ICONES/OHM.GIF"> et quelques dizaines de M<IMG SRC="../BASE/ICONES/OHM.GIF"> pour les amplis &agrave; transistors d'entr&eacute;e bipolaires.<P>Les amplis &agrave; transistors d'entr&eacute;e JFET pr&eacute;senteront des imp&eacute;dances beaucoup plus &eacute;lev&eacute;es, couramment de l'ordre de 10<SUP>12</SUP><IMG SRC="../BASE/ICONES/OHM.GIF">.<P>Il existe aussi des amplis en technologie MOSFET qui ont des imp&eacute;dances sup&eacute;rieurs &agrave; 10<SUP>15</SUP><IMG SRC="../BASE/ICONES/OHM.GIF">&nbsp;: nous ne sommes vraiment pas loin de l'infini de l'AOP&nbsp;!<P>Il convient de noter que la tension d'entr&eacute;e diff&eacute;rentielle sera toujours voisine de z&eacute;ro (en fonctionnement lin&eacute;aire)&nbsp;: le courant diff&eacute;rentiel consomm&eacute; sera donc extr&ecirc;mement faible, m&ecirc;me si les r&eacute;sistances connect&eacute;es &agrave; l'ampli ont des valeurs voisines de l'imp&eacute;dance d'entr&eacute;e de celui-ci. On pourra donc dans la majorit&eacute; des cas n&eacute;gliger l'imp&eacute;dance d'entr&eacute;e dans les calculs.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO42>Imp&eacute;dance de mode commun.</A></FONT></H5>On peut voir cette imp&eacute;dance comme celle de deux montages collecteur commun en parall&egrave;le dont la charge commune d'&eacute;metteur est une source de courant de r&eacute;sistance dynamique tr&egrave;s &eacute;lev&eacute;e. Vue de l'entr&eacute;e, cette r&eacute;sistance est multipli&eacute;e par le gain des transistors&nbsp;: elle sera tr&egrave;s &eacute;lev&eacute;e dans tous les cas, et donc n&eacute;glig&eacute;e dans les calculs.</UL><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO43>Tension de d&eacute;calage d'entr&eacute;e (offset).</A></FONT></H5>C'est un des principaux d&eacute;fauts de l'amplificateur r&eacute;el, et pour des forts gains en tension et/ou des faibles tensions d'entr&eacute;e, on devra en tenir compte.<P>Cette tension est due au fait que les transistors d'entr&eacute;e ne sont pas rigoureusement identiques (T<SUB>1</SUB> et T<SUB>2</SUB> sur la <A HREF="#F28">figure 28</A>), et que pour obtenir une tension nulle en sortie, il faudra appliquer une tension diff&eacute;rentielle non nulle &agrave; l'entr&eacute;e, cette tension &eacute;tant l'&eacute;cart de V<SUB>be</SUB> de T<SUB>1</SUB> et T<SUB>2</SUB> &agrave; courant de collecteur donn&eacute;.<P>Quand on mod&eacute;lise un montage &agrave; amplificateur op&eacute;rationnel avec une erreur d'offset, on le repr&eacute;sente en g&eacute;n&eacute;ral par le sch&eacute;ma suivant&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP096.GIF"></CENTER><P><CENTER>Fig. 29. Erreur d'offset.</CENTER><BR>Cette repr&eacute;sentation n'est pas forc&eacute;ment judicieuse, car on peut obtenir des courants parasites d&ucirc;s &agrave; cette source dans les composants d'entr&eacute;e, alors qu'en fait, l'&eacute;cart de courant ne peut venir que de la sortie qui compense la tension de d&eacute;calage&nbsp;; en effet, on aura la relation&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP097.GIF"></CENTER><P>Avec une telle relation, quand l'ampli fonctionne en mode lin&eacute;aire, on n'a plus V<SUB>+</SUB> = V<SUB>-</SUB>, mais V<SUB>+</SUB> =  V<SUB>-</SUB>+V<SUB>d</SUB>. A noter que V<SUB>d</SUB> est une valeur alg&eacute;brique, et peut &ecirc;tre positive ou n&eacute;gative.<P>Pour les montages en commutation (comparateurs et triggers entre autres), le seuil de basculement sera lui aussi d&eacute;fini par la relation V<SUB>+</SUB> = V<SUB>-</SUB>+V<SUB>d</SUB>.<P>Ordres de grandeur&nbsp;: V<SUB>d</SUB> va valoir de quelques dizaines de &#181;V pour des amplis de mesure (OP27 : 25&#181;V) &agrave; une dizaine de mV pour des amplis &agrave; entr&eacute;e JFET standards (TL081 par exemple).<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO44>Courants de polarisation.</A></FONT></H5>Sur le sch&eacute;ma de la <A HREF="#F28">figure 28</A>, on remarque qu'il n'y a aucun circuit de polarisation des bases des transistors d'entr&eacute;e T<SUB>1</SUB> et T<SUB>2</SUB>. Par cons&eacute;quent, cette polarisation devra &ecirc;tre assur&eacute;e par les composants externes du montage &agrave; amplificateur.<P>Si on reprend l'exemple du montage amplificateur inverseur de la <A HREF="#F05">figure 5</A>, la polarisation des bases se fera directement par la masse pour l'entr&eacute;e +, et par la masse et la sortie de l'ampli via R<SUB>1</SUB> et R<SUB>2</SUB> pour l'entr&eacute;e -. Le courant de polarisation de la base de T<SUB>1</SUB> va donc circuler dans ces deux r&eacute;sistances, en y cr&eacute;ant au passage des chutes de tension parasites.<P><CENTER><IMG SRC="AOP.FIG/AOP098.GIF"></CENTER><P><CENTER>Fig. 30. Ce qu'il ne faut pas faire&nbsp;!!!</CENTER><BR>Une remarque importante qui d&eacute;coule de ceci est qu'il faut toujours laisser le passage du courant continu vers <STRONG>les deux</STRONG> entr&eacute;es de l'ampli&nbsp;; il est hors de question de couper ce chemin par un ou plusieurs condensateurs&nbsp;: le montage ne serait alors plus fonctionnel.<P>Dans l'exemple de la figure 30, on coupe le chemin de la polarisation de l'entr&eacute;e +&nbsp;; T<SUB>2</SUB> (cf <A HREF="#F28">figure 28</A>) ne peut pas &ecirc;tre polaris&eacute;, et l'ampli ne fonctionne plus.<P>Si on voulait vraiment mettre un condensateur en s&eacute;rie avec le signal d'entr&eacute;e pour bloquer sa composante continue, il faudrait rajouter une r&eacute;sistance entre l'entr&eacute;e + et la masse, de mani&egrave;re &agrave; laisser passer le courant de polarisation.<P>Ordre de grandeur des courants de polarisation&nbsp;:<P> - de 30&agrave; 500nA pour un &#181;A741, les fortes valeurs &eacute;tant obtenues &agrave; chaud.<P> - de 3 &agrave; 20nA pour un LM627 (ampli rapide de pr&eacute;cision)<P> - de 30pA &agrave; 50nA pour un LF356 (entr&eacute;es JFET)&nbsp;: le courant devient important &agrave; chaud&nbsp;!<P>Le courant de polarisation peut &ecirc;tre rentrant ou sortant, selon le type de transistors utilis&eacute;s en entr&eacute;e (NPN ou PNP).<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO45>Courants de d&eacute;calage.</A></FONT></H5>Le courant de d&eacute;calage est le pendant de la tension d'offset pour les courants de polarisation&nbsp;: comme les transistors d'entr&eacute;e sont dissym&eacute;triques, les courants de base seront aussi diff&eacute;rents. Le courant de d&eacute;calage est &eacute;gal &agrave;&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP099.GIF"></CENTER><P>Ce courant, en circulant dans les r&eacute;sistances connect&eacute;es &agrave; l'ampli va cr&eacute;er une chute de tension parasite qui va s'ajouter &agrave; la tension d'offset.<P>Les ordres de grandeurs de ces courants sont d'environ 1/20e &agrave; 1/5e de la valeur des courants de polarisation.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO46>Plages de tensions d'entr&eacute;e.</A></FONT></H5>On a d&eacute;j&agrave; largement abord&eacute; les probl&egrave;mes de polarisation des amplificateurs, et la <A HREF="#F28">figure 28</A> montre le principe des montages utilis&eacute;s.<P>Sur cette figure, on voit qu'il ne faudra pas d&eacute;passer certaines limites pour les tensions d'entr&eacute;e sous peine de d&eacute;grader le fonctionnement, voire de d&eacute;truire l'amplificateur.<P>En pratique, les constructeurs donnent des plages de tension &agrave; respecter&nbsp;:<P> - absolues pour chaque entr&eacute;e&nbsp;: elles d&eacute;passeront rarement les valeurs des tensions d'alimentation. Les entr&eacute;es sont souvent reli&eacute;es aux tensions d'alimentation par des diodes connect&eacute;es en inverse pour le fonctionnement normal, et qui deviennent passantes quand les tensions d'entr&eacute;e d&eacute;passent les valeurs des tensions d'alimentation&nbsp;; le courant est limit&eacute; par les r&eacute;sistances c&acirc;bl&eacute;es en s&eacute;rie avec les entr&eacute;es. Si on applique directement un signal trop &eacute;lev&eacute; sur une des entr&eacute;es (cas de l'ampli non inverseur), on d&eacute;truit le composant.<P> - diff&eacute;rentielles&nbsp;: ces valeurs peuvent &ecirc;tre faibles (&#177;0.7V, soit la valeur d'un V<SUB>be</SUB> , dans le cas ou on bride les deux entr&eacute;es avec deux diodes connect&eacute;es t&ecirc;te b&ecirc;che).<P> - de mode commun (souvent les tensions d'alimentation moins quelques volts). Au del&agrave; des limites de mode commun admises, la polarisation des &eacute;tages d'entr&eacute;e ne se fait plus correctement.<P>En bref, il ne faut pas faire n'importe quoi avec un amplificateur op&eacute;rationnel, et si on a des cas de fonctionnement limites, il faudra s'assurer qu'ils sont autoris&eacute;s par l'ampli choisi. Tout est ici affaire de compromis, et il existe une grande vari&eacute;t&eacute; d'amplis sur le march&eacute; autorisant certains modes de fonctionnement au d&eacute;triment d'autres&nbsp;: il faut choisir le bon composant en fonction du probl&egrave;me. Une seule chose est s&ucirc;re&nbsp;: on n'aura jamais tout en m&ecirc;me temps&nbsp;!</OL><P>&nbsp;<LI><H4><A NAME=AO47>CARACT&Eacute;RISTIQUE DE TRANSFERT.</A></H4>La caract&eacute;ristique de transfert est lin&eacute;aire&nbsp;: la sortie est proportionnelle &agrave; la diff&eacute;rence des tensions d'entr&eacute;e&nbsp;; il ne faut pas non plus oublier le terme de mode commun (voir &eacute;quation <A HREF="#EQ01">[1]</A>).<P>La tension de sortie est bien &eacute;videmment limit&eacute;e aux deux extr&eacute;mit&eacute;s de la plage de fonctionnement &agrave; V<SUB>sat+</SUB> et V<SUB>sat-</SUB>.<P>&nbsp;<LI><H4><A NAME=AO48>CARACT&Eacute;RISTIQUES DE SORTIE.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO49>Imp&eacute;dance de sortie.</A></FONT></H5>En pratique, l'imp&eacute;dance de sortie des amplificateurs r&eacute;els n'est pas nulle&nbsp;; elle reste n&eacute;anmoins faible, de l'ordre de la centaine d'ohms pour les amplis courants. Si cette valeur para&icirc;t encore assez &eacute;lev&eacute;e, il faut savoir que dans un syst&egrave;me boucl&eacute;, sa valeur sera divis&eacute;e par le gain de boucle du syst&egrave;me consid&eacute;r&eacute;. En pratique, l'imp&eacute;dance de sortie des montages sera donc couramment inf&eacute;rieure &agrave; l'ohm.<P>Attention toutefois &agrave; la valeur de l'imp&eacute;dance en boucle ouverte&nbsp;: si on charge l'amplificateur par un condensateur (par exemple un c&acirc;ble coaxial assez long, ce qui peut faire plusieurs centaines de pF), la r&eacute;sistance de sortie coupl&eacute;e &agrave; ce condensateur va former un p&ocirc;le suppl&eacute;mentaire qui peut rendre le <A HREF="#AO65">montage oscillatoire</A>.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO50>Vitesse de balayage (slew rate).</A></FONT></H5>En plus des probl&egrave;mes de r&eacute;ponse en fr&eacute;quence, la tension de sortie des amplificateurs ne peut pas varier instantan&eacute;ment d'une valeur &agrave; une autre (cas d'un &eacute;chelon de tension).<P><CENTER><IMG SRC="AOP.FIG/AOP100.GIF"></CENTER><P><CENTER>Fig. 31. Slew rate.</CENTER><BR>La cause profonde vient de la structure des amplis (voir <A HREF="#F28">figure 28</A>)&nbsp;: lors d'un transitoire violent, la capacit&eacute; collecteur-base du deuxi&egrave;me &eacute;tage doit se charger instantan&eacute;ment, ce qui n'est pas possible, car elle le sera par les sources de courant de polarisation. Comme ces courants sont tr&egrave;s faibles, la charge sera relativement lente, et on note qu'elle sera lin&eacute;aire (charge d'un condensateur &agrave; courant constant). On obtient le chronogramme donn&eacute; figure 31.<P>Cette mont&eacute;e lin&eacute;aire en r&eacute;ponse &agrave; un &eacute;chelon est appel&eacute;e vitesse de balayage (ou plus commun&eacute;ment slew rate)&nbsp;; elle est exprim&eacute;e en V/&#181;s.<P>L'ordre de grandeur du slew rate est de 0,5V/&#181;s pour le 741, 10 &agrave; 15V/&#181;s pour les amplis &agrave; FET du type TL081, LF356..., et peut monter &agrave; 50V/&#181;s (voire 150V/&#181;s avec une compensation particuli&egrave;re) pour le LM318.<P>En g&eacute;n&eacute;ral, les amplificateurs ne peuvent pas &ecirc;tre bons partout&nbsp;: les amplis tr&egrave;s pr&eacute;cis (OP7&nbsp;: fort gain en statique et tr&egrave;s faible offset) sont souvent mauvais du point de vue slew rate, et vice versa  un LM318 est bruyant et peu pr&eacute;cis).<P>Le slew rate va limiter les amplifications des forts signaux, et la bande passante sera plus faible que pour des petits signaux &agrave; fr&eacute;quence donn&eacute;e (la pente  en V/&#181;s  des signaux est proportionnelle &agrave; leur amplitude&nbsp;: plus l'amplitude sera forte, plus le slew rate sera limitatif.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO51>Tension de saturation.</A></FONT></H5>On en a d&eacute;j&agrave; parl&eacute; lors des montages fonctionnant en commutation&nbsp;: la tension de sortie est limit&eacute;e &agrave; V<SUB>sat+</SUB> et V<SUB>sat-</SUB>, qui sont respectivement les tensions de saturation haute et basse de l'ampli.<P>Ces tension d&eacute;pendent &eacute;videmment des tensions d'alimentation&nbsp;: elles sont inf&eacute;rieures aux tensions d'alimentation (en valeur absolue) d'environ 0.5 &agrave; 1.5V. Ces tensions de d&eacute;chet d&eacute;pendent de la temp&eacute;rature, de la charge de sortie de l'ampli (plus le courant de sortie est important, plus elles sont &eacute;lev&eacute;es), et de la structure de l'ampli&nbsp;: il existe des ampli &agrave; transistors MOSFET (LM660C de NS) sp&eacute;cialement con&ccedil;us pour avoir une dynamique de sortie maximale, soit des tensions de d&eacute;chet comprises entre 0.1 et 0.3V. On privil&eacute;giera ces amplis dans les application aliment&eacute;es en monotension de faible valeur (0-5V par exemple).<P>Les tensions de d&eacute;chet haute et basse sont souvent diff&eacute;rentes, ce qui fait qu'avec une alimentation rigoureusement sym&eacute;trique, on aura V<SUB>sat+</SUB> <IMG SRC="../BASE/ICONES/POM.GIF" align=bottom> |V<SUB>sat-</SUB>|.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO52>Sortance en courant.</A></FONT></H5>L'imp&eacute;dance de sortie est une chose, la sortance en courant en est une autre&nbsp;: ce n'est pas parce qu'un ampli a une imp&eacute;dance de sortie tr&egrave;s faible (quand il est boucl&eacute;) qu'il va pouvoir d&eacute;biter des amp&egrave;res&nbsp;!<P>En pratique, les amplificateurs op&eacute;rationnels sont des composants traitant des faibles signaux, pas de la puissance&nbsp;: les courants de sortie seront faibles, de quelques mA &agrave; quelques dizaines de mA pour les plus vaillants.<P>L'amplificateur op&eacute;rationnel a un &eacute;tage de sortie push pull capable de fournir ou d'absorber du courant&nbsp;: en g&eacute;n&eacute;ral, les courants maxi absorb&eacute;s (sink) et fournis (source) seront sensiblement diff&eacute;rents&nbsp;: on se reportera &agrave; la notice du constructeur pour plus de pr&eacute;cisions.<P>On veillera donc &agrave; ne pas trop charger les amplis en sortie (charge mini de quelques k<IMG SRC="../BASE/ICONES/OHM.GIF"> pour des signaux de quelques volts)&nbsp;: on n'oubliera pas que les r&eacute;seaux de contre-r&eacute;action se mettent en parall&egrave;le avec la charge de sortie&nbsp;! Par cons&eacute;quent, on &eacute;vitera de c&acirc;bler des imp&eacute;dances trop faibles (inf&eacute;rieures &agrave; une dizaine de k<IMG SRC="../BASE/ICONES/OHM.GIF">).<P>Certains amplis sont pr&eacute;vus pour d&eacute;biter des courants "importants" sur des charges faibles&nbsp;: aliment&eacute; en &#177;18V, le NE5534 peut d&eacute;biter &#177;26mA dans 600<IMG SRC="../BASE/ICONES/OHM.GIF"> (&#177;16V en sortie).<P>Il existe aussi des amplificateurs op&eacute;rationnels de puissance&nbsp;: la structure est la m&ecirc;me, mais ils poss&egrave;dent un &eacute;tage de puissance capable de d&eacute;livrer des centaines de mA voire des amp&egrave;res (ex&nbsp;: LM12 de NS, capable de d&eacute;biter &#177;10A). Ils sont principalement destin&eacute;s aux applications audio grand public (autoradios, mini cha&icirc;nes...).<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO53>Protections de sortie.</A></FONT></H5>On vient de voir que les amplificateurs op&eacute;rationnels ne supportent pas les forts courants&nbsp;; dans ces conditions, le moindre court-circuit pourrait leur &ecirc;tre fatal&nbsp;! Heureusement, les fabricants ont inclus des protections en sortie de leurs amplis qui limitent le courant de quelques mA &agrave; quelques dizaines de mA.<P>Les amplificateurs op&eacute;rationnels sont ainsi des composants assez robustes, ne n&eacute;cessitant pas trop de pr&eacute;cautions d'emploi (tout est relatif...)<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO54>Puissance dissip&eacute;e.</A></FONT></H5>Quand un ampli d&eacute;bite du courant, les transistors qui le constituent (notamment ceux du push-pull de sortie) dissipent une puissance non n&eacute;gligeable. Les amplis encapsul&eacute;s en bo&icirc;tiers traditionnels (DIL8 ou CMS) peuvent dissiper entre 250mW et 1W (&agrave; 25&#176;C). Les amplis de puissance pr&eacute;-cit&eacute;s sont encapsul&eacute;s en bo&icirc;tiers de puissance (bo&icirc;tiers isowatt, voire TO3 pour le LM12), et peuvent dissiper plusieurs watts, &agrave; condition bien s&ucirc;r de les munir du <A HREF="../PUISS/COURS.HTM#P18" target=_blank>radiateur ad&eacute;quat</A>&nbsp;!<P>Dans tous les cas, on veillera &agrave; ne pas d&eacute;passer les limites admises par les amplis. Certains sont prot&eacute;g&eacute;s thermiquement (limitation du courant de sortie au del&agrave; d'une certaine temp&eacute;rature), mais pas tous...</OL><P>&nbsp;<LI><H4><A NAME=AO55>IMPACT SUR LES MONTAGES DE BASE.</A></H4>Tous ces "d&eacute;fauts" font que dans la pratique, l'amplificateur op&eacute;rationnel r&eacute;el s'&eacute;loigne sensiblement de l'AOP. Nous allons faire un rapide tour d'horizon de l'impact de ces d&eacute;fauts sur les <A HREF="#AO09">montages de base vus plus haut</A>, ce qui nous permettra de mieux choisir le mod&egrave;le d'ampli appropri&eacute; &agrave; une application donn&eacute;e.<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO56>Tension de saturation.</A></FONT></H5>On a vu que les tensions de saturation V<SUB>sat+</SUB> et V<SUB>sat-</SUB> sont diff&eacute;rentes&nbsp;: ceci aura un impact sur tous les montages en commutation o&ugrave; les tensions de saturation rentrent en jeu dans les formules (trigger, multivibrateur...). De plus, ces tensions vont varier avec la charge de l'amplificateur, la temp&eacute;rature... Ces d&eacute;fauts sont en fait assez peu g&ecirc;nants.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO57>Imp&eacute;dances d'entr&eacute;e.</A></FONT></H5>L'imp&eacute;dance d'entr&eacute;e des amplificateurs r&eacute;els est dans tous les cas assez grande (>1M<IMG SRC="../BASE/ICONES/OHM.GIF">, rarement moins mis &agrave; part quelques amplis sp&eacute;ciaux). De plus, le fait que dans tous les montages lin&eacute;aires l'ampli soit boucl&eacute; est b&eacute;n&eacute;fique&nbsp;: l'imp&eacute;dance d'entr&eacute;e est multipli&eacute;e par le gain de boucle, ce qui donne facilement plusieurs dizaines ou centaines de M<IMG SRC="../BASE/ICONES/OHM.GIF">&nbsp;: on est quasiment dans les conditions de l'AOP.<P>On fera tout de m&ecirc;me attention aux montages int&eacute;grateurs, o&ugrave; des amplificateurs &agrave; trop faible imp&eacute;dance d'entr&eacute;e seront rejet&eacute;s, la contre r&eacute;action n'agissant pas &agrave; tr&egrave;s basse fr&eacute;quence. On pr&eacute;f&eacute;rera des amplis &agrave; entr&eacute;e JFET.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO58>Offset en tension.</A></FONT></H5>C'est une des grosses tares de l'amplificateur r&eacute;el. Si on doit amplifier des faibles tensions continues avec un fort gain, il faudra soit choisir un ampli &agrave; tr&egrave;s faible offset, soit compenser un ampli standard.<P>La plupart des amplificateurs poss&egrave;dent deux broches destin&eacute;es &agrave; r&eacute;gler l'offset. On se reportera &agrave; la notice du composant utilis&eacute;, les modes de branchement et les valeurs des r&eacute;sistances n&eacute;cessaires variant d'un ampli &agrave; l'autre. Souvent, il est fait appel &agrave; un potentiom&egrave;tre branch&eacute; entre les deux broches d'ajustage de l'ampli et une des alimentations.<P>Les amplis doubles en bo&icirc;tier 8 pattes (deux amplis dans le m&ecirc;me bo&icirc;tier) ne poss&egrave;dent pas de r&eacute;glage d'offset. On pourra faire un montage externe, tel que celui ci-dessous&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP101.GIF"></CENTER><P><CENTER>Fig. 32. Compensation d'offset d'un ampli inverseur.</CENTER><BR>En plus de la valeur de l'offset en tension, les constructeurs donnent la valeur de sa d&eacute;rive en temp&eacute;rature et dans le temps. Il est illusoire de compenser un ampli &agrave; fort offset pour faire des mesures pr&eacute;cises, car la variation sera importante et le r&eacute;glage devra &ecirc;tre revu souvent&nbsp;!<P>Pour faire des mesures de pr&eacute;cision, on optera pour un "bon" ampli d&egrave;s le d&eacute;part&nbsp;!<P>Pour les amplifications de tensions uniquement alternatives mais avec un fort gain (plusieurs centaines), on se m&eacute;fiera aussi de l'offset&nbsp;: un ampli ayant 10mV d'offset (les s&eacute;ries TL07x et TL08x de Texas ne sont pas merveilleuse de ce point de vue&nbsp;!) et utilis&eacute; avec un gain de 500 d&eacute;livrera une tension continue parasite de 5V en sortie&nbsp;! Cette tension abaissera d'autant la plage de sortie, et on fera une correction (m&ecirc;me sommaire) de l'offset pour r&eacute;soudre ce probl&egrave;me.<P>Le montage int&eacute;grateur sera lui aussi fortement affect&eacute; par l'offset&nbsp;: cette tension parasite en entr&eacute;e va &ecirc;tre int&eacute;gr&eacute;e et g&eacute;n&eacute;rer une rampe de tension en sortie&nbsp;: ce montage devra &ecirc;tre r&eacute;alis&eacute; de pr&eacute;f&eacute;rence avec un ampli &agrave; faible offset et/ou compens&eacute;.<P>Les montages &agrave; seuil (comparateurs, triggers), sont bien entendus aussi affect&eacute;s par l'offset, et on en tiendra compte pour des faibles signaux.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO59>Courants de polarisation.</A></FONT></H5>On a vu que les transistors de l'&eacute;tage diff&eacute;rentiel d'entr&eacute;e &eacute;taient polaris&eacute;s par l'ext&eacute;rieur&nbsp;; le courant de polarisation va donc circuler dans les composants externes &agrave; l'ampli. La chute de tension ainsi provoqu&eacute;e va s'ajouter &agrave; l'offset en tension.<P>Afin de minimiser les &eacute;carts entre les deux entr&eacute;es, on veillera &agrave; ce que celles-ci "voient" les m&ecirc;mes imp&eacute;dances.<P>Pour le montage amplificateur inverseur, une compensation fr&eacute;quente des effets des courants de polarisation est la suivante&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP102.GIF"></CENTER><P><CENTER>Fig. 33. Compensation des courants de polarisation.</CENTER><BR>Cet exemple montre un montage inverseur auquel on a rajout&eacute; une r&eacute;sistance entre l'entr&eacute;e + et la masse. Cette r&eacute;sistance est &eacute;gale &agrave; R<SUB>1</SUB>//R<SUB>2</SUB>, soit l'imp&eacute;dance vue par l'entr&eacute;e -. Les deux entr&eacute;es "voient" les m&ecirc;mes imp&eacute;dances, les effets des courants de polarisation vont donc se compenser.<P>Les amplis &agrave; entr&eacute;e JFET sont peu concern&eacute;s par ce type de compensation, du moins &agrave; faible temp&eacute;rature. En effet, on a vu que l'entr&eacute;e d'un JFET &eacute;tait &eacute;quivalente &agrave; une jonction diode en inverse. Le courant parasite doublant tous les 6&#176;C, il peut devenir important &agrave; haute temp&eacute;rature, sup&eacute;rieur &agrave; ce qu'on obtient avec de bons amplis &agrave; transistors bipolaires. Pour les fortes temp&eacute;rature d'utilisation, on pr&eacute;f&eacute;rera ces derniers. Pour des usages &agrave; temp&eacute;rature ambiante, on utilisera des amplis &agrave; entr&eacute;e JFET sans compensation.<P>Les courants de polarisation perturbent aussi beaucoup les montages int&eacute;grateurs&nbsp;: pour des int&eacute;grateurs &agrave; grande constante de temps, on utilisera imp&eacute;rativement des amplis &agrave; entr&eacute;e JFET, ou mieux MOSFET (LMC660 par exemple).<P>Les montages d&eacute;tecteurs de seuils et &eacute;chantillonneurs bloqueurs utiliseront aussi des amplis &agrave; tr&egrave;s faibles courants de polarisation, afin de ne pas d&eacute;charger le condensateur de mesure par des fuites parasites.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO60>Courants de d&eacute;calage</A></FONT></H5>Les courants de d&eacute;calage sont plus probl&eacute;matiques &agrave; compenser. Comme ils sont faibles, on se contentera d'utiliser des r&eacute;sistances de faible valeur pour que la chute de tension parasite soit n&eacute;gligeable.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO61>Plages de tensions.</A></FONT></H5>Dans tous les montages, on fera attention &agrave; ne pas d&eacute;passer les limites absolues pr&eacute;conis&eacute;es par le fabricant de l'amplificateur utilis&eacute;. Pour les montages &agrave; commutation, o&ugrave; on utilise l'amplificateur avec la condition V<SUB>+</SUB><IMG SRC="../BASE/ICONES/POM.GIF" align=bottom>V<SUB>-</SUB>, on veillera &agrave; choisir des amplis tol&eacute;rant une tension diff&eacute;rentielle suffisante (entr&eacute;es non brid&eacute;es par des diodes).<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO62>Slew rate.</A></FONT></H5>Si on doit amplifier des forts signaux &agrave; fr&eacute;quence &eacute;lev&eacute;e, on choisira des amplificateurs &agrave; slew rate suffisant. Dans la pratique, le &#181;A741 est trop juste (0.5V&#181;s) et sera d&eacute;laiss&eacute; au profit d'amplis &agrave; FET standards (TL081, LF356 et autres) pr&eacute;sentant des slew rates de plus de 10V/&#181;s.<P>On choisira &eacute;ventuellement des amplificateurs plus rapides pour les montages en commutation, o&ugrave; la sortie va devoir basculer rapidement de V<SUB>sat+</SUB> &agrave; V<SUB>sat-</SUB>. On l'a d&eacute;j&agrave; dit, dans ces applications, un comparateur diff&eacute;rentiel remplacera avantageusement un amplificateur op&eacute;rationnel.<P>Des applications telles que les &eacute;tages de sortie de convertisseurs num&eacute;rique/analogique, dont la sortie varie par bonds, utiliseront aussi des amplis &agrave; fort slew rate.</OL></OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME=AO63>R&Eacute;PONSE EN FR&Eacute;QUENCE D'UN AMPLIFICATEUR OP&Eacute;RATIONNEL. STABILIT&Eacute;.</A></H3>L'amplificateur r&eacute;el n'a pas un gain diff&eacute;rentiel infini&nbsp;; de plus, celui-ci varie avec la fr&eacute;quence. Comme l'amplificateur est utilis&eacute; en syst&egrave;me boucl&eacute;, sa r&eacute;ponse en fr&eacute;quence a un impact fondamental sur la stabilit&eacute; du montage, qui va aussi d&eacute;pendre de la valeur de la fonction de transfert de la boucle de retour B.<P>Nous allons donc &eacute;tudier maintenant la fonction de transfert harmonique typique d'un amplificateur op&eacute;rationnel, voir quelle est la condition de stabilit&eacute; d'un ampli boucl&eacute;, et &eacute;tudier l'impact de ces consid&eacute;rations sur quelques montages de base.<P>Cette section ne constitue que l'aper&ccedil;u d'un vaste probl&egrave;me qui sera approfondi en automatisme&nbsp;; n&eacute;anmoins, il &eacute;tait difficile de faire l'impasse sur une des plus grosses imperfections de l'amplificateur op&eacute;rationnel et ses cons&eacute;quences.<OL TYPE=A><P>&nbsp;<LI><H4><A NAME=AO64>STABILIT&Eacute; D'UN SYST&#200;ME BOUCL&Eacute;.</A></H4>Nous avons vu le principe de fonctionnement d'un <A HREF="#AO06">syst&egrave;me boucl&eacute; (voir figure 3)</A> et l'expression de sa fonction de transfert&nbsp;:<P><CENTER><A NAME="EQ70"><IMG SRC="AOP.FIG/AOP103.GIF"></A></CENTER><P>Dans le cas g&eacute;n&eacute;ral, la fonction A est complexe, et comme <IMG SRC="../BASE/ICONES/ALPHA.GIF" align=bottom> et B sont b&acirc;tis avec des composants qui peuvent &ecirc;tre r&eacute;actifs (condensateurs notamment), ces deux fonctions vont aussi &ecirc;tre complexes&nbsp;: on va pouvoir d&eacute;terminer le module du gain et le d&eacute;phasage entr&eacute;e/sortie en fonction de la fr&eacute;quence (c'est la <A HREF="ANNEXE/ANAOP07.HTM" target=_blank>repr&eacute;sentation de bode</A>&nbsp;: nous n'utiliserons que celle-ci, contrairement &agrave; l'automatisme dont les adeptes sont friands d'autres crit&egrave;res beaucoup plus complexes &agrave; appr&eacute;hender et moins intuitifs &agrave; comprendre&nbsp;!).<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO65>Ordre d'un syst&egrave;me</A></FONT></H5>L'ordre d'un syst&egrave;me est d&eacute;termin&eacute; par le nombre de p&ocirc;les de sa fonction de transfert (les valeurs de la fr&eacute;quence qui annulent le d&eacute;nominateur).<P>Ces p&ocirc;les peuvent &ecirc;tre r&eacute;els ou imaginaires, et ainsi, l'ordre du syst&egrave;me est donn&eacute; par le degr&eacute; du polyn&ocirc;me en f (ou <IMG SRC="../BASE/ICONES/PULS.GIF" align=bottom>, ce qui revient au m&ecirc;me) qui forme le d&eacute;nominateur de la fonction de transfert.<P>Le trac&eacute; asymptotique du gain dans le plan de <A HREF="ANNEXE/ANAOP07.HTM" target=_blank>bode</A> va &ecirc;tre fonction de l'ordre du syst&egrave;me (voir <A HREF="#F34">figure 34</A>)&nbsp;: un syst&egrave;me d'ordre 1 aura une pente de -20dB/d&eacute;cade au del&agrave; de la fr&eacute;quence de cassure d&eacute;termin&eacute;e par son p&ocirc;le, un syst&egrave;me d'ordre 2 une pente de -40dB/d&eacute;cade... Chaque p&ocirc;le suppl&eacute;mentaire augmente la pente de -20dB/d&eacute;cade.<P>Parall&egrave;lement au gain, la phase diminue de -90&#176; &agrave; chaque p&ocirc;le. Les <A HREF="#AO66">-180&#176; fatidiques</A> sont atteints asymptotiquement pour l'ordre 2.<P>La <A HREF="#F34">figure 34</A> illustre un syst&egrave;me &agrave; deux p&ocirc;les (10Hz et 10kHz), dont la fonction de transfert est la suivante&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP104.GIF"></CENTER><P>Sur ce graphique, on a fait un trac&eacute; asymptotique du gain, qui met bien en &eacute;vidence les p&ocirc;les (fr&eacute;quences de cassures) et les pentes de d&eacute;croissance du gain.&#176;<P>Jusqu'&agrave; 1kHz environ, la phase varie comme pour un syst&egrave;me du premier ordre (asymptote &agrave; -90&#176;), et ensuite, &agrave; cause du deuxi&egrave;me p&ocirc;le, elle tombe &agrave; -180&#176; (valeur asymptotique qui ne sera th&eacute;oriquement jamais atteinte).<P><CENTER><A NAME="F34"><IMG SRC="AOP.FIG/AOP105.GIF"></A></CENTER><P><CENTER>Fig. 34. Syst&egrave;me &agrave; deux p&ocirc;les.</CENTER><BR>Un syst&egrave;me du premier ordre sera toujours stable (phase mini de -90&#176;), et les ennuis vont commencer d&egrave;s le deuxi&egrave;me ordre (d&eacute;passements, oscillations amorties...). Il faut un troisi&egrave;me p&ocirc;le pour arriver aux conditions d'oscillations, mais dans les amplificateurs op&eacute;rationnels, on trouve toujours ce p&ocirc;le suppl&eacute;mentaire, soit en interne, soit dans les composants externes (c&acirc;bl&eacute;s volontairement ou parasites).<P>Ce troisi&egrave;me p&ocirc;le, m&ecirc;me plac&eacute; assez loin du deuxi&egrave;me, abaissera suffisamment la phase pour que les conditions d'oscillation soient r&eacute;unies.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO66>Condition de Barkhausen.</A></FONT></H5>Si on regarde l'expression <A HREF="#EQ70">[70]</A>, on voit que le produit AB peut &ecirc;tre n&eacute;gatif, et notamment prendre la valeur -1 (le module du gain vaut 1 et le d&eacute;phasage est de -180&#176;).<P>Dans ce cas particulier, le d&eacute;nominateur s'annule&nbsp;: il n'y a plus besoin de signal en entr&eacute;e pour qu'il existe un signal en sortie. Nous avons r&eacute;alis&eacute; un oscillateur&nbsp;; un exemple sera <A HREF="#AO83">d&eacute;crit plus loin</A>.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO67>R&eacute;ponse en transitoires.</A></FONT></H5>Si dans certains cas, le fonctionnement en oscillateur du syst&egrave;me boucl&eacute; est voulu, il sera ind&eacute;sirable la plupart du temps.<P>Un syst&egrave;me ne passera pas <CITE>ex-abrupto</CITE> de l'&eacute;tat stable aux conditions d'oscillation de Barkhausen. Le ph&eacute;nom&egrave;ne sera progressif, et, sur des transitoires marqu&eacute;s (ex&nbsp;: &eacute;chelon de tension), le signal de sortie pr&eacute;sentera un d&eacute;passement (overshoot) de plus en plus important, accompagn&eacute; d'oscillations de moins en moins amorties au fur et &agrave; mesure que l'on va se rapprocher de la condition de Barkhausen.<P>Ces d&eacute;passements et oscillations vont beaucoup perturber le fonctionnement de l'amplificateur, et modifier de fa&ccedil;on substantielle le signal &agrave; amplifier&nbsp;: m&ecirc;me si le syst&egrave;me n'est pas un oscillateur, il n'en est pas moins inutilisable.<P>La figure 35 illustre ce propos&nbsp;: elle repr&eacute;sente la r&eacute;ponse indicielle (r&eacute;ponse &agrave; un &eacute;chelon unit&eacute; de tension) de trois syst&egrave;mes boucl&eacute;s dont les <A HREF="#AO69">marges de phase</A> sont respectivement de 18, 39 et 51&#176; (par rapport aux 180&#176; de l'oscillateur). Plus la marge de phase diminue, plus les oscillations et les d&eacute;passements sont forts (60% de d&eacute;passement pour une marge de 18&#176;).<P><CENTER><IMG SRC="AOP.FIG/AOP106.GIF"></CENTER><P><CENTER>Fig. 35. R&eacute;ponse indicielle de syst&egrave;mes boucl&eacute;s.</CENTER><BR>On y voit aussi que m&ecirc;me pour une marge correcte du point de vue crit&egrave;re de stabilit&eacute; (soit >45&#176;), on a un l&eacute;ger d&eacute;passement (mais tr&egrave;s peu d'oscillations).<P>Le processus d'instabilit&eacute; est donc progressif, et augmente au fur et &agrave; mesure qu'on se rapproche de la limite d'oscillation.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO68>Crit&egrave;res de stabilit&eacute;.</A></FONT></H5>En pratique, on a vu que l'&eacute;tude de la stabilit&eacute; va se r&eacute;sumer (dans notre cas&nbsp;: ne g&eacute;n&eacute;ralisons pas &agrave; tous les syst&egrave;mes&nbsp;!) &agrave; l'analyse du produit AB (le gain de boucle). Deux m&eacute;thodes simples vont consister &agrave; regarder la phase ou la pente de la courbe de gain pour un module du gain &eacute;gal &agrave; 1.<P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO69>Marge de phase.</A></FONT></H5>Le crit&egrave;re g&eacute;n&eacute;ralement retenu par les automaticiens pour que le syst&egrave;me soit d&eacute;clar&eacute; stable est que <STRONG>la phase ne doit pas &ecirc;tre inf&eacute;rieure &agrave; -135&#176; pour un module |AB|=1</STRONG>. Il reste une marge de 45&#176; pour atteindre les 180&#176; fatidiques (oscillateur). On dit que <STRONG>la marge de phase est de 45&#176;</STRONG>.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO70>Pente de la courbe de gain.</A></FONT></H5>Un crit&egrave;re tr&egrave;s simple de stabilit&eacute; sera le suivant&nbsp;: le diagramme asymptotique du produit <STRONG>AB devra croiser l'axe 0dB avec une pente maximum de -20dB/d&eacute;cade</STRONG>. Toute pente sup&eacute;rieure d&eacute;notera un syst&egrave;me instable.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO71>Choix du crit&egrave;re de stabilit&eacute;.</A></FONT></H5>Il convient de noter ici que le crit&egrave;re de la pente est tr&egrave;s facile &agrave; mettre en &#156;uvre, car le seul trac&eacute; asymptotique est n&eacute;cessaire, et que ce trac&eacute; n&eacute;cessite peu de calculs (uniquement les fr&eacute;quences de cassure des divers p&ocirc;les et z&eacute;ros de la fonction de transfert).<P>Dans le cas de compensation de plusieurs p&ocirc;les par plusieurs r&eacute;seaux de compensation, il se peut que ce crit&egrave;re soit insuffisamment pr&eacute;cis&nbsp;: on l'utilisera pour "d&eacute;grossir" le probl&egrave;me et mettre en place les r&eacute;seaux de compensation ad&eacute;quats, et on optimisera ces r&eacute;seaux en appliquant le crit&egrave;re de marge de phase, plus pr&eacute;cis.<P>Pour un syst&egrave;me compliqu&eacute;, le trac&eacute; pr&eacute;cis de la phase n&eacute;cessite un calcul complet, qui peut vite se r&eacute;v&eacute;ler laborieux &agrave; la main&nbsp;: un logiciel de trac&eacute; de courbes travaillant en complexes est quasiment n&eacute;cessaire.</UL></OL><P>&nbsp;<LI><H4><A NAME=AO72>FONCTION DE TRANSFERT DES AMPLIFICATEURS OP&Eacute;RATIONNELS.</A></H4>Il existe deux principaux types d'amplificateurs sur le march&eacute;&nbsp;:<P> - les amplificateurs inconditionnellement stables&nbsp;: le montage amplificateur est stable quel que soit le gain en boucle ferm&eacute;e obtenu (jusqu'au gain unit&eacute;). Pour un gain sup&eacute;rieur &agrave; 0dB, ces amplificateurs pr&eacute;sentent une r&eacute;ponse en fr&eacute;quence du type premier ordre (pente de -20dB/d&eacute;cade), d'o&ugrave; leur stabilit&eacute; inconditionnelle.<P> - certains amplificateurs &agrave; hautes performances pr&eacute;sentent un deuxi&egrave;me p&ocirc;le dans leur fonction de transfert pour des gains sup&eacute;rieurs &agrave; l'unit&eacute;. De ce fait, en amplification pure (le r&eacute;seau de retour est constitu&eacute; de r&eacute;sistances, d'o&ugrave; B est r&eacute;el), le syst&egrave;me boucl&eacute; sera stable uniquement pour un gain sup&eacute;rieur &agrave; une certaine valeur (typiquement 5). Leur domaine d'utilisation est donc diff&eacute;rent&nbsp;: ils poss&egrave;dent de meilleures performances en fr&eacute;quence que les premiers au prix d'une interdiction de leur emploi (sans pr&eacute;cautions particuli&egrave;res) dans certaine fonctions.<P>Pratiquement, les fonctions de transfert des amplificateurs sont similaires &agrave; celles repr&eacute;sent&eacute;es en <A HREF="ANNEXE/ANAOP03.GIF" target=_blank>annexe 3</A> pour les amplis inconditionnellement stables et <A HREF="ANNEXE/ANAOP04.GIF" target=_blank>annexe 4</A> pour les amplis dits "d&eacute;compens&eacute;s".<P>On remarque que le gain en statique (pour une fr&eacute;quence nulle, soit le continu) est tr&egrave;s &eacute;lev&eacute;, mais, le premier p&ocirc;le r&eacute;duit ce gain &agrave; partir d'une fr&eacute;quence tr&egrave;s basse (de quelques hertz &agrave; quelques dizaines d'hertz).<P>Le deuxi&egrave;me p&ocirc;le est situ&eacute; beaucoup plus loin&nbsp;: vers 1Mhz pour le &#181;A741, 4Mhz pour les TL081, LF356...<P>En fait, dans les amplis inconditionnellement stables, on place volontairement le premier p&ocirc;le tr&egrave;s bas en fr&eacute;quence (c'est le r&ocirc;le du condensateur C du sch&eacute;ma de la <A HREF="#F28">figure 28</A>), de mani&egrave;re &agrave; ce que le gain ait chut&eacute; suffisamment pour couper l'axe 0dB avant la deuxi&egrave;me fr&eacute;quence de cassure.<P>De cette mani&egrave;re, pour des gains en boucle ferm&eacute;e jusqu'&agrave; 0dB, le syst&egrave;me est du premier ordre, et ne sera donc jamais oscillatoire.<P>On agit sur le premier p&ocirc;le, car il est plus difficile technologiquement de reculer le deuxi&egrave;me (et le troisi&egrave;me qui n'est pas loin&nbsp;!)&nbsp;: c'est le cas des amplificateurs rapides, et ils sont chers et d&eacute;licats &agrave; utiliser...<P>Pour am&eacute;liorer le gain aux fr&eacute;quences &eacute;lev&eacute;es, on diminue la valeur de la capacit&eacute; int&eacute;gr&eacute;e C&nbsp;: on d&eacute;place le premier p&ocirc;le d'un facteur 5 sur l'axe fr&eacute;quentiel, et on atteint alors le deuxi&egrave;me p&ocirc;le pour un gain de l'ordre de 5 avec les amplis courants (LF357, qui est un LF356 d&eacute;compens&eacute;, LM149, qui est un LM148 d&eacute;compens&eacute;, OPA637, qui est un OPA627 d&eacute;compens&eacute;...).<P>L'amplificateur n'est plus inconditionnellement stable, et ne pourra pas servir dans des applications telles que les suiveurs, d&eacute;rivateurs, filtres d'ordre 2, montages logarithmiques, redresseurs sans seuils... En revanche, il fera merveille pour des amplis &agrave; fort gain&nbsp;: la bande passante sera 5 fois plus &eacute;lev&eacute;e qu'avec l'ampli &eacute;quivalent inconditionnellement stable.<P>&nbsp;<LI><H4><A NAME=AO73>AMPLIFICATEUR BOUCL&Eacute;. PRODUIT GAIN-BANDE.</A></H4>Lorsqu'on boucle un ampli non inverseur avec un r&eacute;seau de r&eacute;sistances, tant que le gain de boucle AB est &eacute;lev&eacute; (soit &agrave; basse fr&eacute;quence), le gain du syst&egrave;me boucl&eacute; va tendre vers 1/B (voir <A HREF="#EQ04">[4]</A>&nbsp;; <IMG SRC="../BASE/ICONES/ALPHA.GIF" align=bottom> est &eacute;gal &agrave; 1 dans ce cas)&nbsp;; &agrave; haute fr&eacute;quence, le gain de boucle va diminuer, pour devenir &eacute;gal, puis inf&eacute;rieur &agrave; la valeur 1/B. Dans ces conditions, la courbe de r&eacute;ponse en fr&eacute;quence du syst&egrave;me boucl&eacute; va tendre asymptotiquement vers celle de l'amplificateur.<P><CENTER><IMG SRC="AOP.FIG/AOP107.GIF"></CENTER><P><CENTER>Fig. 36 Amplificateur boucl&eacute;.</CENTER><BR>La figure 36 donne le r&eacute;sultat obtenu avec un ampli du type &#181;A741 (premi&egrave;re cassure &agrave; 10Hz, deuxi&egrave;me &agrave; 1MHz, gain statique de 100dB).<P>Si on observe cette figure, on remarque que le produit du gain par la bande passante &agrave; -3dB est constant, et &eacute;gal ici &agrave; 1MHz, soit la fr&eacute;quence pour laquelle le gain en boucle ouverte vaut 1 (0dB).<P>Ce produit est une caract&eacute;ristique importante de l'amplificateur pour caract&eacute;riser ses performances en fr&eacute;quence.<P>Ex&nbsp;: 1MHz pour le &#181;A741, 3MHz pour le TL081, 15MHz pour le LM318...<P>On note que cette caract&eacute;ristique est juste pour les amplis inconditionnellement stables. Pour les amplis d&eacute;compens&eacute;s, la fr&eacute;quence th&eacute;orique &agrave; gain unit&eacute; est obtenue en prolongeant la droite &agrave; -20dB/d&eacute;cade situ&eacute;e entre la premi&egrave;re et la deuxi&egrave;me cassure jusqu'&agrave; l'axe 0dB.<P>&nbsp;<LI><H4><A NAME=AO74>COMPENSATION EN FR&Eacute;QUENCE.</A></H4>Tout le travail de compensation en fr&eacute;quence de l'amplificateur consistera &agrave; installer des r&eacute;seaux de correction de telle mani&egrave;re que la condition de coupure &agrave; -20dB/d&eacute;cade soit r&eacute;alis&eacute;e. Cette m&eacute;thode sera pr&eacute;f&eacute;r&eacute;e aux autres, car elle est tr&egrave;s simple &agrave; mettre en &#156;uvre, et l'effet des r&eacute;seaux correcteurs sur le trac&eacute; de <A HREF="ANNEXE/ANAOP07.HTM" target=_blank>bode</A> est bien visible.<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO75>Compensation par d&eacute;placement de la premi&egrave;re fr&eacute;quence de cassure.</A></FONT></H5>Cette m&eacute;thode est extr&ecirc;mement simple&nbsp;; elle est un prolongement de l'astuce technique qui consiste &agrave; placer le condensateur C (voir le sch&eacute;ma de la <A HREF="#F28">figure 28</A>) entre collecteur et base du transistor du deuxi&egrave;me &eacute;tage de l'ampli. La figure 37 montre le diagramme de <A HREF="ANNEXE/ANAOP07.HTM" target=_blank>bode</A> asymptotique permettant de comprendre la compensation qui consiste &agrave; rajouter une capacit&eacute; suppl&eacute;mentaire en parall&egrave;le avec la capacit&eacute; C de la <A HREF="#F28">figure 28</A>. (deux broches sont disponibles sur les bo&icirc;tiers des amplis pr&eacute;voyant cette compensation). De ce fait, la premi&egrave;re fr&eacute;quence de cassure recule vers les basses fr&eacute;quences.<P>Ces compensations &eacute;taient n&eacute;cessaires avec des amplis anciens (LM101 par exemple) qui &eacute;taient b&acirc;tis pour garantir de bonnes performances &agrave; haute fr&eacute;quence, mais n&eacute;cessitaient une compensation pour les applications &agrave; faible gain.<P><CENTER><IMG SRC="AOP.FIG/AOP108.GIF"></CENTER><P><CENTER>Fig. 37. Compensation d'un ampli &agrave; gain unit&eacute;.</CENTER><BR>L'astuce est tr&egrave;s simple, et consiste &agrave; reculer toute la partie haute du diagramme de <A HREF="ANNEXE/ANAOP07.HTM" target=_blank>bode</A> pour que le produit AB coupe l'axe 0dB dans la zone &agrave; -20dB/d&eacute;cade (ici, on coupe juste &agrave; la limite du deuxi&egrave;me p&ocirc;le, la marge de phase est de 45&#176;).<P>Sur le sch&eacute;ma, on a repr&eacute;sent&eacute; la compensation d'un montage suiveur&nbsp;: B vaut 1, et le produit AB se confond avec A, gain en boucle ouverte de l'ampli&nbsp;: n'oublions pas que le crit&egrave;re de stabilit&eacute; s'applique au produit AB&nbsp;!<P>On note l'overshoot de 10dB pour le montage suiveur non compens&eacute;, garant de fortes oscillations sur les transitoires. Le suiveur compens&eacute; a une courbe quasi-plate, mais en revanche, a une bande passante plus faible.<P>Ce montage pr&eacute;sente deux gros inconv&eacute;nients&nbsp;:<P> - le gain de boucle est r&eacute;duit d&egrave;s les plus basses fr&eacute;quences, ce qui  nuit &agrave; la pr&eacute;cision.<P> - le slew rate est affect&eacute;&nbsp;: la capacit&eacute; de compensation vient se mettre en parall&egrave;le sur C&nbsp;; l'ensemble, de capacit&eacute; sup&eacute;rieure &agrave; C, va se charger avec le m&ecirc;me courant, donc plus lentement.<P>Avec l'apparition d'amplis rapides inconditionnellement stables, ce type de compensation est devenu peu utilis&eacute;.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO76>Compensation par retard de phase.</A></FONT></H5>On a imagin&eacute; une autre m&eacute;thode de compensation &eacute;liminant les d&eacute;fauts de la m&eacute;thode pr&eacute;c&eacute;dente&nbsp;: on ne va pas reculer la premi&egrave;re fr&eacute;quence de cassure, mais on va d&eacute;former la courbe de r&eacute;ponse en fr&eacute;quence plus loin, par adjonction d'un r&eacute;seau &agrave; retard de phase dans la cha&icirc;ne directe de l'asservissement (en cascade avec A).<P>Le but est de faire chuter le gain rapidement (avec une pente de -40dB/d&eacute;cade), pour reprendre ensuite une pente de -20dB/d&eacute;cade un peu avant que le produit AB ne croise l'axe 0dB&nbsp;: m&ecirc;me si la pente a &eacute;t&eacute; de -40dB/d&eacute;cade auparavant, le montage est stable quand m&ecirc;me, car le point important est que l'axe 0dB soit crois&eacute; avec une pente de -20dB/d&eacute;cade.<P><STRONG>Attention&nbsp;:</STRONG> si on veut augmenter le gain en boucle ferm&eacute;e du montage (par exemple, montage &agrave; gain r&eacute;glable), il faut garder &agrave; l'esprit qu'on va abaisser la valeur globale du produit AB, et qu'on va se retrouver &agrave; un moment donn&eacute; avec un croisement de l'axe 0dB avec une pente de -40dB/d&eacute;cade&nbsp;: le montage ne sera pas stable dans toute une plage de gain&nbsp;!<P>C'est le prix &agrave; payer d'une am&eacute;lioration du gain aux basses fr&eacute;quences, la compensation par recul de la premi&egrave;re fr&eacute;quence de cassure n'avait pas ce d&eacute;faut...<P><CENTER><IMG SRC="AOP.FIG/AOP109.GIF"></CENTER><P><CENTER>Fig. 38 Compensation par retard de phase.</CENTER><BR>Comment r&eacute;aliser le r&eacute;seau &agrave; retard de phase susceptible de modifier le gain de la cha&icirc;ne directe&nbsp;? Il faut tirer parti des &eacute;l&eacute;ments existants du montage, y compris des &eacute;l&eacute;ments parasites. Dans les amplificateurs de puissance (HIFI et autres, dont on a dit que la structure est la m&ecirc;me que celle des amplificateurs op&eacute;rationnels), on utilise l'imp&eacute;dance de sortie en boucle ouverte pour cr&eacute;er le r&eacute;seau suivant&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP110.GIF"></CENTER><P><CENTER>Fig. 39 R&eacute;seau &agrave; retard de phase.</CENTER><BR>Sa r&eacute;ponse en fr&eacute;quence est la suivante (repr&eacute;sentation du gain r&eacute;el et du gain asymptotique du r&eacute;seau utilis&eacute; dans la compensation illustr&eacute;e figure 38)&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP111.GIF"></CENTER><P><CENTER>Fig. 40. R&eacute;ponse en fr&eacute;quence du r&eacute;seau &agrave; retard de phase.</CENTER><BR>La fonction de transfert de ce r&eacute;seau est de la forme&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP112.GIF"></CENTER><P>avec&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP113.GIF"></CENTER><P><CENTER><IMG SRC="AOP.FIG/AOP114.GIF"></CENTER><P>Dans le r&eacute;seau de la figure 39, la r&eacute;sistance R<SUB>1</SUB> est en fait souvent l'imp&eacute;dance de sortie d'un &eacute;tage amplificateur qu'on cherche &agrave; compenser. On trouve ainsi tr&egrave;s souvent un r&eacute;seau R-C s&eacute;rie en sortie des amplificateurs HIFI&nbsp;: ce r&eacute;seau est destin&eacute; &agrave; les stabiliser avec une compensation par retard de phase. Ce proc&eacute;d&eacute; n'est pas utilis&eacute; tel quel sur les amplificateurs op&eacute;rationnels&nbsp;: le r&eacute;seau R-C chargerait trop la sortie de l'amplificateur.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO77>Compensation par avance de phase.</A></FONT></H5>La compensation par retard de phase n'est pas tr&egrave;s simple &agrave; mettre en &#156;uvre dans les montages &agrave; amplificateurs op&eacute;rationnels. On lui pr&eacute;f&eacute;rera souvent la compensation par avance de phase, qui poss&egrave;de les avantages suivants&nbsp;:<P> - simple &agrave; mettre en &#156;uvre (un condensateur suppl&eacute;mentaire suffit souvent).<P> - bande passante &eacute;largie par rapport aux autres modes de compensation.<P> - slew rate non alt&eacute;r&eacute;.<P>Le d&eacute;faut est que cette compensation n'est possible simplement  qu'avec des gains sup&eacute;rieurs &agrave; 2 ou 3 (montage suiveur incompensable par cette m&eacute;thode).<P>Jusqu'&agrave; maintenant, on n'a pas touch&eacute; la deuxi&egrave;me fr&eacute;quence de cassure du produit AB (qui est celle de A en amplification pure). C'est ce qu'on va faire ici.<P>Il existe deux m&eacute;thodes&nbsp;:<P> - reculer la deuxi&egrave;me fr&eacute;quence de cassure de l'ampli (compensation feed-forward)&nbsp;: cette m&eacute;thode est assez d&eacute;licate &agrave; mettre en &#156;uvre, et ne fonctionne pas pour tous les montages.<P> - augmenter la valeur de B &agrave; haute fr&eacute;quence&nbsp;: il suffit de jouer sur le r&eacute;seau de contre r&eacute;action, ce qui est beaucoup plus simple (mais n&eacute;cessite un gain du syst&egrave;me boucl&eacute; sup&eacute;rieur &agrave; 2 ou 3).<P>La figure 41 montre la compensation par un tel r&eacute;seau d'un ampli ayant un gain en boucle ferm&eacute;e de 10dB. On remarque qu'aux basses fr&eacute;quences, B vaut -10dB (B est un att&eacute;nuateur&nbsp;!), et qu'&agrave; partir d'une fr&eacute;quence un peu sup&eacute;rieure &agrave; la deuxi&egrave;me fr&eacute;quence de cassure de l'ampli, sa valeur remonte, pour tangenter ensuite l'axe 0dB (la figure montre le diagramme asymptotique de B).<P>Gr&acirc;ce &agrave; ce r&eacute;seau, la courbe du produit AB peut s'&eacute;tendre vers les fr&eacute;quences &eacute;lev&eacute;es, jusqu'&agrave; tangenter la courbe A de l'ampli en boucle ouverte, qui constitue une limite&nbsp;; cette remarque explique pourquoi on ne peut pas compenser avec cette m&eacute;thode un ampli de gain unit&eacute;, le produit AB &eacute;tant confondu dans ce cas avec A.<P><CENTER><IMG SRC="AOP.FIG/AOP115.GIF"></CENTER><P><CENTER>Fig. 41. Compensation par avance de phase.</CENTER><BR>Le r&eacute;seau &agrave; avance de phase peut &ecirc;tre construit de la mani&egrave;re suivante&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP116.GIF"></CENTER><P><CENTER>Fig. 42. R&eacute;seau &agrave; avance de phase.</CENTER><BR>La fonction de transfert de ce r&eacute;seau est du type&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP117.GIF"></CENTER><P>avec&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP118.GIF"></CENTER><P><CENTER><IMG SRC="AOP.FIG/AOP119.GIF"></CENTER><P>Le fonctionnement de ce r&eacute;seau est simple&nbsp;: aux hautes fr&eacute;quences, C vient shunter R<SUB>1</SUB>, et V<SUB>s</SUB> tend vers la valeur de V<SUB>e</SUB>&nbsp;: le <A HREF="../OUTILS/COURS.HTM#O48" target=_blank>pont diviseur</A> passe de la valeur R<SUB>2</SUB>/(R<SUB>1</SUB>+R<SUB>2</SUB>) &agrave; 1.<P>Sur un montage du type amplificateur non inverseur, ce r&eacute;seau est extr&ecirc;mement simple &agrave; mettre en &#156;uvre&nbsp;: on se contentera de rajouter un condensateur C en parall&egrave;le avec la r&eacute;sistance R<SUB>1</SUB>&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP120.GIF"></CENTER><P><CENTER>Fig. 43. Ampli non inverseur compens&eacute;.</CENTER><BR>L'avantage de ce montage, c'est qu'on peut le compenser tr&egrave;s simplement sans aucun calcul, en exp&eacute;rimentant des valeurs de C directement sur le montage attaqu&eacute; par un signal carr&eacute; en entr&eacute;e&nbsp;: la bonne valeur du condensateur est celle qui r&eacute;duit l'overshoot et les oscillations parasites &agrave; une valeur convenable.<P>C'est ce que faisaient beaucoup de "bidouilleurs" &agrave; la belle &eacute;poque de l'&eacute;lectronique analogique, sans conna&icirc;tre en d&eacute;tails la justification th&eacute;orique de leur exp&eacute;rimentation.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO78>Bilan des compensations.</A></FONT></H5>On a vu trois m&eacute;thodes de compensation&nbsp;:<P><STRONG> - la compensation par d&eacute;placement du premier p&ocirc;le</STRONG> est simple &agrave; mettre en &#156;uvre, universelle, et donne un amplificateur inconditionnellement stable une fois compens&eacute;. Les d&eacute;fauts sont une bande passante r&eacute;tr&eacute;cie, donc un gain de boucle diminu&eacute; d&egrave;s les plus basses fr&eacute;quences, et un slew rate ralenti.<P><STRONG> - la compensation par retard de phase</STRONG> dans la cha&icirc;ne directe est moins simple &agrave; appliquer sur des montages &agrave; amplificateurs op&eacute;rationnels, mais tr&egrave;s utilis&eacute;e sur des amplificateurs de puissance. L'amplificateur r&eacute;sultant n'est pas inconditionnellement stable, et cette compensation n&eacute;cessite des calculs et trac&eacute;s de <A HREF="ANNEXE/ANAOP07.HTM" target=_blank>bode</A> pour &ecirc;tre efficace. Elle doit &ecirc;tre adapt&eacute;e au cas par cas. Il existe divers montages de compensation&nbsp;; certains n'ont pas d'effet sur le slew rate (cas d&eacute;crit ci-dessus), d'autres le diminuent.<P><STRONG> - la compensation par avance de phase</STRONG> dans la boucle de retour est simple &agrave; utiliser, et son c&ocirc;t&eacute; intuitif lui permet de trouver la bonne compensation rapidement par exp&eacute;rimentation. Le slew rate n'est pas affect&eacute;, la bande passante est meilleure qu'avec les autres m&eacute;thodes, mais, elle est inapplicable pour un gain unit&eacute;.</OL><P>&nbsp;<LI><H4><A NAME=AO79>&Eacute;TUDE DE STABILIT&Eacute; DE MONTAGES SIMPLES.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO80>Amplificateur rapide.</A></FONT></H5>Il peut para&icirc;tre stupide d'utiliser un amplificateur rapide &agrave; faible co&ucirc;t (ampli d&eacute;compens&eacute; type LF357) pour l'utiliser avec des faibles gains. En fait, il ne faut pas oublier que le slew rate de ce type d'ampli est beaucoup plus &eacute;lev&eacute; que celui du m&ecirc;me ampli inconditionnellement stable (12V/&#181;s pour le LF356, 50V/&#181;s pour le LF357...).<P>Il peut donc valoir la peine d'utiliser un ampli rapide et de le compenser, par exemple par r&eacute;seau &agrave; avance de phase dans la boucle de retour. L'<A HREF="ANNEXE/ANAOP05.HTM" target=_blank>annexe 5</A> montre un tel montage et sa r&eacute;ponse en fr&eacute;quence et en phase, qui illustre bien la compensation.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO81>Montage d&eacute;rivateur.</A></FONT></H5>M&ecirc;me avec un ampli inconditionnellement stable, le montage d&eacute;rivateur est oscillatoire. En rajoutant simplement une r&eacute;sistance en s&eacute;rie avec le condensateur, on stabilise le tout, sachant qu'on limite &eacute;videmment la plage o&ugrave; le montage est d&eacute;rivateur&nbsp;: on ne peut pas tout avoir&nbsp;! Le sch&eacute;ma et le m&eacute;canisme de compensation sont expos&eacute;s en <A HREF="ANNEXE/ANAOP06.HTM" target=_blank>annexe 6</A>.</OL><P>&nbsp;<LI><H4><A NAME=AO82>OSCILLATEURS.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME=AO83>Oscillateur &agrave; pont de wien.</A></FONT></H5><A HREF="#AO66">On a vu</A> que quand le d&eacute;nominateur de la fonction de transfert s'annule, le syst&egrave;me devient auto-oscillant.<P>La condition de Barkhausen s'&eacute;crit&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP121.GIF"></CENTER><P>Le produit AB doit donc &ecirc;tre &eacute;gal &agrave; -1&nbsp;: cela correspond &agrave; une phase de &#177;180&#176; pour un module du gain &eacute;gal &agrave; 1.<P>B &eacute;tant en g&eacute;n&eacute;ral un r&eacute;seau passif (c'est la solution la plus simple, mais il existe aussi des r&eacute;seaux de retour actifs), il sera att&eacute;nuateur. La valeur du module de l'amplification A devra donc &ecirc;tre sup&eacute;rieure &agrave; 1 pour compenser cet te att&eacute;nuation et faire en sorte que |AB|=1.<P>La phase de 180&#176; peut provenir soit de l'ampli (ampli inverseur&nbsp;: la phase de B doit dans ce cas &ecirc;tre &eacute;gale &agrave; 0), soit du r&eacute;seau B (ampli non inverseur dans ce cas)<P>Il existe plusieurs r&eacute;seaux produisant un d&eacute;phasage de 0&#176; ou 180&#176;&nbsp;; un des plus utilis&eacute;s est le r&eacute;seau de Wien&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP122.GIF"></CENTER><P><CENTER>Fig. 44. Pont de Wien.</CENTER><BR>La r&eacute;ponse en fr&eacute;quence de ce r&eacute;seau est la suivante&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP123.GIF"></CENTER><P><CENTER>Fig. 45. R&eacute;ponse en fr&eacute;quence du pont de Wien.</CENTER><BR>La phase de ce r&eacute;seau varie de +90&#176; &agrave; -90&#176; , et passe par la valeur 0&#176; lorsque le gain atteint une valeur maxi de -9,54dB, qui correspond &agrave; une att&eacute;nuation de 3.<P>La fonction de transfert de ce r&eacute;seau s'&eacute;crit&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP124.GIF"></CENTER><P>Le maximum de B est atteint pour&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP125.GIF"></CENTER><P>Pour satisfaire aux conditions de Barkhausen, il faut donc mettre ce r&eacute;seau en contre-r&eacute;action d'un amplificateur de gain -3&nbsp;; une autre solution possible est de reboucler avec ce r&eacute;seau non pas sur l'entr&eacute;e - de l'ampli, mais sur l'entr&eacute;e +&nbsp;: avec un gain de +3, les d&eacute;phasages sont les m&ecirc;mes. Le sch&eacute;ma obtenu est le suivant&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP126.GIF"></CENTER><P><CENTER>Fig. 46. Oscillateur &agrave; pont de Wien.</CENTER><BR>La structure est simple &agrave; comprendre&nbsp;: il s'agit d'un amplificateur non inverseur, avec le pont de Wien reboucl&eacute; sur l'entr&eacute;e de ce type d'ampli, donc, l'entr&eacute;e +.<P>En pratique, on remplacera R<SUB>1</SUB> ou R<SUB>2</SUB> par une r&eacute;sistance ajustable, et on augmentera le gain progressivement jusqu'&agrave; l'apparition d'oscillations en sortie du montage. Au fur et &agrave; mesure que le gain se rapproche de +3, la fonction de transfert globale du montage va tendre vers l'infini, comme illustr&eacute; sur la figure 47&nbsp;:<P><CENTER><IMG SRC="AOP.FIG/AOP127.GIF"></CENTER><P><CENTER>Fig. 47. Fonction de transfert de l'oscillateur.</CENTER><BR>Cet oscillateur, quand il est bien r&eacute;gl&eacute;, donne un signal sinuso&iuml;dal avec tr&egrave;s peu de distorsion.<P>En pratique, pour limiter l'amplitude des oscillations, on devra introduire un &eacute;l&eacute;ment non lin&eacute;aire dans la cha&icirc;ne&nbsp;: soit des diodes z&eacute;ner en sortie, soit une lampe &agrave; filament sp&eacute;cialement pr&eacute;vue pour cet usage &agrave; la place de R<SUB>1</SUB>.<P>Si le gain devient sup&eacute;rieur &agrave; 3, les oscillations prennent une amplitude telle qu'elles sont &eacute;cr&ecirc;t&eacute;es par l'amplificateur. Le signal n'est plus franchement exploitable, car il pr&eacute;sente une distorsion importante.<P>Les oscillateurs sont d&eacute;licats &agrave; mettre en &#156;uvre, car il faut les r&eacute;gler de telle mani&egrave;re que le gain soit suffisant pour que l'oscillateur "accroche", mais pas trop grand, car on a alors beaucoup de distorsion. La plage de fonctionnement correcte est tr&egrave;s &eacute;troite, et relativement instable (variations dues &agrave; la temp&eacute;rature, &agrave; la charge de l'ampli...).</OL></OL></OL></BODY></HTML>