<HTML><HEAD><TITLE>Diversit&eacute; de la mesure</TITLE></HEAD><BODY><CENTER><IMG SRC="../BASE/ICONES/NAV.GIF"></CENTER><P align=center>Si votre &eacute;cran ne se pr&eacute;sente pas comme ceci, <A HREF="MESU.HTM" target="_top"> cliquez l&agrave; </A><OL TYPE=I><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="M01">DIVERSIT&Eacute; DE LA MESURE.</A></H3><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="M02">TYPES DE MESURES.</A></H4><P>Les mesures &agrave; effectuer en milieu industriel ou dans des laboratoires de recherche universitaire sont extr&ecirc;mement vari&eacute;es. On peut en distinguer plusieurs cat&eacute;gories&nbsp;:<P> <STRONG> - mesures simples</STRONG>, ex&eacute;cut&eacute;es &agrave; la main avec un appareil transportable&nbsp;: elles se font sur le site de l'&eacute;l&eacute;ment ou du param&egrave;tre &agrave; mesurer. Exemple&nbsp;: mesure de tension &agrave; l'aide d'un multim&egrave;tre.<P> <STRONG> - mesures complexes</STRONG>, n&eacute;cessitant un appareillage lourd&nbsp;: on les fait (quand on le peut&nbsp;!) dans un local am&eacute;nag&eacute; pour recevoir ce mat&eacute;riel sp&eacute;cifique. Exemple&nbsp;: mesure de consommation sp&eacute;cifique d'un moteur &agrave; combustion interne sur un banc moteur. Plus g&eacute;n&eacute;ralement, c'est le cas de nombre de mesures faites dans des labos de recherche fondamentale.<P> <STRONG> - mesures multiples</STRONG>, n&eacute;cessitant l'acquisition simultan&eacute;e de plusieurs param&egrave;tres&nbsp;: on fait appel &agrave; une centrale d'acquisition portable pour des mesures sur site, ou &agrave; des appareils ind&eacute;pendants f&eacute;d&eacute;r&eacute;s par un micro-ordinateur (pilotage des appareils et traitement des mesures) en labo. Exemple&nbsp;: mesure de plusieurs param&egrave;tres de fonctionnement d'un v&eacute;hicule (vitesse, r&eacute;gime moteur, consommation instantan&eacute;e...) &agrave; l'aide d'une centrale de mesure embarqu&eacute;e.<P>&nbsp;<LI><H4><A NAME="M03">DOMAINES D'APPLICATION.</A></H4><P>La finalit&eacute; de ces mesures peut &ecirc;tre tr&egrave;s vari&eacute;e. On retiendra notamment&nbsp;:<P> <STRONG> - mesures en laboratoire</STRONG>&nbsp;: indispensable &agrave; tout organisme de recherche (fondamentale ou appliqu&eacute;e), &agrave; tout service d'&eacute;tude..., ceci afin de pouvoir &eacute;laborer des th&eacute;ories et les v&eacute;rifier, de concevoir et tester des nouveaux mat&eacute;riaux, composants, produits...<P> <STRONG> - mesures de qualification</STRONG> de produits de grande consommation&nbsp;: avant de lancer un produit en production et sur le march&eacute; (automobile, &eacute;lectrom&eacute;nager, Hi-Fi, vid&eacute;o...), on doit s'assurer qu'il va bien fonctionner sans probl&egrave;mes pendant une dur&eacute;e de vie minimum, dans divers environnement (chaud, froid, humidit&eacute;...), et qu'il respecte les normes en vigueur. On fait alors fonctionner un &eacute;chantillon de ces produits (quelques dizaines d'unit&eacute;s dans les cas courants) dans des laboratoires avec du mat&eacute;riel susceptible de les piloter (marche/arr&ecirc;t, plus vite/moins vite...), de g&eacute;n&eacute;rer des ambiances climatiques extr&ecirc;mes (froid, chaud, humidit&eacute;...), et de mesurer divers param&egrave;tres. Les mesures sont parfois faites dans un autre laboratoire apr&egrave;s un nombre d&eacute;termin&eacute; d'heures de fonctionnement. Les bancs de mesure sont alors complexes &agrave; mettre au point, du fait des ambiances extr&ecirc;mes, et des parasitages induits par les appareils environnants (enceintes climatiques chaud/ froid, compresseurs, ventilateurs, alimentations &eacute;lectriques de forte puissance...).<P> <STRONG> - mesures de tests en production</STRONG>&nbsp;: &agrave; toutes les &eacute;tapes de la fabrication d'un produit, les divers &eacute;l&eacute;ments le constituant sont test&eacute;s, c'est &agrave; dire mesur&eacute;s et compar&eacute;s &agrave; des valeurs mini et maxi (les tol&eacute;rances). Le probl&egrave;me est le m&ecirc;me que pr&eacute;c&eacute;demment&nbsp;: les mesures sont faites dans une ambiance tr&egrave;s perturb&eacute;e. Il faut aussi faire face au stockage d'un tr&egrave;s grand nombre de donn&eacute;es et &agrave; leur exploitation, en direct ou en diff&eacute;r&eacute;.<P> <STRONG> - contr&ocirc;le de processus industriels</STRONG>&nbsp;: beaucoup de processus de fabrication industriels sont asservis, c'est &agrave; dire contr&ocirc;l&eacute;s par une ou plusieurs variables, et ce, en temps r&eacute;el. Il est alors n&eacute;cessaire de mesurer et de traiter au fur et &agrave; mesure de leur acquisition plusieurs param&egrave;tres r&eacute;partis tout au long du processus pour pouvoir agir en cons&eacute;quence et garantir la qualit&eacute; et la conformit&eacute; du produit final.<P>&nbsp;<LI><H4><A NAME="M04">GRANDEURS &Agrave; MESURER.</A></H4><P>Toutes ces mesures sont de plus applicables &agrave; un tr&egrave;s grand nombre de param&egrave;tres physiques, qui peuvent &ecirc;tre&nbsp;:<P> <STRONG> - m&eacute;caniques</STRONG>&nbsp;: longueur, vitesse, d&eacute;bit, pression, viscosit&eacute;, &eacute;tat de surface, puissance, couple...<P> <STRONG> - &eacute;lectriques</STRONG>&nbsp;: tension, intensit&eacute;, puissances...<P> <STRONG> - thermiques</STRONG>&nbsp;: temp&eacute;rature, r&eacute;sistance thermique...<P> <STRONG> - chimiques</STRONG>&nbsp;: Ph, concentration, salinit&eacute;...<P>La liste est tr&egrave;s longue&nbsp;! Mais, toutefois, beaucoup de ces mesures pr&eacute;sentent des points communs&nbsp;:<P> - d'une part, l'&eacute;l&eacute;ment servant &agrave; mesurer les grandeurs d&eacute;sir&eacute;es (capteur, palpeur, sonde...) d&eacute;livre tr&egrave;s souvent (de plus en plus) un signal &eacute;lectrique qu'il faudra r&eacute;cup&eacute;rer, amplifier et adapter sans d&eacute;formation (ou alors avec une d&eacute;formation ma&icirc;tris&eacute;e&nbsp;: lin&eacute;arisation par exemple). On se ram&egrave;ne donc quasiment tout le temps &agrave; des mesures de tension.<P> - d'autre part, il faudra transmettre ce signal &agrave; un dispositif de mesure &eacute;lectrique ou &agrave; une centrale d'acquisition. C'est une des raison pour laquelle on utilise de plus en plus des capteurs d&eacute;livrant des signaux &eacute;lectriques&nbsp;: il est facile ensuite de stocker les signaux, de les traiter et de les restituer &agrave; l'aide d'un ordinateur.<P>&nbsp;<LI><H4><A NAME="M05">MESURES MANUELLES ET AUTOMATIQUES.</A></H4><P>Nous allons maintenant donner une autre classification des mesures, qui va nous permettre de distinguer deux m&eacute;thodologies de travail diff&eacute;rentes&nbsp;:<P> - les mesures faites au coup par coup, avec du mat&eacute;riel pilot&eacute; manuellement.<P> - les mesures &agrave; grande &eacute;chelle, fortement r&eacute;p&eacute;titives, obligatoirement faites &agrave; l'aide de bancs de mesure informatis&eacute;s permettant l'acquisition, le traitement et le stockage d'un grand nombre de donn&eacute;es.<P>En fait, nous allons voir que ces deux cat&eacute;gories ont une bonne partie de leur mode op&eacute;ratoire en commun, et que la mise au point d'un banc de mesure automatique passe par un d&eacute;verminage en mode manuel.</OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="M06">QU'ES-CE QU'UNE CHA&#206;NE DE MESURE&nbsp;?</A></H3><P>La <STRONG>cha&icirc;ne de mesure</STRONG> est l'ensemble des &eacute;l&eacute;ments n&eacute;cessaires pour conna&icirc;tre la valeur ou l'&eacute;volution de param&egrave;tres d'un syst&egrave;me physique.<P>En pratique, et dans le cas des capteurs d&eacute;livrant un signal &eacute;lectrique, une cha&icirc;ne de mesure sera constitu&eacute;e des &eacute;l&eacute;ments suivants&nbsp;:<P><STRONG> - le capteur.</STRONG><P><STRONG> - un c&acirc;ble de liaison.</STRONG><P><STRONG> - une interface</STRONG> servant d'adaptateur d'imp&eacute;dance entre le capteur et l'&eacute;tage amplificateur.<P><STRONG> - un &eacute;tage amplificateur</STRONG> (faible bruit) destin&eacute; &agrave; amplifier les signaux g&eacute;n&eacute;ralement tr&egrave;s faibles issus du capteur. Cet &eacute;tage amplificateur aura aussi une fonction de conversion de mode (mode diff&eacute;rentiel &agrave; mode commun) dans le cas d'une mesure en mode diff&eacute;rentiel.<P> - on peut trouver un <STRONG>&eacute;tage conditionneur</STRONG> (ex&nbsp;: lin&eacute;arisateur) si le capteur ne d&eacute;livre pas une tension proportionnelle &agrave; la grandeur &agrave; mesurer. Il y aura aussi tr&egrave;s souvent un syst&egrave;me de compensation des d&eacute;rives thermiques du capteur.<P> - ensuite, on trouve quelquefois des <STRONG>filtres</STRONG> destin&eacute;s &agrave; supprimer les signaux parasites issus du couple capteur/c&acirc;ble.<P> - dans certaines cha&icirc;nes, une interface r&eacute;alise <A HREF="../PERTU/COURS.HTM#P30" target=_blank>l'isolation galvanique</A> entre le capteur et l'&eacute;l&eacute;ment de mesure.<P> - dans tous la plupart des cas, on mesure une tension&nbsp;: on trouve donc un <STRONG>voltm&egrave;tre</STRONG> derri&egrave;re l'amplificateur ou les conditionneurs.<P> - enfin, il faut un <STRONG>syst&egrave;me d'affichage</STRONG> pour donner la valeur de la mesure.<P> - dans le cas d'un banc de mesures automatique, on trouvera en plus un <STRONG>micro-ordinateur</STRONG> servant &agrave; piloter les instruments, &agrave; faire l'acquisition des param&egrave;tres et leur traitement.<P>Il va de soi que tous ces &eacute;l&eacute;ments troubleront le moins possible la mesure&nbsp;: ils devront &ecirc;tre pr&eacute;cis, fid&egrave;les, le plus lin&eacute;aire possible (faible distorsion), ne pas apporter de signal parasite (faible bruit), et avoir une d&eacute;rive minimum en temp&eacute;rature, en hygrom&eacute;trie...<P>Un <STRONG>instrument de mesure</STRONG> est un appareil qui va r&eacute;unir tout ou partie de la cha&icirc;ne de mesure. Souvent, il comprend toute la cha&icirc;ne &agrave; l'exception du capteur et des c&acirc;bles.<P>Il existe tous les degr&eacute;s de modularit&eacute; entre l'instrument monobloc (toute la cha&icirc;ne y compris le capteur) et le syst&egrave;me compl&egrave;tement &eacute;clat&eacute;.<P>Par exemple, le syst&egrave;me d'affichage ne sera peut-&ecirc;tre pas inclus&nbsp;: on aura juste une sortie en tension haut niveau (quelques volts ou centaines de mV) qu'il faudra brancher sur un voltm&egrave;tre ou bien un oscilloscope.<P>On trouve maintenant sur le march&eacute; de plus en plus de <A HREF="http://michelhubin.multimania.com/DOTECSI/DOTECSI5/chap05.htm#silicium " target=_blank>capteurs "intelligents"</A>&nbsp;: ce sont g&eacute;n&eacute;ralement des capteurs dont l'&eacute;l&eacute;ment sensible est en silicium (exemple&nbsp;: capteur de pression piezo-r&eacute;sistif, constitu&eacute; d'un pont de r&eacute;sistances diffus&eacute;es dans du silicium micro-usin&eacute;), ce qui permet d'int&eacute;grer sur ce cristal de silicium, et juste &agrave; c&ocirc;t&eacute; de l'&eacute;l&eacute;ment sensible, les fonctions d'adaptation d'imp&eacute;dance, amplification, compensation thermique, lin&eacute;arisation... Le capteur d&eacute;livre alors directement un signal de tension haut niveau proportionnel au param&egrave;tre &agrave; mesurer. L'int&eacute;gration permet en plus de diminuer les co&ucirc;ts et augmenter la miniaturisation, ce qui est int&eacute;ressant pour les syst&egrave;mes de mesure embarqu&eacute;s (aviation, spatial, automobile...)<P>Pour une m&ecirc;me mesure, on va trouver sur le march&eacute; divers appareils qui seront soit monoblocs, soit modulaires&nbsp;: il faudra choisir celui qui convient le mieux, et le crit&egrave;re principal ne sera pas forc&eacute;ment la qualit&eacute; de mesure, mais aussi la modularit&eacute;, l'ouverture (veut-on acc&eacute;der &agrave; des param&egrave;tres interm&eacute;diaires, sous quelle forme...), la compacit&eacute;, le co&ucirc;t...<P>La modularit&eacute; peut &ecirc;tre un avantage si la cha&icirc;ne n'est pas utilis&eacute;e en permanence par une exp&eacute;rimentation particuli&egrave;re&nbsp;: on peut alors r&eacute;utiliser des &eacute;l&eacute;ments pour plusieurs types de mesures.<P>Bien choisir un appareil de mesure n'est pas une t&acirc;che ais&eacute;e, et n&eacute;cessite une bonne r&eacute;flexion pr&eacute;liminaire&nbsp;!<P>&nbsp;<P>&nbsp;<LI><H3><A NAME="M07">MESURES MANUELLES.</A></H3><P>Nous allons traiter la cha&icirc;ne de mesure suivante&nbsp;:<P align=center><IMG SRC="MESU.FIG/MESU01.GIF"><P>Ce cas est relativement r&eacute;pandu, et ce qui va &ecirc;tre dit ci-apr&egrave;s est facilement transposable aux autres cas de figure.<P>Lors de mesures &eacute;lectriques directes (tensions), il n'y a pas de capteur.<P>Tous ces &eacute;l&eacute;ments (y compris les c&acirc;bles, souvent n&eacute;glig&eacute;s&nbsp;!) devront &ecirc;tre choisis avec soin pour r&eacute;pondre convenablement au besoin&nbsp;: gamme de mesure, pr&eacute;cision, rapidit&eacute;...<P>Par exemple, si on propose de mesurer la temp&eacute;rature ambiante dans une pi&egrave;ce avec un thermocouple de type K ayant une plage de mesure de -270 &agrave; 1250&#176;C et une pr&eacute;cision de &#177;3&#176;C, on va faire beaucoup rire, surtout si on donne toutes ces indications.<P>Pourtant, dans le milieu industriel, et derri&egrave;re des baies de mesures impressionnantes de professionnalisme, il n'est pas rare de trouver ce genre de choses&nbsp;! Et puis, qui oserait remettre en cause la valeur indiqu&eacute;e au 1/10&egrave;me de &#176;C sur un afficheur de marque r&eacute;put&eacute;e&nbsp;?<P>Dans tous les choix de mat&eacute;riel et toutes les mesures, une r&egrave;gle d'or s'impose&nbsp;: ne pas se laisser impressionner par une d&eacute;bauche de mat&eacute;riel. Il faut toujours &ecirc;tre critique, et bien v&eacute;rifier que toute la cha&icirc;ne de mesure est homog&egrave;ne.<P>Il est tout &agrave; fait possible, avec de l'exp&eacute;rience, des id&eacute;es et le sens du travail bien fait, de faire des mesures de bien meilleure qualit&eacute; et pour beaucoup moins cher que si on se laisse happer par les sir&egrave;nes du mat&eacute;riel "hi-tech".<OL TYPE=A><P>&nbsp;<LI><H4><A NAME="M08">CHOIX DU MAT&Eacute;RIEL</A></H4><P>Bien souvent, en mesure, on fait ce qu'on peut, et non toujours ce qu'on veut&nbsp;! Ceci pour une excellente raison&nbsp;: le mat&eacute;riel de mesure co&ucirc;te cher, tr&egrave;s cher...<P>On essayera alors de faire un compromis acceptable entre performances et co&ucirc;t.<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="M09">Choix du capteur.</A></FONT></H5><P>Autant que possible, il faudra adapter le capteur &agrave; la mesure, en termes de&nbsp;:<P> - sensibilit&eacute;<P> - plage d'utilisation<P> - r&eacute;p&eacute;tabilit&eacute;, hyst&eacute;r&eacute;sis, fid&eacute;lit&eacute;<P> - d&eacute;rive en temp&eacute;rature, pression, humidit&eacute;...<P>Dans la pratique, on disposera peut-&ecirc;tre d'un capteur moins performant que ce qu'on avait sp&eacute;cifi&eacute; &agrave; priori dans le cahier des charges, mais qui peut faire l'affaire tout de m&ecirc;me. Cela &eacute;vitera l'achat d'un nouveau capteur, et va dans le sens d'une plus grande standardisation de l'instrumentation disponible dans le laboratoire.<P><STRONG>Par contre</STRONG>, il faudra faire la mesure en connaissance de cause, et tenir compte de la d&eacute;gradation des performances dans les conclusions &agrave; tirer de l'exp&eacute;rimentation.<P>Pour reprendre l'exemple pr&eacute;c&eacute;dent, on peut mesurer la temp&eacute;rature d'une pi&egrave;ce avec un thermocouple de type K si une pr&eacute;cision de &#177;&nbsp;3&#176;C suffit. Il sera alors inutile de mettre un afficheur ayant une r&eacute;solution de 0,1&#176;C, et surtout de consigner dans le rapport des valeurs de temp&eacute;rature avec des d&eacute;cimales...<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="M10">Choix de l'instrument.</A></FONT></H5><P>Nous avons d&eacute;j&agrave; parl&eacute; <A HREF="#M06">des diff&eacute;rents types d'instruments</A> existants. On verra donc ce qui est d&eacute;j&agrave; disponible dans le labo et si un compromis est r&eacute;alisable sans acheter trop de mat&eacute;riel.<P>Il faudra n&eacute;anmoins faire usage d'un instrument compatible avec le capteur&nbsp;:<P> - sensibilit&eacute;, gamme d'utilisation.<P> - mode de c&acirc;blage&nbsp;: capteur isol&eacute;, avec une borne reli&eacute;e &agrave; la masse du montage, sortie en 1 fil + blindage, 2 fils, 2 fils plus blindage, montage en pont...<P> - type d'entr&eacute;e (sensible &agrave; la tension, au courant, &agrave; la charge &eacute;lectrique, &agrave; la r&eacute;sistance...), imp&eacute;dance.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="M11">Choix du c&acirc;ble.</A></FONT></H5><P>Le c&acirc;ble est un maillon de la cha&icirc;ne qui est souvent n&eacute;glig&eacute;, &agrave; tort, car un c&acirc;ble mal adapt&eacute; peut apporter beaucoup de perturbations dans les mesures, les principales &eacute;tant&nbsp;:<P> <STRONG> - imp&eacute;dances parasites</STRONG> chargeant le capteur (capacit&eacute; parasite d'un c&acirc;ble coaxial par exemple). Ces imp&eacute;dances parasites forment un diviseur de tension avec l'imp&eacute;dance de sortie du capteur et modifient la sensibilit&eacute; annonc&eacute;e par le constructeur&nbsp;: la cha&icirc;ne ne sera plus &eacute;talonn&eacute;e convenablement. En plus, pour compliquer, ce d&eacute;faut variera souvent avec la fr&eacute;quence du signal...<P> <STRONG> - bande passante inadapt&eacute;e</STRONG>&nbsp;: pour des signaux rapides, il faut pr&eacute;voir un c&acirc;ble permettant de transmettre des fr&eacute;quences bien sup&eacute;rieures &agrave; celles constituant le signal afin de ne pas le d&eacute;former.<P> <STRONG> - g&eacute;n&eacute;ration de bruit</STRONG>&nbsp;: la mesure d'un signal tr&egrave;s faible dans une ambiance bruit&eacute;e avec un c&acirc;ble non ou mal blind&eacute; peut &ecirc;tre compl&egrave;tement fauss&eacute;e par des signaux parasites.<P> <STRONG> - couplages</STRONG>&nbsp;: si on a plusieurs capteurs sur un &eacute;quipement &agrave; mesurer reli&eacute;s &agrave; une seule centrale de mesure, il faudra veiller &agrave; &eacute;viter des couplages parasites et minimiser les effets des boucles de masse.<P>Parfois, le fabricant de certains capteurs (par exemple des acc&eacute;l&eacute;rom&egrave;tre pi&eacute;zo&eacute;lectriques) fournit un c&acirc;ble sp&eacute;cifique (souvent fort cher&nbsp;!) destin&eacute; &agrave; les relier &agrave; un conditionneur sp&eacute;cifique lui aussi. Il est imp&eacute;ratif de respecter l'homog&eacute;n&eacute;it&eacute; de la cha&icirc;ne, et ne pas faire de mesquines &eacute;conomies sous peine de d&eacute;boires s&eacute;v&egrave;res. Lors de l'achat, il faudra consid&eacute;rer la cha&icirc;ne de mesure dans sa globalit&eacute;, c'est &agrave; dire <STRONG>c&acirc;ble compris</STRONG>&nbsp;: on pourra ou non se l'acheter, mais dans tous les cas, il faut proscrire le bricolage.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="M12">Attention au vocabulaire...</A></FONT></H5><P>Une erreur courante consiste &agrave; confondre r&eacute;solution et pr&eacute;cision.<P>La <STRONG>r&eacute;solution</STRONG> est la variation mini du param&egrave;tre &agrave; mesurer qui introduira une modification dans l'affichage. Sur un afficheur num&eacute;rique, ce sera un digit.<P>La <STRONG>pr&eacute;cision</STRONG> va quantifier l'erreur maxi de mesure, &agrave; savoir la diff&eacute;rence maximum entre ce qu'indique l'affichage et la valeur vraie du param&egrave;tre mesur&eacute;.<P>Pour reprendre l'exemple de mesure de temp&eacute;rature ambiante avec un thermocouple, on pourra avoir une r&eacute;solution de 0,1&#176;C et une pr&eacute;cision de &#177;3&#176;C&nbsp;: l'afficheur donne le 1/10&egrave;me de degr&eacute;, mais l'affichage pourra &ecirc;tre diff&eacute;rent de &#177;3&#176;C par rapport &agrave; la vraie temp&eacute;rature de la pi&egrave;ce.<P>L'afficheur peut par exemple indiquer 23,6&#176;C pour une temp&eacute;rature vraie de 26,1&#176;C.<P>Les afficheurs num&eacute;riques actuels ont un effet intimidant d&ucirc; au nombre impressionnant de digits affich&eacute;s. Il ne faut jamais perdre de vue que souvent, les derniers digits sont compl&egrave;tement faux. Il est alors inutile de les consigner dans un rapport, et pis, il est aberrant de tirer des conclusions sur l'&eacute;volution d'un param&egrave;tre si les variations enregistr&eacute;es sont inf&eacute;rieures &agrave; la pr&eacute;cision de la cha&icirc;ne de mesure.<P>L&agrave; encore, ce propos risque de faire sourire&nbsp;; et pourtant...<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="M13">Attention au mat&eacute;riel...</A></FONT></H5><P>Gr&acirc;ce &agrave; l'&eacute;lectronique, il est tout &agrave; fait possible de prot&eacute;ger des &eacute;quipements de mesure contre des fausses man&#156;uvres&nbsp;: par exemple, il faut &ecirc;tre vraiment tr&egrave;s maladroit pour endommager un oscilloscope&nbsp;!<P>Par contre, pour du mat&eacute;riel &agrave; tr&egrave;s grande sensibilit&eacute;, ces protections ne sont pas faisables, car elles introduiraient des perturbations trop grandes vis &agrave; vis des signaux &agrave; mesurer (courants de fuite, tension parasites...).<P>Ce mat&eacute;riel sensible est donc tr&egrave;s fragile. Et en g&eacute;n&eacute;ral, il est aussi tr&egrave;s cher... Il faut donc se poser toutes les bonnes questions <STRONG>avant</STRONG> de brancher&nbsp;!</OL><P>&nbsp;<LI><H4><A NAME="M14">MODE OP&Eacute;RATOIRE.</A></H4><P>On pourrait se demander quelle est l'utilit&eacute; d'un tel paragraphe&nbsp;: pour mesurer un param&egrave;tre d'un syst&egrave;me donn&eacute;, il suffit de mettre le capteur en place, de le relier &agrave; l'instrument de mesure, on branche le tout, on rel&egrave;ve la valeur, et c'est fini...<P>H&eacute; bien non&nbsp;! C'est pourtant ce qu'on voit tr&egrave;s souvent.<P>En mesure, il existe un <STRONG>principe de base</STRONG>&nbsp;: il faut <STRONG>rester critique</STRONG> vis &agrave; vis de son montage et des r&eacute;sultats observ&eacute;s.<P>Souvent, plut&ocirc;t que de se contenter d'une seule mesure, il faudra la r&eacute;p&eacute;ter dans diverses conditions pour se faire une id&eacute;e de l'influence de chaque maillon (capteur, c&acirc;ble, instrument...), de l'environnement (parasitage, temp&eacute;rature, hygrom&eacute;trie...), et essayer de d&eacute;terminer la configuration donnant les r&eacute;sultats les plus vraisemblables.<P>On peut tomber sur deux cas de figure&nbsp;:<P> - soit on "conna&icirc;t" le r&eacute;sultat qu'on doit obtenir, et alors, il sera ais&eacute; d'&eacute;liminer les configurations donnant des r&eacute;sultats fantaisistes. Ce cas se pr&eacute;sente en g&eacute;n&eacute;ral quand on a d&eacute;j&agrave; fait des mesures similaires. Sinon, il ne faudra pas h&eacute;siter &agrave; aller consulter un coll&egrave;gue ayant de l'exp&eacute;rience dans le domaine consid&eacute;r&eacute;. La confrontation des id&eacute;es et des r&eacute;sultats peut ainsi &ecirc;tre b&eacute;n&eacute;fique &agrave; tout le monde.<P> - le deuxi&egrave;me cas est beaucoup plus critique&nbsp;: on ne sait pas du tout o&ugrave; on va. Le mode op&eacute;ratoire indiqu&eacute; ci-apr&egrave;s est alors tr&egrave;s fortement conseill&eacute;&nbsp;!<UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="M15">Essayer plusieurs combinaisons de mat&eacute;riel.</A></FONT></H5><P>Lorsque c'est possible et que cela n'entra&icirc;ne pas des d&eacute;penses prohibitives (penser au pr&ecirc;t ou &agrave; la location de mat&eacute;riel), on peut faire des mesures avec des capteurs diff&eacute;rents, associ&eacute;s &agrave; des c&acirc;bles diff&eacute;rents et des instruments diff&eacute;rents. La technique des <A HREF="#M30">plans d'exp&eacute;riences</A> pourra ici apporter un plus, notamment pour ce qui est des interactions entre les maillons de la cha&icirc;ne&nbsp;: en effet, un c&acirc;ble pourra donner d'excellents r&eacute;sultats avec un capteur donn&eacute; et perturber compl&egrave;tement un autre capteur. Ce n'est pas la valeur intrins&egrave;que du c&acirc;ble qui est &agrave; mettre en cause, mais son association avec le capteur.<P>Pour les capteurs sensibles au positionnement (capteurs de temp&eacute;rature, acc&eacute;l&eacute;rom&egrave;tres...), il faudra tester l'influence de l'emplacement et de la fixation de ces capteurs.<P>Certains appareils poss&egrave;dent des r&eacute;glages concernant la bande passante du signal&nbsp;: on pourra tester ici leur effet&nbsp;: r&eacute;duction de bruit et stabilisation de la mesure, ou alors modification importante du signal (amplitude, phase, forme...)<P>Si tous les r&eacute;sultats convergent, c'est tr&egrave;s bien&nbsp;: on retiendra les outils qu'on ma&icirc;trise le mieux, ou bien les moins chers...<P>Si les r&eacute;sultats sont diff&eacute;rents, il faudra &eacute;tudier tous les cas un par un, essayer d'expliquer les r&eacute;sultats obtenus, et d&eacute;tecter les sources d'erreurs.<P>Cette phase d'analyse ne repr&eacute;sente que trois lignes dans ce cours&nbsp;; mais il ne faut pas se leurrer&nbsp;: sur une "manip" un peu pointue, cela peut prendre des semaines...<P>Le fait de tester plusieurs configurations diff&eacute;rentes aide beaucoup dans cette phase de recherche. Par exemple, si une cause d'erreur est la capacit&eacute; parasite d'un c&acirc;ble, on peut la cerner en faisant un test avec un c&acirc;ble beaucoup moins capacitif. On essayera avec des calculs simples et d'apr&egrave;s les sp&eacute;cifications du mat&eacute;riel test&eacute; de quantifier (au premier ordre) les erreurs et de voir si ce calcul corr&egrave;le avec les mesures.<P>On pourra ainsi petit &agrave; petit trouver toutes (soyons optimistes&nbsp;!) les sources d'erreur, et surtout, se faire une exp&eacute;rience des probl&egrave;mes rencontr&eacute;s qui sera bien utile &agrave; la prochaine exp&eacute;rimentation.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="M16">Tester la r&eacute;p&eacute;tabilit&eacute; des mesures.</A></FONT></H5><P>Cette deuxi&egrave;me phase se fera en fait en m&ecirc;me temps que la pr&eacute;c&eacute;dente, car tout est li&eacute;.<P>Pour chaque configuration test&eacute;e, on va s'assurer que la mesure est reproductible.<P>Le premier point trivial &agrave; v&eacute;rifier est la stabilit&eacute; de la mesure&nbsp;: si l'afficheur varie en permanence, ou si la courbe d'un signal tangue sur l'oscilloscope, il faut tout de suite en chercher les raisons avant d'aller plus loin. Il faudra v&eacute;rifier notamment la bonne mise &agrave; la masse des capteurs, des c&acirc;bles et des instruments.<P>Ensuite, on devra r&eacute;p&eacute;ter la mesure un certain nombre de fois sur une pi&egrave;ce t&eacute;moin et juger de sa dispersion &agrave; l'aide d'outils statistiques simples comme la moyenne, le mini, le maxi, l'&eacute;cart type, et &eacute;ventuellement tracer la courbe de distribution des valeurs obtenues.<P>Il ne faudra bien entendu pas oublier de faire des test dans des conditions climatiques diff&eacute;rentes&nbsp;: par exemple, mesurer pr&eacute;cis&eacute;ment des r&eacute;sistances ayant un coefficient de temp&eacute;rature important n&eacute;cessite des pr&eacute;cautions. Le labo peut &ecirc;tre froid le matin, mais bien ensoleill&eacute; l'apr&egrave;s midi. Quelques degr&eacute;s d'&eacute;cart peuvent rendre caduques bien des digits d'afficheur...<P>De m&ecirc;me, sur des montages &agrave; tr&egrave;s haute imp&eacute;dance (mesure d'isolation par exemple), une humidit&eacute; non contr&ocirc;l&eacute;e peut avoir une incidence importante&nbsp;: il faut y penser... et y rem&eacute;dier si possible.<P>On pourra (si les conclusions ne sont pas &agrave; rendre pour la veille, comme on le voit fr&eacute;quemment dans l'industrie&nbsp;!) tester la r&eacute;p&eacute;tabilit&eacute; dans le temps et quantifier les &eacute;ventuelles d&eacute;rives.<P>A ce titre, quand on fait r&eacute;guli&egrave;rement des mesure avec le m&ecirc;me mat&eacute;riel, le premier test &agrave; faire est de remesurer l'&eacute;l&eacute;ment qui a &eacute;t&eacute; pass&eacute; sur le banc lors de la campagne pr&eacute;c&eacute;dente. <STRONG>Normalement</STRONG>, le r&eacute;sultat doit &ecirc;tre le m&ecirc;me... Si ce n'est pas le cas, il faut passer tout le banc de mesure au peigne fin jusqu'&agrave; ce qu'on trouve les sources de divergence.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="M17">En conclusion</A></FONT></H5><P><STRONG>Ne jamais se fier</STRONG> aveugl&eacute;ment aux indications d'un <STRONG>appareillage sophistiqu&eacute;</STRONG>. Dans la mesure (si on peut dire&nbsp;!) du possible, on devra essayer plusieurs types de manipulations permettant de corr&eacute;ler les r&eacute;sultats, et comparer autant que possible ces r&eacute;sultats ainsi que les protocoles d'exp&eacute;rimentation avec des coll&egrave;gues ayant une exp&eacute;rience similaire.<P>Et surtout, si nos essais nous am&egrave;nent &agrave; des conclusions "bizarres", r&eacute;visons notre copie avant de la publier.<P>Par exemple, si nos r&eacute;sultats nous entra&icirc;nent &agrave; remettre en cause le principe d'attraction universelle, pensons <STRONG>d'abord</STRONG> &agrave; l'erreur de mesure, et <STRONG>ensuite</STRONG> au prix Nobel...<P>J'en voit qui sourient... La fusion froide, &ccedil;a vous dit quelque chose&nbsp;?<P>P.S&nbsp;: il ne pas se sous-estimer quand m&ecirc;me, ni laisser de c&ocirc;t&eacute; sa cr&eacute;ativit&eacute;. Parfois, c'est <STRONG>vraiment</STRONG> le prix Nobel qui attend au bout des mesures...</UL></OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="M18">BANCS DE MESURE.</A></H3>Lorsqu'on doit faire toute une s&eacute;rie de mesures sur un &eacute;chantillon de grande taille, il est n&eacute;cessaire de passer au banc automatique pour plusieurs raisons&nbsp;:<P> - gain de temps.<P> - on &eacute;vite l'ennui de refaire plusieurs fois la m&ecirc;me chose.<P> - une fois que le banc est au point, l'automatisation garantit une bonne r&eacute;p&eacute;tabilit&eacute; dans les mesures, et &eacute;vite les erreurs de manipulation.<P>Par contre, la mise au point de ce banc devra &ecirc;tre faite avec le plus grand soin, et on fera en parall&egrave;le avec le banc des mesures manuelles dans diverses conditions pour v&eacute;rifier la fiabilit&eacute; des r&eacute;sultats obtenus.<OL TYPE=A><P>&nbsp;<LI><H4><A NAME="M19">MAT&Eacute;RIEL N&Eacute;CESSAIRE<P></H4>Le mat&eacute;riel de base sera le m&ecirc;me que pour les mesures manuelles, auquel on va rajouter&nbsp;: <P> - des instruments de mesure t&eacute;l&eacute;commandables par un ordinateur, via une liaison s&eacute;rie ou un port GPIB (ou autre...).<P> - un ordinateur qui servira &agrave; commander les instruments et &agrave; r&eacute;cup&eacute;rer les donn&eacute;es mesur&eacute;es. Il servira ensuite soit &agrave; faire du traitement des donn&eacute;es en diff&eacute;r&eacute; (traitement math&eacute;matique, affichage de courbes...), soit &agrave; les traiter en temps r&eacute;el dans le cas d'un contr&ocirc;le de processus. Dans ce dernier cas, l'ordinateur va aussi servir &agrave; piloter le processus industriel.<P> - souvent, on remplace l'instrument de mesure traditionnel par une carte d'acquisition de donn&eacute;es qu'on fixe dans l'ordinateur. Ces cartes sont tr&egrave;s utilis&eacute;es quand on a beaucoup de mesures &agrave; faire en parall&egrave;le, car elles poss&egrave;dent un grand nombre d'entr&eacute;es configurables par logiciel depuis l'ordinateur (r&eacute;glage de la sensibilit&eacute;, du <A HREF="../AINST/COURS.HTM#AI01" target=_blank>type de mesure  simple ou diff&eacute;rentielle</A>...). Quelquefois, ces cartes incluent des conditionneurs de capteurs &agrave; l'entr&eacute;e (notamment pour les thermocouples).<P> - certains bancs de mesure (pour la qualification de produits notamment) comportent des machines climatiques (chaleur, froid, humidit&eacute;...) qu'on choisira de pr&eacute;f&eacute;rence  pilotables par l'ordinateur.<P>&nbsp;<LI><H4><A NAME="M20">MISE EN GARDE&nbsp;!<P></H4>De plus en plus, on trouve dans les labos des bancs de mesures avec un ordinateur de pilotage. C'est tr&egrave;s pratique, mais il faut faire tr&egrave;s attention&nbsp;:<P align=center><IMG SRC="MESU.FIG/MESU02.GIF"><P>Le probl&egrave;me de ces bancs, c'est que rien n'est accessible simplement&nbsp;; s'ils ont &eacute;t&eacute; mis au point par une tierce personne, la documentation est g&eacute;n&eacute;ralement d&eacute;ficiente (quand elle existe), et en particulier, on ne conna&icirc;t pas trop les limites de validit&eacute; des mesures.<P>On donne donc quelque chose &agrave; mesurer en p&acirc;ture &agrave; la machine qui recrache un r&eacute;sultat aseptis&eacute; et emball&eacute; &agrave; l'autre bout. Et on ne sait rien de ce qui s'est pass&eacute; dans les entrailles de la machine.<P>L&agrave; encore, il ne faut surtout pas se laisser impressionner par une machine haut de gamme fournissant &agrave; la vitesse de l'&eacute;clair des r&eacute;sultats avec 18 d&eacute;cimales et des courbes en 3D et en couleur&nbsp;!<P>Derri&egrave;re ces r&eacute;sultats rutilants se cachent parfois des erreurs de mesure grossi&egrave;res. De plus, les gens mettant au point ces bancs sont plus souvent informaticiens qu'&eacute;lectroniciens ou sp&eacute;cialistes en mesure. Ils privil&eacute;gient souvent l'interface au d&eacute;triment de la partie instrumentation ou traitement des r&eacute;sultats (du point de vue math&eacute;matique ou statistique). La plus grande prudence s'impose donc&nbsp;!<P>&nbsp;<LI><H4><A NAME="M21">MISE AU POINT D'UN BANC.</A></H4><P>Mettre au point soi-m&ecirc;me un banc de mesure est par contre quelque chose de passionnant. Il faudra s'armer de patience et de t&eacute;nacit&eacute;, mais le r&eacute;sultat en vaut la chandelle.<P>Si ce banc doit servir &agrave; d'autres utilisateurs, on soignera particuli&egrave;rement la documentation, et notamment la description des traitements effectu&eacute;s, et les limites de validit&eacute; de la pr&eacute;cision annonc&eacute;e.<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="M22">Choix du mat&eacute;riel.</A></FONT></H5><P>Pour toute la partie instrumentation, <A HREF="#M08">revoir ci-dessus</A>. La seule diff&eacute;rence proviendra de l'aptitude des instruments &agrave; &ecirc;tre pilot&eacute;s par ordinateur.<P>On choisira le type de pilotage en fonction des ressources disponibles sur l'ordinateur (carte GPIB, liaison s&eacute;rie disponible, autre carte...) et du flux de donn&eacute;es qu'on aura &agrave; g&eacute;rer (temps r&eacute;el ou pas, fr&eacute;quence d'acquisition &eacute;lev&eacute;e ou faible, un ou plusieurs param&egrave;tres &agrave; mesurer simultan&eacute;ment...).<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="M23">M&eacute;thodologie.</A></FONT></H5><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="M24">Attention aux couplages.</A></FONT></H5><P>Le plus gros probl&egrave;me qu'on rencontrera lors de la mise au point du banc sera d&ucirc; aux ph&eacute;nom&egrave;nes de <A HREF="../PERTU/COURS.HTM#P03" target=_blank>couplage par imp&eacute;dance commune</A>. En effet, tous les appareils composant la cha&icirc;ne de mesure et de traitement sont reli&eacute;s &agrave; la m&ecirc;me masse qui est g&eacute;n&eacute;ralement la terre (ce sont des normes de s&eacute;curit&eacute; impos&eacute;es aux fabricants de mat&eacute;riel de mesure). On sera parfois oblig&eacute;s d'isoler certaines parties de la cha&icirc;ne &agrave; l'aide d'amplis d'isolation ou de <A HREF="../AINST/COURS.HTM#AI07" target=_blank>travailler en diff&eacute;rentiel</A>.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="M25">Cartes d'acquisition.</A></FONT></H5><P>Si on utilise des cartes d'acquisition &agrave; mettre dans l'ordinateur, on se rappellera que celui-ci est un milieu extr&ecirc;mement perturbant&nbsp;: fr&eacute;quences de fonctionnement &eacute;lev&eacute;es, commutation, alimentation &agrave; d&eacute;coupage, ventilateur...<P>Bref, il vaudra mieux pr&eacute;-conditionner les faibles signaux (les amplifier, filtrer et d&eacute;livrer sous faible imp&eacute;dance) avant de les envoyer sur ces cartes d'acquisition.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="M26">Mesures chaud/froid.</A></FONT></H5><P>Si ce banc doit utiliser un &eacute;quipement climatique (enceinte thermique chaud/froid par exemple), on fera tr&egrave;s attention aux ph&eacute;nom&egrave;nes de condensation et de givre. Si on doit faire des mesures &agrave; chaud et &agrave; froid, il faut commencer par le chaud&nbsp;: le mat&eacute;riel test&eacute; va s&eacute;cher convenablement&nbsp;; ensuite, on fera le test &agrave; froid&nbsp;: pas de probl&egrave;me de givre. Ne jamais ouvrir l'enceinte climatique &agrave; froid&nbsp;: givrage instantan&eacute; garanti d&ucirc; &agrave; l'humidit&eacute; de l'air ambiant&nbsp;! Lors d'un retour &agrave; temp&eacute;rature ambiante, ce givre va fondre et "noyer" le montage, provocant des courants de fuite importants, et pouvant endommager certains &eacute;quipements sous test.<P>Il faudra aussi tenir compte de l'hyst&eacute;r&eacute;sis en temp&eacute;rature du mat&eacute;riel test&eacute;, et donc faire un cycle thermique complet avant toute mesure de fa&ccedil;on &agrave; toujours se trouver dans les m&ecirc;mes conditions de mesure. On &eacute;vitera ainsi des &eacute;carts difficiles &agrave; interpr&eacute;ter.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="M27">R&eacute;p&eacute;tabilit&eacute; du banc.</A></FONT></H5><P>C'est un des aspects essentiels de la mise au point du banc&nbsp;: il est &eacute;vident que lorsqu'on mesure deux fois la m&ecirc;me pi&egrave;ce sur un banc, le r&eacute;sultat doit &ecirc;tre le m&ecirc;me. Eh bien une fois de plus, ce n'est pas toujours le cas&nbsp;!<P>L'ordinateur de pilotage va nous &ecirc;tre ici d'un grand secours&nbsp;: il va pouvoir faire seul un grand nombre d'acquisitions du m&ecirc;me param&egrave;tre, et nous aider &agrave; traiter statistiquement les donn&eacute;es.<P>Dans la majorit&eacute; des cas, la distribution des r&eacute;sultats obtenus aura la forme suivante (exemple de mesures d'une r&eacute;sistance)&nbsp;:<P align=center><IMG SRC="MESU.FIG/MESU03.GIF"><P align=center>Fig. 1. Distribution des mesures d'une r&eacute;sistance<P>C'est la loi normale ou loi de Gauss. Elle est enti&egrave;rement caract&eacute;ris&eacute;e par deux param&egrave;tres&nbsp;:<P> - la moyenne, qui est &eacute;gale &agrave; l'abscisse de l'axe de sym&eacute;trie de la courbe&nbsp;: sur l'exemple, c'est 420<IMG SRC="../BASE/ICONES/OHM.GIF">.<P> - l'&eacute;cart type, qui est repr&eacute;sentatif de la dispersion des valeurs. Dans l'exemple donn&eacute;, il est de 5<IMG SRC="../BASE/ICONES/OHM.GIF">.<P>Ces deux param&egrave;tres se calculent &agrave; l'aide de toutes les valeurs obtenues par la mesure.<P>On remarque qu'on a tr&egrave;s peu de mesures en dessous de 405<IMG SRC="../BASE/ICONES/OHM.GIF"> (valeur de la moyenne moins 3 &eacute;carts type) et au dessus de 435<IMG SRC="../BASE/ICONES/OHM.GIF"> (moyenne plus 3 &eacute;carts type).<P>La th&eacute;orie de la loi normale nous dit que la probabilit&eacute; de trouver des valeurs hors de cet intervalle de &#177;3 &eacute;carts type est inf&eacute;rieure &agrave; 3&#137;.<P>Dans la pratique, il faudra faire en sorte que la dispersion des mesures (&agrave; &#177; 3 &eacute;carts type) soit inf&eacute;rieure au dixi&egrave;me de la pr&eacute;cision d&eacute;sir&eacute;e pour faire la mesure.<P>Par exemple, si on veut mesurer des r&eacute;sistances &agrave; &#177;3%, il faudra que l'&eacute;cart type de la mesure soit inf&eacute;rieur ou &eacute;gal &agrave; 0,1% de la valeur de la r&eacute;sistance mesur&eacute;e.<P>Si on reprend l'exemple de la figure 1, la r&eacute;p&eacute;tabilit&eacute; du banc est de &#177;3,5%. Il serait illusoire de pr&eacute;tendre faire des mesures de pr&eacute;cision avec une telle dispersion&nbsp;!<P>Cette notion de r&eacute;p&eacute;tabilit&eacute; est importante surtout pour les &eacute;quipements de test en production&nbsp;: il ne faut pas que l'incertitude de mesure du banc soit importante vis &agrave; vis des tol&eacute;rances des produits mesur&eacute;s. Si tel est le cas, une pi&egrave;ce test&eacute;e plusieurs fois pourra &ecirc;tre tant&ocirc;t bonne, tant&ocirc;t mauvaise. C'est ce que l'on nomme les DNR (d&eacute;fauts non reproductibles). Plus la distribution des mesures est &eacute;troite, moins on aura de DNR.<P><STRONG>Attention</STRONG>&nbsp;: il ne faut pas confondre r&eacute;p&eacute;tabilit&eacute; et pr&eacute;cision. Une mesure peut &ecirc;tre impr&eacute;cise mais tr&egrave;s r&eacute;p&eacute;table : la mesure d'une r&eacute;sistance de 420<IMG SRC="../BASE/ICONES/OHM.GIF"> sur un banc peut &ecirc;tre comprise entre 440 et 440,4<IMG SRC="../BASE/ICONES/OHM.GIF">. La pr&eacute;cision est de +5%, mais la r&eacute;p&eacute;tabilit&eacute; est de 1&#137;.<P>En r&egrave;gle g&eacute;n&eacute;rale, la pr&eacute;cision va &ecirc;tre d&eacute;termin&eacute;e par les caract&eacute;ristiques du capteur et de l'instrument de mesure.<P>La r&eacute;p&eacute;tabilit&eacute; d&eacute;pendra de param&egrave;tres tels que l'hyst&eacute;r&eacute;sis des appareils constituant la cha&icirc;ne, du c&acirc;blage (bruit issu de sources de perturbation ext&eacute;rieures), et encore des tensions de mode commun mal ma&icirc;tris&eacute;es, des r&eacute;sistances de contact fluctuantes et non prises en compte dans la mesure...<P>Il vaut mieux avoir une mesure impr&eacute;cise mais tr&egrave;s r&eacute;p&eacute;table que l'inverse. Les causes d'impr&eacute;cision sont plus faciles &agrave; identifier, et &eacute;ventuellement pourront faire l'objet de compensations par l'informatique de traitement du banc : auto-z&eacute;ro, auto-calibration de la cha&icirc;ne de mesure...<P>Une non r&eacute;p&eacute;tabilit&eacute; d&eacute;note un ou plusieurs param&egrave;tres tr&egrave;s mal ma&icirc;tris&eacute;s. Se lancer dans des mesures &agrave; grande &eacute;chelle dans ces conditions est hasardeux, car des d&eacute;rives suppl&eacute;mentaires sont pr&eacute;visibles.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="M28">En conclusion :</A></FONT></H5><P>On proc&eacute;dera de la m&ecirc;me mani&egrave;re que pour les mesures en mode manuel pour ce qui est du choix des instruments.<P>On se rappellera que l'ordinateur de traitement est perturbant : on ne lui confiera pas de signaux "fragiles" (bas niveau et/ou haute imp&eacute;dance).<P>On apportera un soin particulier &agrave; la r&eacute;p&eacute;tabilit&eacute; des r&eacute;sultats en s'aidant d'outils statistiques. Une mauvaise r&eacute;p&eacute;tabilit&eacute; n'est pas bon signe : la cha&icirc;ne de mesure est mal ma&icirc;tris&eacute;e, et t&ocirc;t ou tard, on va le payer.<P>On soignera d'abord la qualit&eacute; de la mesure, et ensuite, on peaufinera l'aspect informatique (ergonomie, pr&eacute;sentation...). On ne peut faire du bon travail qu'avec des donn&eacute;es saines !</UL></OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="M29">EN PRATIQUE...</A></H3>Toute cette &eacute;num&eacute;ration protocolaire et toutes ces mises en garde vont peut-&ecirc;tre para&icirc;tre superflues, voire rebutantes.<P>Il est clair qu'il s'agit l&agrave; d'un expos&eacute; un peu acad&eacute;mique, et que dans la pratique, on n'aura peut-&ecirc;tre pas le temps ni les moyens de le mettre en &#156;uvre.<P>Il faudra aussi faire le tri en fonction de la difficult&eacute; de la mesure &agrave; faire, et cette aptitude &agrave; savoir faire l'impasse ou non sur telle proc&eacute;dure viendra avec l'exp&eacute;rience ; on ne traitera pas de la m&ecirc;me mani&egrave;re la mesure d'une r&eacute;sistance de 1k<IMG SRC="../BASE/ICONES/OHM.GIF"> et celle d'un courant de fuite voisin du nA &agrave; -30&#176;C...<P>Toutefois, la prudence reste un excellent conseiller du sp&eacute;cialiste en mesure, et il faudra se garder de sous-estimer la difficult&eacute; : des manips paraissant simples &agrave; priori &agrave; un d&eacute;butant pourront en fait &ecirc;tre tr&egrave;s d&eacute;licates.<P>On ne le r&eacute;p&eacute;tera jamais assez : dans tous les cas, on aura int&eacute;r&ecirc;t &agrave; aller consulter les personnes ayant une exp&eacute;rience dans le domaine qu'on va aborder !</OL><BR><BR><BR><A NAME="M30">Note</A> :Technique qui consiste &agrave; faire une matrice d'essais sp&eacute;cifique permettant de voir toutes les influences possibles (y compris les interactions entre les diff&eacute;rents constituants de la cha&icirc;ne) avec un nombre r&eacute;duit d'essai</BODY></HTML>