<HTML><HEAD><TITLE>L'amplificateur d'instrumentation</TITLE></HEAD><BODY><CENTER><IMG SRC="../BASE/ICONES/NAV.GIF"></CENTER><P align=center>Si votre &eacute;cran ne se pr&eacute;sente pas comme ceci, <A HREF="AINST.HTM" target="_top"> cliquez l&agrave; </A><OL TYPE=I><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="AI01">LES MESURES DIFF&Eacute;RENTIELLES.</A></H3><P>On peut se poser la question de ce qui fait la sp&eacute;cificit&eacute; d'une "&nbsp;<STRONG>mesure diff&eacute;rentielle</STRONG>&nbsp;", car <STRONG>toute</STRONG> mesure de tension est par d&eacute;finition diff&eacute;rentielle&nbsp;: il ne faut pas oublier qu'un potentiel absolu n'existe pas, et qu'on a toujours affaire &agrave; une <STRONG>diff&eacute;rence de potentiel.</STRONG><P>Les d&eacute;finitions suivantes vont &eacute;clairer la notion de mesure diff&eacute;rentielle.<OL TYPE=A><P>&nbsp;<LI><H4><A NAME="AI02">D&Eacute;FINITIONS</A></H4><P>On appellera <STRONG>mesure simple</STRONG> une mesure de tension entre deux points dont l'un est la <A HREF="../OUTILS/COURS.HTM#O43" target=_blank>masse</A> du montage de mesure.<P>C'est l&agrave; qu'il faut se rappeler de la d&eacute;finition de la masse&nbsp;: c'est une &eacute;quipotentielle du montage (th&eacute;orique, voir chapitre "&nbsp;<A HREF="../PERTU/COURS.HTM#P08" target=_blank>perturbations dans les mesures</A>&nbsp;"&nbsp;!) qui sert de r&eacute;f&eacute;rence de tension &agrave; ce montage et dont le potentiel absolu est fix&eacute; <STRONG>arbitrairement</STRONG> &agrave; 0V (un potentiel est toujours d&eacute;fini &agrave; une constante pr&egrave;s).<P>Ce potentiel &eacute;tant fix&eacute; arbitrairement, on ne parlera plus de diff&eacute;rence de potentiel pour les autres points du montage, mais simplement de potentiel, sous entendu, diff&eacute;rence de potentiel par rapport &agrave; la masse, le potentiel de cette derni&egrave;re &eacute;tant fix&eacute; astucieusement &agrave; 0V.<P>Une mesure de tension simple est donc en r&eacute;alit&eacute; une mesure diff&eacute;rentielle dont un des points est la masse. Seul nous int&eacute;resse le potentiel de l'autre point, que l'on nomme couramment "&nbsp;point chaud&nbsp;".<P>On appellera <STRONG>mesure diff&eacute;rentielle</STRONG> une mesure de tension entre deux points quelconques d'un circuit, aucun d'entre eux n'&eacute;tant la masse du montage.<P>&nbsp;<LI><H4><A NAME="AI03">MODE COMMUN ET MODE DIFF&Eacute;RENTIEL.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI04">D&eacute;finitions.</A></FONT></H5><P align=center><IMG SRC="AINST.FIG/AINST01.GIF"><P align=center>Fig. 1. Montage amplificateur quelconque.<P>Consid&eacute;rons le montage de la figure 1, &agrave; savoir un amplificateur &agrave; deux entr&eacute;es et une sortie. Dans le cas g&eacute;n&eacute;ral, sa fonction de transfert sera de la forme&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST02.GIF"><P>Par d&eacute;finition, on va appeler <STRONG>tension diff&eacute;rentielle</STRONG> d'entr&eacute;e la valeur&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST03.GIF"><P>De la m&ecirc;me mani&egrave;re, on d&eacute;finit une <STRONG>tension de mode commun</STRONG>&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST04.GIF"><P>On peut voir intuitivement la signification ces d&eacute;finitions&nbsp;: la tension diff&eacute;rentielle est simplement la diff&eacute;rence des deux signaux&nbsp;; la tension de mode commun est la moyenne arithm&eacute;tique des deux signaux.<P>Tout se passe comme si on rempla&ccedil;ait les deux signaux e<SUB>1</SUB> et e<SUB>2</SUB> par un signal commun (la moyenne) additionn&eacute; des variations autour de ce signal commun (la diff&eacute;rence).<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI05">Fonction de transfert d'un ampli diff&eacute;rentiel.</A></FONT></H5><P>Reprenons l'&eacute;quation [1], donnant la fonction de transfert de l'ampli de la figure 1. Nous allons mettre cette &eacute;quation sous la forme suivante&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST05.GIF"><P>Pour ce faire, il suffit de proc&eacute;der &agrave; un changement de variables&nbsp;; on groupe dans l'&eacute;quation [4] les termes en e<SUB>1</SUB> et e<SUB>2</SUB>, et comme les &eacute;quations [1] et [4] doivent &ecirc;tre &eacute;quivalentes pour toutes les valeurs de e<SUB>1</SUB> et e<SUB>2</SUB>, on identifie leurs coefficients entre les 2 &eacute;quations &nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST06.GIF"><P>La r&eacute;solution du syst&egrave;me donne le r&eacute;sultat suivant&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST07.GIF"><P>Au final, on retrouve&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST08.GIF"><P>La formulation [4] est particuli&egrave;rement int&eacute;ressante, car elle met en &eacute;vidence deux termes, l'un proportionnel &agrave; la tension diff&eacute;rentielle (le gain diff&eacute;rentiel du montage A<SUB>Vd</SUB>), et l'autre proportionnel &agrave; la tension de mode commun (le gain de mode commun A<SUB>VMc</SUB>).<P><A NAME="AIE8">On</A> peut formuler plus simplement cette &eacute;quation, qui est la fonction de transfert g&eacute;n&eacute;rale d'un amplificateur de diff&eacute;rence&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST09.GIF"></OL><P>&nbsp;<LI><H4><A NAME="AI06">N&Eacute;CESSIT&Eacute; D'UNE MESURE DIFF&Eacute;RENTIELLE.</A></H4><P>Si certaines mesures diff&eacute;rentielles servent uniquement &agrave; am&eacute;liorer la pr&eacute;cision d'une mesure (notamment en &eacute;vitant des <A HREF="../PERTU/COURS.HTM#P03" target=_blank>couplages par imp&eacute;dance commune</A>), d'autres pr&eacute;sentent un caract&egrave;re obligatoire, car dans ces cas l&agrave;, une mesure simple est impossible. Nous allons &eacute;tudier ces deux cas de figure.<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI07">Rem&egrave;de &agrave; un couplage par imp&eacute;dance commune.</A></FONT></H5><P align=center><IMG SRC="AINST.FIG/AINST10.GIF"><P align=center>Fig. 2. Mesure simple sur shunt.<P>Nous avons vu au chapitre "&nbsp;<A HREF="../PERTU/COURS.HTM#P10" target=_blank>perturbations dans les mesures</A>&nbsp;" l'effet d'une mesure simple sur un shunt travers&eacute; par un fort courant. Nous supposerons ici que l'amplificateur repr&eacute;sent&eacute; sur les figures 2 et 3 est une partie d'un appareil de mesure dont la masse est reli&eacute;e &agrave; la terre.<P>Sur la figure 2, les masses M<SUB>m</SUB> du montage et M<SUB>a</SUB> de l'amplificateur ne sont pas au m&ecirc;me potentiel, car le courant parasite circulant dans R<SUB>cbl</SUB> cr&eacute;&eacute; une chute de tension qui va s'additionner &agrave; la tension &agrave; mesurer et la fausser.<P>Il est possible de r&eacute;soudre ce probl&egrave;me par une mesure diff&eacute;rentielle&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST11.GIF"><P align=center>Fig. 3. Mesure diff&eacute;rentielle sur shunt.<P> La figure 3 diff&egrave;re de la figure 2 par la structure de l'amplificateur&nbsp;: il est ici mont&eacute; en diff&eacute;rentiel, et va mesurer la diff&eacute;rence de potentiel pr&eacute;sente aux bornes du shunt. La tension parasite aux bornes de R<SUB>cbl</SUB> ne g&ecirc;ne en rien la mesure (dans le cas d'un amplificateur parfait&nbsp;!), car elle augmente (l&eacute;g&egrave;rement) uniquement la tension de mode commun vue par l'amplificateur, elle ne change en rien la tension diff&eacute;rentielle qui reste celle aux bornes du shunt, quoiqu'il arrive.<P>Nous avons donc r&eacute;solu ici le probl&egrave;me de perturbation par imp&eacute;dance commune sans rendre flottant quelque appareil que ce soit. Le montage est ainsi pr&eacute;cis et s&ucirc;r.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI08">Mesure de tension entre deux points flottants.</A></FONT></H5><P>Il existe un autre type de mesures n&eacute;cessitant obligatoirement une mesure diff&eacute;rentielle&nbsp;: c'est lorsqu'on veut mesurer une tension entre deux points dont aucun n'est la masse. Il est &eacute;videmment hors de question de brancher un de ces deux points &agrave; la masse d'un instrument de mesure (&agrave; l'exception notable des multim&egrave;tres aliment&eacute;s par piles ou accus) sous peine de cr&eacute;er des courts circuits f&acirc;cheux&nbsp;!<P align=center><IMG SRC="AINST.FIG/AINST12.GIF"><P align=center>Fig. 4. Mesure sur shunt flottant.<P>L'exemple de la figure 4 montre quasiment la m&ecirc;me chose que celui de la figure 3 mis &agrave; part le fait que le shunt n'est plus reli&eacute; &agrave; la masse.<P>La mise &agrave; la masse d'une des bornes du shunt entra&icirc;nerait la mise en court-circuit d'une partie du montage &eacute;lectronique, ce qui entra&icirc;nerait des dysfonctionnements, voire sa destruction, et pourrait d&eacute;t&eacute;riorer l'instrument de mesure.<P>En instrumentation, une cat&eacute;gorie tr&egrave;s r&eacute;pandue de mesures "&nbsp;flottantes&nbsp;" est celle du d&eacute;s&eacute;quilibre d'un pont de jauges (voir figure 5). Celui-ci est compos&eacute; de 4 r&eacute;sistances identiques qui vont l&eacute;g&egrave;rement varier sous l'effet d'un param&egrave;tre physique &agrave; mesurer (pression, contrainte...). Il appara&icirc;t une tension entre les bornes du pont qu'il va falloir amplifier.<P>Une des caract&eacute;ristiques importantes de ce montage est la tension de mode commun&nbsp;: elle est &eacute;gale &agrave; la moiti&eacute; de la tension d'alimentation, soit quelques volts. Cette tension de mode commun est beaucoup plus grande que le signal utile (quelques mV et parfois moins), et va perturber notablement la mesure.<A NAME="AIF5"><P align=center><IMG SRC="AINST.FIG/AINST13.GIF"></A><P align=center>Fig. 5. Mesure en pont.</OL><P>&nbsp;<LI><H4><A NAME="AI09">L'AMPLI DIFF&Eacute;RENTIEL SIMPLE ET SES D&Eacute;FAUTS.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI10">R&eacute;jection du mode commun.</A></FONT></H5><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI11">Amplificateur parfait.</A></FONT></H5><P>Reprenons l'exemple pr&eacute;c&eacute;dent de la mesure en pont (Fig.&nbsp;5.), et calculons la tension de sortie V<SUB>s</SUB> en fonction de e<SUB>1</SUB> et e<SUB>2</SUB> qui sont les tensions d'entr&eacute;e du montage diff&eacute;rentiel (par rapport &agrave; la masse), et des param&egrave;tres de ce montage.<P>Nous allons consid&eacute;rer que l'amplificateur op&eacute;rationnel est parfait, et aura les caract&eacute;ristiques suivantes&nbsp;:<P> - gain en tension diff&eacute;rentiel infini.<P> - gain de mode commun nul.<P> - imp&eacute;dances d'entr&eacute;e infinies.<P>Si on tient compte de ces hypoth&egrave;ses, les tensions v<SUB>+</SUB> et v<SUB>-</SUB> &agrave; l'entr&eacute;e de l'ampli sont &eacute;gales &agrave;&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST14.GIF"><P align=center><IMG SRC="AINST.FIG/AINST15.GIF"><P>Cette derni&egrave;re &eacute;quation est obtenue &agrave; l'aide du th&eacute;or&egrave;me de superposition.<P>L'ampli &eacute;tant parfait, on a v<SUB>+</SUB> = v<SUB>-</SUB> (gain infini). On en d&eacute;duit facilement la valeur de la tension de sortie&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST16.GIF"><P align=center><IMG SRC="AINST.FIG/AINST17.GIF"><P>Si on pose&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST18.GIF"><P>en substituant A<SUB>Vdo</SUB> &agrave; sa valeur dans [12] et compte tenu de la propri&eacute;t&eacute; suivante&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST19.GIF"><P>on obtient&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST20.GIF"><P>C'est le r&eacute;sultat classique d'un amplificateur op&eacute;rationnel mont&eacute; en diff&eacute;rentiel. Il est obtenu en consid&eacute;rant que l'ampli est parfait, et que les r&eacute;sistances sont rigoureusement appari&eacute;es (&eacute;quation [13]).<P>Nous allons voir maintenant, toujours en consid&eacute;rant que l'amplificateur op&eacute;rationnel est parfait, quel est l'impact de r&eacute;sistances mal appari&eacute;es sur le r&eacute;sultat.<P>Nous supposerons que toutes les r&eacute;sistances R<SUB>1</SUB> &agrave; R<SUB>4</SUB> sont d&eacute;finies &agrave; une tol&eacute;rance pr&egrave;s. On a&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST21.GIF"><P>o&ugrave; R<SUB>in</SUB> est la valeur nominale de la r&eacute;sistance et e la tol&eacute;rance autour de cette valeur nominale (ex&nbsp;: &#177;5%).<P>On admettra que l'erreur maximale a lieu pour&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST22.GIF"><P>On peut d&eacute;finir les deux coefficients suivants&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST23.GIF"><P align=center><IMG SRC="AINST.FIG/AINST24.GIF"><P>On remarquera que les derni&egrave;res formulations de k<SUB>1</SUB> et k<SUB>2</SUB> sont des approximations valables uniquement si e est petit. En pratique, e ne d&eacute;passera pas 5%, donc, cette hypoth&egrave;se est justifi&eacute;e. L'&eacute;quation [12] devient alors&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST25.GIF"><P>Cette formulation est un cas particulier de l'&eacute;quation [1]. Ce qui nous int&eacute;resse, ce sont les valeurs de A<SUB>Vd</SUB> et AVMC (&eacute;quation [6]) correspondantes&nbsp;en fonction de k<SUB>1</SUB> et k<SUB>2</SUB>&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST26.GIF"><P align=center><IMG SRC="AINST.FIG/AINST27.GIF"><P>qu'on peut mettre sous la forme condens&eacute;e&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST28.GIF"><P align=center><IMG SRC="AINST.FIG/AINST29.GIF"><P>On peut encore expliciter ces expressions en reprenant les valeurs de k<SUB>1</SUB> et k<SUB>2</SUB> des &eacute;quations [18] et [19]. Le gain diff&eacute;rentiel devient&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST30.GIF"><P align=center><IMG SRC="AINST.FIG/AINST31.GIF"><P>Le terme 4e<SUP>2</SUP> est un terme du deuxi&egrave;me ordre&nbsp;: on va le n&eacute;gliger devant les termes en e, d'o&ugrave;&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST32.GIF"><P>Si on divise tout par (1+A<SUB>Vdo</SUB>), et qu'on tient compte du fait que e &lt;&lt; 1, on arrive au r&eacute;sultat suivant&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST33.GIF"><P>Si dans ce r&eacute;sultat, on fait e = 0, on retrouve A<SUB>Vd</SUB> = A<SUB>Vdo</SUB>. Dans le cas g&eacute;n&eacute;ral, l'erreur relative commise sur le gain diff&eacute;rentiel variera de e pour un gain A<SUB>Vdo</SUB> = 1 &agrave; 2e pour un gain tr&egrave;s &eacute;lev&eacute;. Il faut se rappeler que cette erreur est l'erreur maxi, obtenue avec les r&eacute;sistances agenc&eacute;es de la pire fa&ccedil;on.<P>Le gain de mode commun est plus simple &agrave; &eacute;valuer&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST34.GIF"><P align=center><IMG SRC="AINST.FIG/AINST35.GIF"><P align=center><IMG SRC="AINST.FIG/AINST36.GIF"><P>On retrouve un gain de mode commun nul pour une erreur e nulle. Ce gain varie dans le cas g&eacute;n&eacute;ral de 2e pour un gain diff&eacute;rentiel nominal A<SUB>Vdo</SUB> &eacute;gal &agrave; 1, &agrave; 4e pour un gain diff&eacute;rentiel &eacute;lev&eacute;. Il reste faible, de l'ordre de grandeur de e, mais si on se r&eacute;f&egrave;re &agrave; ce qui a &eacute;t&eacute; dit <A HREF="#AI08">plus haut</A>, il va amplifier la tension de mode commun, qui peut &ecirc;tre, elle, beaucoup plus grande que la tension diff&eacute;rentielle.<P>La tension de sortie est donn&eacute;e par l'&eacute;quation <A HREF="#AIE8">[8]</A> qui fait intervenir les gains et tensions diff&eacute;rentiels et de mode commun. On peut introduire ici la notion de taux de r&eacute;jection de mode commun (TRMC, CMRR en Anglais, pour Common Mode Rejection Ratio)&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST37.GIF"><P><A NAME="AIE33">A</A> l'aide de ce terme, on peut expliciter l'&eacute;quation <A HREF="#AIE8">[8]</A> de la fa&ccedil;on suivante&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST38.GIF"><P>Cette formulation est tr&egrave;s int&eacute;ressante, car elle donne la tension de sortie en fonction du gain diff&eacute;rentiel et de la tension diff&eacute;rentielle augment&eacute;e d'un signal d'erreur. Ce signal est &eacute;gal &agrave; la tension de mode commun divis&eacute; par le taux de r&eacute;jection de mode commun, qui sont deux donn&eacute;es connues ou ais&eacute;ment calculables.<P>Si on reprend les &eacute;quations [28] et [31], la valeur du TRMC devient&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST39.GIF"><P align=center><IMG SRC="AINST.FIG/AINST40.GIF"><A NAME="AIE36"><P align=center><IMG SRC="AINST.FIG/AINST41.GIF"></A><P>On constate que le TRMC va augmenter quand la tol&eacute;rance sur les r&eacute;sistances va se resserrer, et de plus, il va augmenter avec le gain diff&eacute;rentiel A<SUB>Vdo</SUB> de l'&eacute;tage. Ce r&eacute;sultat est important, car il montre que le plus mauvais cas sera celui du gain unit&eacute;.<P><STRONG><A NAME="AIAN1">Application num&eacute;rique</A></STRONG>&nbsp;: reprenons l'exemple de la <A HREF="#AIF5">figure 5</A> avec les donn&eacute;es suivantes&nbsp;:<P> - A<SUB>Vd</SUB> = 1000<P> - e<SUB>1</SUB> - e<SUB>2</SUB> = 2 mV<P> - E = 10V<P> - r&eacute;sistances R<SUB>1</SUB> &agrave; R<SUB>4</SUB> &agrave; 1%<P>On peut calculer le TRMC &agrave; l'aide de l'&eacute;quation[36]&nbsp;: TRMC = 25025, soit 88dB.<P>La tension de mode commun est &eacute;gale &agrave; la moiti&eacute; de la tension d'alimentation, soit 5V, ce qui nous fait un signal d'erreur ramen&eacute; &agrave; la tension diff&eacute;rentielle &eacute;gal &agrave; 0,2mV, soit 10% du signal utile&nbsp;!<P>On peut am&eacute;liorer le montage en augmentant la pr&eacute;cision des r&eacute;sistances, mais cela va devenir difficile avec des composants discrets. De plus, l'amplificateur n'est pas parfait&nbsp;: il poss&egrave;de son propre TRMC, qui va perturber la mesure m&ecirc;me si les r&eacute;sistances sont parfaitement appari&eacute;es.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI12">Amplificateur r&eacute;el.</A></FONT></H5><P>Les constructeurs de circuits int&eacute;gr&eacute;s donnent la valeur du TRMC pour leurs amplificateurs op&eacute;rationnels, et fournissent aussi g&eacute;n&eacute;ralement une courbe de Bode qui repr&eacute;sente ce taux de r&eacute;jection en fonction de la fr&eacute;quence (fig. 6 et 7).<P align=center><IMG SRC="AINST.FIG/AINST411.GIF"><P align=center>Fig. 6. TRMC amplis LF 155/6/7. (Doc. NS).<P align=center><IMG SRC="AINST.FIG/AINST412.GIF"><P align=center>Fig. 7. TRMC amplis LM 118. (Doc. NS).<P>Il est possible de calculer le TRMC global d'un montage diff&eacute;rentiel en tenant compte de la tol&eacute;rance des r&eacute;sistances et du TRMC propre de l'ampli. Il faut pour cela reprendre les &eacute;quations <A HREF="#AI11">[9]</A> et <A HREF="#AI11">[10]</A> et prendre pour V<SUB>s</SUB> une formulation telle que celle donn&eacute;e en <A HREF="#AIE8">[8]</A>. Apr&egrave;s une s&eacute;rie de calculs laborieux, on arrive au r&eacute;sultat suivant&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST42.GIF"><P><STRONG><EM>Attention&nbsp;!</EM></STRONG> Le TRMC de l'ampli est g&eacute;n&eacute;ralement donn&eacute; en dB. Il faut le convertir (ex : 80dB = 10 000) avant de l'injecter dans l'&eacute;quation [37]&nbsp;!<STRONG><EM><P></EM></STRONG><STRONG><EM>Discussion</EM></STRONG><P>Si on fait e = 0 dans cette &eacute;quation, on obtient pour le TRMC global du montage le TRMC intrins&egrave;que de l'ampli.<P>Si on fait tendre le TRMC de l'ampli vers l'infini, on retrouve logiquement le r&eacute;sultat obtenu avec un ampli parfait (&eacute;quation <A HREF="#AIE36">[36]</A>).<P>Le TRMC du montage sera de toutes fa&ccedil;ons inf&eacute;rieur au plus petit des 2 TRMC pris s&eacute;par&eacute;ment, &agrave; savoir celui de l'ampli et celui d&ucirc; au mauvais appariement des r&eacute;sistances.<P>Si on reprend l'application num&eacute;rique <A HREF="#AIAN1">pr&eacute;c&eacute;dente</A>, et qu'on consid&egrave;re que l'ampli utilis&eacute; a un TRMC intrins&egrave;que de 90dB, l'&eacute;quation [37] nous donne un TRMC global de 14000, ou 83dB (-5dB dus &agrave; l'ampli), ce qui fait une erreur de 0,36mV, soit 18% du signal utile &agrave; amplifier&nbsp;!</UL><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI13">Imp&eacute;dance d'entr&eacute;e.</A></FONT></H5><P>De ce point de vue, le montage diff&eacute;rentiel simple est fortement dissym&eacute;trique&nbsp;; les imp&eacute;dances des entr&eacute;es + et - ne sont pas &eacute;gales, ce qui va nuire &agrave; une bonne pr&eacute;cision, et surtout, risque de perturber le capteur&nbsp;: en effet, les courants qui vont sortir des deux bornes de sortie du capteur (dans le cas o&ugrave; celui-ci n'est pas un dip&ocirc;le, ce qui est vrai pour un pont de jauges) vont &ecirc;tre diff&eacute;rents&nbsp;; comme les imp&eacute;dances des deux sorties du capteur sont &eacute;gales, il va en r&eacute;sulter des chutes de tension diff&eacute;rentes, ce qui va g&eacute;n&eacute;rer un signal d'erreur suppl&eacute;mentaire. <P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI14">Ajustage du gain.</A></FONT></H5><P>Ce montage poss&egrave;de un troisi&egrave;me inconv&eacute;nient&nbsp;: m&ecirc;me si on r&eacute;ussit &agrave; apparier convenablement les r&eacute;sistances pour obtenir un bon TRMC, si on veut modifier le gain de l'ampli, tout est &agrave; refaire&nbsp;: il faut changer deux r&eacute;sistances &agrave; la fois et les apparier... Il serait plus commode de n'avoir qu'un composant &agrave; changer.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI15">Conclusion.</A></FONT></H5><P>Ce montage diff&eacute;rentiel classique va donc &ecirc;tre handicap&eacute; par la qualit&eacute; de l'ampli utilis&eacute; (son TRMC), et la dispersion in&eacute;vitable des r&eacute;sistances qui l'entourent.<P>Les imp&eacute;dances des deux entr&eacute;es sont dissym&eacute;triques, ce qui va cr&eacute;er un d&eacute;s&eacute;quilibre f&acirc;cheux au niveau du capteur en pont de jauges. Ce montage est difficilement ajustable.<P>Pour des mesures d&eacute;licates, il va donc falloir trouver un montage ayant une meilleure r&eacute;jection de mode commun, des imp&eacute;dances d'entr&eacute;e &eacute;gales et &eacute;lev&eacute;es, et si possible, des possibilit&eacute;s d'ajustage simplifi&eacute;.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI16">Le montage &agrave; &eacute;viter...</A></FONT></H5><P>Pour les forts gains, le plus gros probl&egrave;me qu'on va rencontrer sur un montage diff&eacute;rentiel simple est la faiblesse des imp&eacute;dances d'entr&eacute;e.<P>Il existe un montage dit "&nbsp;potentiom&egrave;trique&nbsp;" qui permet de r&eacute;soudre ce probl&egrave;me, et de plus, autorise l'ajustage du gain avec une seule r&eacute;sistance&nbsp;!<P>Le gain est obtenu en c&acirc;blant la contre r&eacute;action d'un ampli diff&eacute;rentiel simple non pas directement sur la sortie, mais sur un pont diviseur R<SUB>1</SUB>/R<SUB>2</SUB> plac&eacute; sur la sortie, ce qui aura pour effet de multiplier le gain par le rapport des r&eacute;sistances du pont diviseur.<P>Le montage diff&eacute;rentiel simple peut donc avoir un gain de 1, et les r&eacute;sistances R pourront &ecirc;tre de forte valeur (quelques M<IMG SRC="../BASE/ICONES/OHM.GIF">), ce qui donnera une forte imp&eacute;dance d'entr&eacute;e au montage. Le gain s'ajustera simplement en faisant varier R<SUB>2</SUB>.<P align=center><IMG SRC="AINST.FIG/AINST43.GIF"><P align=center>Fig. 8. Montage potentiom&eacute;trique.<P><STRONG>Mais attention</STRONG>&nbsp;!!! Ce montage n'est pas adapt&eacute; &agrave; l'instrumentation, car les variations des composants (tol&eacute;rance initiale, d&eacute;rive thermique, vieillissement...) sont multipli&eacute;es par le gain&nbsp;: il est donc particuli&egrave;rement instable.<P>Il ne faut toutefois pas jeter ce sch&eacute;ma aux orties&nbsp;: pour des applications ne n&eacute;cessitant pas trop de pr&eacute;cision, il peut donner une r&eacute;ponse simple, efficace et &agrave; faible co&ucirc;t.</OL></OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="AI17">L'AMPLI D'INSTRUMENTATION.</A></H3><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="AI18">D&Eacute;FINITION.</A></H4><P>Les amplificateurs d'instrumentation ne sont pas des amplificateurs op&eacute;rationnels. Ce sont des circuits complets associant plusieurs amplificateurs op&eacute;rationnels et les composants n&eacute;cessaires &agrave; leur bon fonctionnement&nbsp;: r&eacute;sistances, capacit&eacute;s de compensation...<P>Ces amplificateurs peuvent &ecirc;tre fabriqu&eacute;s &agrave; l'aide d'&eacute;l&eacute;ments discrets, mais la plupart du temps, on leur pr&eacute;f&eacute;rera des amplis int&eacute;gr&eacute;s, se pr&eacute;sentant sous la m&ecirc;me forme que des amplificateurs op&eacute;rationnels.<P>Ces composants int&eacute;gr&eacute;s auront plusieurs avantages sur les montages &agrave; &eacute;l&eacute;ments discrets&nbsp;:<P> - simplicit&eacute; de mise en &#156;uvre.<P> - nombre de composants limit&eacute;.<P> - tr&egrave;s grande pr&eacute;cision, due notamment &agrave; un ajustage par laser des r&eacute;sistances sur la puce. Ce proc&eacute;d&eacute; va permettre d'apparier les composants de bien meilleure fa&ccedil;on qu'avec des composants discrets, et autorisera des TRMC beaucoup plus &eacute;lev&eacute;s.<P> - fonctions annexes&nbsp;: r&eacute;glage simple du gain, circuit de garde, conversion tension/courant en sortie...<P>Les amplis d'instrumentation se distinguent notamment des amplificateurs op&eacute;rationnels par le fait qu'ils ont un gain "&nbsp;faible&nbsp;" compar&eacute; &agrave; ces derniers (de 1 &agrave; 1000 contre 10<SUP>6</SUP> et plus), et qu'ils s'utilisent sans contre r&eacute;action.<P>Il existe aujourd'hui des amplificateurs op&eacute;rationnels de tr&egrave;s grande pr&eacute;cision, pr&eacute;sentant des caract&eacute;ristiques proches de celles des amplis d'instrumentation (tensions et courants de d&eacute;calage d'entr&eacute;e, TRMC, imp&eacute;dance d'entr&eacute;e...).<P>Quand on choisira un ampli d'instrumentation dans un catalogue de fabricant de silicium, on veillera &agrave; ne pas confondre les deux types de composants.<P>On pourra &ecirc;tre tent&eacute;s de fabriquer un ampli d'instrumentation avec ces amplificateurs op&eacute;rationnels sp&eacute;ciaux&nbsp;; dans certains cas (besoin de rapidit&eacute;, TRMC &eacute;lev&eacute; &agrave; haute fr&eacute;quence...), on pourra y gagner, mais il ne faudra pas oublier qu'il sera n&eacute;cessaire d'apparier les r&eacute;sistances de fa&ccedil;on tr&egrave;s "&nbsp;serr&eacute;e&nbsp;".<P>&nbsp;<LI><H4><A NAME="AI19">SCH&Eacute;MA &Agrave; DEUX AMPLIFICATEURS.</A></H4><P align=center><IMG SRC="AINST.FIG/AINST44.GIF"><P align=center>Fig. 9. Montage diff&eacute;rentiel &agrave; deux amplis.<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI20">Imp&eacute;dance d'entr&eacute;e.</A></FONT></H5><P>Par rapport &agrave; l'amplificateur diff&eacute;rentiel simple, ce montage est tr&egrave;s am&eacute;lior&eacute; du point de vue des imp&eacute;dances d'entr&eacute;e&nbsp;: elles sont &eacute;gales et de grande valeur (imp&eacute;dance d'entr&eacute;e des amplis-op, soit &gt;10<SUP>6</SUP> <IMG SRC="../BASE/ICONES/OHM.GIF">).<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI21">Gain en tension. Ajustage.</A></FONT></H5><P>Pour simplifier le raisonnement, on peut consid&eacute;rer le montage comme &eacute;tant la concat&eacute;nation de deux amplis&nbsp;:<P> - le premier (1) est un montage non inverseur qui va amplifier la tension e<SUB>2</SUB>.<P> - le deuxi&egrave;me (2) est un montage soustracteur qui va amplifier la diff&eacute;rence entre la tension e<SUB>1</SUB> et la tension de sortie V<SUB>s1</SUB> de l'ampli 1.<P>On a&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST45.GIF"><P align=center><IMG SRC="AINST.FIG/AINST46.GIF"><P>En rempla&ccedil;ant V<SUB>s1</SUB> par sa valeur (&eacute;quation [38]) dans [39], et en posant A<SUB>Vdo</SUB> = k+1 on obtient&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST47.GIF"><P>Du point de vue du r&eacute;glage, ce montage n'apporte rien de plus que le montage diff&eacute;rentiel simple&nbsp;: il faut toujours changer deux composants pour le faire varier.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI22">R&eacute;jection de mode commun.</A></FONT></H5><P>On peut refaire un calcul strictement analogue &agrave; celui fait pour le montage diff&eacute;rentiel simple. On va retrouver un r&eacute;sultat similaire (quoique tr&egrave;s l&eacute;g&egrave;rement diff&eacute;rent)&nbsp;: le TRMC sera &eacute;gal &agrave;&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST48.GIF"><P>Le r&eacute;sultat est l&eacute;g&egrave;rement diff&eacute;rent de celui trouv&eacute; pour le montage diff&eacute;rentiel simple (&eacute;quation <A HREF="#AIE36">[36]</A>), mais l'ordre de grandeur reste le m&ecirc;me.<P>Ce montage est encore plus d&eacute;favorable dans le cas du gain unit&eacute;&nbsp;: le TRMC sera &eacute;gal &agrave; 1/4e contre 1/2e dans le montage diff&eacute;rentiel simple. <P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI23">Conclusion.</A></FONT></H5><P>Ce montage est int&eacute;ressant du point de vue des imp&eacute;dances d'entr&eacute;e, mais il n'apporte rien par rapport au montage pr&eacute;c&eacute;dent pour ce qui est du mode commun et de la facult&eacute; d'ajustage&nbsp;: il faut apparier les composants de la m&ecirc;me mani&egrave;re pour obtenir un bon TRMC, et il faut changer deux composants pour ajuster le gain.<P>Toutefois, si on d&eacute;sire un &eacute;tage &agrave; gain fixe et &eacute;lev&eacute;, et qu'on soit capable d'apparier les r&eacute;sistances avec une pr&eacute;cision suffisante, on peut obtenir un montage correct, ayant une imp&eacute;dance d'entr&eacute;e &eacute;lev&eacute;e, et un TRMC de l'ordre de 90dB, ce qui est suffisant pour bon nombre d'applications en instrumentation.</OL><P>&nbsp;<LI><H4><A NAME="AI24">SCH&Eacute;MA &Agrave; TROIS AMPLIFICATEURS.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI25">Premier &eacute;tage</A></FONT></H5><P align=center><IMG SRC="AINST.FIG/AINST49.GIF"><P align=center>Fig. 10. 1er &eacute;tage diff&eacute;rentiel &agrave; deux amplis.<P>La mise en &eacute;quation est tr&egrave;s simple&nbsp;; on va encore utiliser le fait que les entr&eacute;es v<SUB>+</SUB> et v<SUB>-</SUB> des amplis sont &eacute;gales, et que les imp&eacute;dances d'entr&eacute;es sont infinies.<P>Le courant circulant dans r et dans les deux r&eacute;sistances R sera donc le m&ecirc;me, ce qui permet d'&eacute;crire&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST50.GIF"><P align=center><IMG SRC="AINST.FIG/AINST51.GIF"><P align=center><IMG SRC="AINST.FIG/AINST52.GIF"><P>La tension de mode commun &agrave; l'entr&eacute;e du montage est&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST53.GIF"><P>D'autre part, le mode commun en sortie vaut&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST54.GIF"><P>On peut calculer les valeurs de V<SUB>s1</SUB> et V<SUB>s2</SUB> facilement&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST55.GIF"><P align=center><IMG SRC="AINST.FIG/AINST56.GIF"><P><A NAME="AIE49">On</A> en d&eacute;duit la valeur de la tension de mode commun en sortie V<SUB>MCs</SUB>&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST57.GIF"><P><A NAME="AIF11">Pour</A> mieux voir le ph&eacute;nom&egrave;ne, on peut aussi raisonner sur une "&nbsp;&eacute;chelle des potentiels croissants&nbsp;"&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST58.GIF"><P align=center>Fig. 11. &Eacute;chelle des potentiels.<P>L'axe des x n'est pas vraiment un axe&nbsp;; il repr&eacute;sente la r&eacute;f&eacute;rence de potentiel du montage. Le mode commun &eacute;tant &eacute;gal &agrave; (e<SUB>1</SUB>+e<SUB>2</SUB>)/2, il va arriver au niveau de "&nbsp;la moiti&eacute;&nbsp;" de la r&eacute;sistance r. Les deux sorties des amplis vont voir leur potentiel augmenter (V<SUB>s1</SUB>, ampli 1) et diminuer (V<SUB>s2</SUB>, ampli 2) sym&eacute;triquement par rapport &agrave; ce potentiel (si les deux r&eacute;sistances R sont &eacute;gales), car le courant circulant dans les trois r&eacute;sistances est le m&ecirc;me.<P>Il faut noter ici que si les amplis sont aliment&eacute;s sym&eacute;triquement par rapport &agrave; la masse, rien n'emp&ecirc;che V<SUB>s2</SUB> d'&ecirc;tre n&eacute;gatif, et ceci sans que le raisonnement ne change.<P>Sur ce graphique, il appara&icirc;t donc clairement que le potentiel de mode commun est le m&ecirc;me &agrave; l'entr&eacute;e et &agrave; la sortie du montage. On peut se poser la question de l'utilit&eacute; de ce dernier...<P>En fait, il faut remarquer que si la tension de mode commun n'a pas boug&eacute;, la tension diff&eacute;rentielle (le signal utile) a &eacute;t&eacute; amplifi&eacute;e du facteur (2R+r)/r, qui peut &ecirc;tre tr&egrave;s &eacute;lev&eacute;. Tout se passe comme si la tension de mode commun avait &eacute;t&eacute; divis&eacute;e (relativement au signal utile) par le gain de l'&eacute;tage.<P>Pour rendre ce montage utilisable, il va falloir se d&eacute;barrasser du mode commun, et r&eacute;f&eacute;rencer le signal de sortie V<SUB>sd</SUB> &agrave; la masse. On va le faire tr&egrave;s simplement en ajoutant un montage diff&eacute;rentiel classique en sortie du premier &eacute;tage.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI26">Montage complet</A></FONT></H5><P align=center><IMG SRC="AINST.FIG/AINST59.GIF"><P align=center>Fig. 12. Montage diff&eacute;rentiel &agrave; trois amplis.<P>Attention au c&acirc;blage de l'ampli diff&eacute;rentiel de sortie&nbsp;!!! Il est tel qu'on va amplifier la diff&eacute;rence e<SUB>1</SUB> - e<SUB>2</SUB> .<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI27">Imp&eacute;dance d'entr&eacute;e.</A></FONT></H5><P>Le capteur voit deux entr&eacute;es d'amplificateurs op&eacute;rationnels (qui seront de pr&eacute;f&eacute;rence appari&eacute;s&nbsp;: on choisira un bo&icirc;tier contenant deux ou quatre amplificateurs), soit une imp&eacute;dance &eacute;lev&eacute;e et constante.<P>Le deuxi&egrave;me est attaqu&eacute; par les sorties des amplis du premier &eacute;tage, qui sont tr&egrave;s faibles (&lt;1<IMG SRC="../BASE/ICONES/OHM.GIF">)&nbsp;: m&ecirc;me si les imp&eacute;dances des deux entr&eacute;es sont faibles et de valeurs diff&eacute;rentes, cela n'aura pas d'incidence sur le r&eacute;sultat.<P>Du point de vue des imp&eacute;dances d'entr&eacute;e, notre montage est (presque) id&eacute;al&nbsp;!<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI28">Gain en tension. Ajustage.</A></FONT></H5><P>Si A<SUB>Vd2</SUB> est le gain diff&eacute;rentiel du deuxi&egrave;me &eacute;tage, on va avoir, pour le montage global&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST60.GIF"><P>On remarque qu'il est tr&egrave;s simple de faire varier ce gain en modifiant uniquement la r&eacute;sistance r. Ce montage est donc meilleur que les deux premiers pour ce crit&egrave;re.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI29">R&eacute;jection de mode commun.</A></FONT></H5><P>Nous avons vu que le premier &eacute;tage laissait intacte la tension de mode commun (&eacute;quation <A HREF="#AIE49">[49]</A>).<P>Regardons ce qui se passe au niveau du deuxi&egrave;me &eacute;tage. Nous avons affaire &agrave; un &eacute;tage diff&eacute;rentiel simple&nbsp;: on va utiliser les r&eacute;sultats obtenus<A HREF="#AI10"> plus haut</A>.<P>En transposant l'&eacute;quation <A HREF="#AIE33">[33]</A> &agrave; notre montage, on obtient&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST61.GIF"><P>o&ugrave; A<SUB>Vd2</SUB> est le gain du deuxi&egrave;me &eacute;tage et TRMC<SUB>2</SUB> son taux de r&eacute;jection de mode commun global (ampli et tol&eacute;rance des composants).<P>Si on remplace (V<SUB>s1</SUB> - V<SUB>s2</SUB>) = V<SUB>sd</SUB> par sa valeur (&eacute;quation [44]), et en posant&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST62.GIF"><P>on trouve&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST63.GIF"><P>On retrouve ici par le calcul le r&eacute;sultat qui avait &eacute;t&eacute; &eacute;nonc&eacute; intuitivement lors de l'&eacute;tude du premier &eacute;tage&nbsp;: tout se passe comme si le signal d'erreur g&eacute;n&eacute;r&eacute; par la tension de mode commun &eacute;tait divis&eacute; par le gain du premier &eacute;tage.<P>Cela revient &agrave; dire qu'<STRONG>on multiplie le TRMC<SUB>2</SUB> du deuxi&egrave;me &eacute;tage par le gain Avd1 du premier &eacute;tage.</STRONG><P>Le TRMC du montage global vaut&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST64.GIF"><P>En pratique, dans un tel montage, le premier &eacute;tage donnera tout le gain, et le deuxi&egrave;me &eacute;tage aura un gain unit&eacute;. Le TRMC global aura alors une valeur &eacute;lev&eacute;e, d'autant plus que lorsque ce sch&eacute;ma sera int&eacute;gr&eacute; sur une puce de silicium, un ajustage par laser des r&eacute;sistances de l'&eacute;tage de sortie lui donnera un bon TRMC.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI30">Comparaison avec l'ampli diff&eacute;rentiel simple.</A></FONT></H5><P>On peut voir l'impact de l'appariement des r&eacute;sistances du deuxi&egrave;me &eacute;tage. Si on reprend les donn&eacute;es <A HREF="#AIE36">relatives &agrave; ce montage</A>, on a&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST65.GIF"><P>Nous avons dit que le gain A<SUB>Vd2</SUB> du deuxi&egrave;me &eacute;tage &eacute;tait en g&eacute;n&eacute;ral &eacute;gal &agrave; 1. Compte tenu de l'&eacute;quation [54], on aura un TRMC total de&nbsp;:<P align=center><IMG SRC="AINST.FIG/AINST66.GIF"><P>Ce r&eacute;sultat est &agrave; rapprocher de celui de l'&eacute;quation <A HREF="#AIE36">[36]</A>. La valeur est la m&ecirc;me pour les deux montages dans le cas o&ugrave; le gain diff&eacute;rentiel total est &eacute;gal &agrave; 1, et on tendra vers un TRMC total &eacute;gal au double (+6dB) de celui de l'ampli diff&eacute;rentiel simple pour les fortes valeurs de gain.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI31">Conclusion.</A></FONT></H5><P>Il faut donc relativiser le r&eacute;sultat trouv&eacute; au premier abord, qui consiste &agrave; dire qu'on multiplie le TRMC du deuxi&egrave;me &eacute;tage par le gain du premier &eacute;tage&nbsp;: en effet, le TRMC du montage diff&eacute;rentiel est proportionnel au gain diff&eacute;rentiel, et dans le cas de l'amplificateur d'instrumentation, le deuxi&egrave;me &eacute;tage a un gain unit&eacute;, ce qui est d&eacute;favorable au TRMC.<P>On note qu'on gagne tout de m&ecirc;me 6dB pour les forts gains (erreur divis&eacute;e par 2), et surtout, on a des imp&eacute;dances d'entr&eacute;e &eacute;lev&eacute;es, ind&eacute;pendantes du gain, et ce gain est r&eacute;glable par une seule r&eacute;sistance.<P>Le TRMC restera moyen pour un gain global de 1. En pratique, ce cas se rencontre rarement. Les amplificateurs d'instrumentation r&eacute;pondent &agrave; un besoin d'amplifier de fa&ccedil;on pr&eacute;cise et stable de tr&egrave;s faibles tensions continues ou quasi-continues superpos&eacute;es &agrave; une tension de mode commun &eacute;lev&eacute;e. Les signaux &agrave; amplifier n&eacute;cessitent souvent un fort gain, qui va g&eacute;n&eacute;rer un TRMC important.<P>Si un gain faible est requis, il est probable que le signal utile ne sera pas petit devant la tension de mode commun, ce qui rend moins g&ecirc;nante la "&nbsp;faiblesse&nbsp;" du TRMC.</OL><P>&nbsp;<LI><H4><A NAME="AI32">PLAGE DE MODE COMMUN.</A></H4><P>Dans tous les montages diff&eacute;rentiels, il faudra prendre garde &agrave; un param&egrave;tre&nbsp;: la plage de mode commun admissible par les composants.<P>Un ampli d'instrumentation est compos&eacute; d'amplificateurs op&eacute;rationnels aliment&eacute;s par des tensions continues. La tension d'entr&eacute;e va en g&eacute;n&eacute;ral &ecirc;tre limit&eacute;e par les tensions positive et n&eacute;gative d'alimentation.<P>C'est surtout vrai pour les amplis d'instrumentation dont les entr&eacute;es sont des entr&eacute;es d'<A HREF="../AOP/COURS.HTM#AO46" target=_blank> amplis op&eacute;rationnels</A>, avec toutes les restrictions que cela impose. Par exemple, il sera hors de question de faire rentrer un signal ayant une tension de mode commun de 20V sur un ampli d'instrumentation aliment&eacute; en &#177;15V.<P>Pour ces montages, on fera aussi attention aux limites impos&eacute;es par les tensions de sorties maxi des amplis. Si on reprend l'&eacute;chelle des potentiels de la <A HREF="#AIF11">figure 11</A>, il faudra veiller &agrave; ce que les tensions S1 et S2 restent dans des limites acceptables pour l'ampli&nbsp;: cela implique que la somme des tensions de mode commun et du signal amplifi&eacute; soit inf&eacute;rieure &agrave; la limite de saturation des amplis.</OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="AI33">UTILISATION DES DIFF&Eacute;RENTS MONTAGES.</A></H3><P>Aucun des montages cit&eacute;s dans ce chapitre n'est mieux ni moins bien qu'un autre. Ils repr&eacute;sentent tous des compromis, et certains seront meilleurs sur un param&egrave;tre et moins bon sur un autre...<P>La solution id&eacute;ale n'existe donc pas&nbsp;! Il faudra jauger au cas par cas et utiliser le montage le mieux adapt&eacute;.<P>Nous allons faire ici le tour de groupes d'applications et donner des indications entra&icirc;nant le choix le plus judicieux. Tous les cas cit&eacute;s ci-dessous concernent uniquement la mesure diff&eacute;rentielle.<UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI34">Faible signal quasi-statique avec forte tension continue de mode commun.</A></FONT></H5><P>L'ampli d'instrumentation &agrave; 2 ou 3 amplis op&eacute;rationnels est ici de mise. Si le montage doit &ecirc;tre adaptable (gain ajustable), on choisira le montage &agrave; 3 amplis.<P>Dans le commerce, on trouve ces composants tout int&eacute;gr&eacute;s, avec m&ecirc;me certains qui incluent plusieurs r&eacute;sistances permettant de programmer diff&eacute;rents gains (souvent 1, 10, 100 et 1000).<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI35">Fort signal avec forte tension continue de mode commun.</A></FONT></H5><P>Ici, un montage diff&eacute;rentiel simple de faible gain fera probablement l'affaire, car son imp&eacute;dance d'entr&eacute;e pourra &ecirc;tre suffisante, et le TRMC ne sera pas moins bon qu'un ampli d'instrumentation. Pour des forts TRMC requis, on pourra choisir des amplis diff&eacute;rentiels de gain unit&eacute; int&eacute;gr&eacute;s (ex&nbsp;: INA&nbsp;105 de Burr-Brown). Les r&eacute;sistances ajust&eacute;es au laser permettent d'obtenir des TRMC sup&eacute;rieurs &agrave; 80dB.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI36">Mesure diff&eacute;rentielle permettant d'&eacute;viter le couplage par imp&eacute;dance commune.</A></FONT></H5><P>Dans ce cas, la tension de mode commun est relativement faible. Par contre, les fr&eacute;quences mises en jeu peuvent &ecirc;tre &eacute;lev&eacute;es, autant pour le signal utile que pour le signal de mode commun.<P>Il faudra plut&ocirc;t utiliser un montage diff&eacute;rentiel simple b&acirc;ti autour d'un ampli-op&eacute;rationnel rapide, ayant une bande passante &eacute;tendue et une r&eacute;jection de mode commun &eacute;lev&eacute;e en fr&eacute;quence (un LM118 suffira pour des applications ordinaires et on se tournera vers un OPA627/637 par exemple pour des applications exigeantes : l'OPA637 a un TRMC sup&eacute;rieur &agrave; 100dB &agrave; 100kHz, un produit gain bande passante sup&eacute;rieur &agrave; 45MHz, ceci avec une tension d'offset de l'ordre de 100 &#181;V&nbsp;!)<P>Ces amplis sont des standards de l'industrie, et on les retrouvera chez de nombreux fabricants (sous des appellations parfois diff&eacute;rentes&nbsp;: LM627 chez NS et OPA627 chez Burr-Brown par exemple).<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="AI37">Faible signal rapide avec forte tension de mode commun &agrave; composantes haute fr&eacute;quence.</A></FONT></H5><P>Les amplis d'instrumentation du commerce sont en g&eacute;n&eacute;ral relativement lents (co&ucirc;t de la pr&eacute;cision en statique), car les capteurs d&eacute;livrent souvent des signaux variant lentement. Par cons&eacute;quent, si on doit amplifier des signaux rapides entach&eacute;s de tensions de mode commun haute fr&eacute;quence, il faudra "&nbsp;bricoler&nbsp;" (tr&egrave;s proprement quand m&ecirc;me) avec des amplificateurs op&eacute;rationnels haute performance (tel celui pr&eacute;-cit&eacute;), et apparier les r&eacute;sistances du mieux qu'on peut.<P>Il ne faudra surtout pas oublier les capacit&eacute;s parasites (voir chapitre pr&eacute;c&eacute;dent) qui vont diminuer la r&eacute;jection de mode commun en haute fr&eacute;quence. Le circuit devra &ecirc;tre c&acirc;bl&eacute; de fa&ccedil;on sym&eacute;trique pour que les capacit&eacute;s parasites soient &eacute;gales, et il faudra peut-&ecirc;tre rajouter des capacit&eacute;s de compensation... La mesure devient ici de l'art&nbsp;!</UL></OL></BODY></HTML>