<HTML><HEAD><TITLE>COURS.HTM</TITLE></HEAD><BODY><CENTER><IMG SRC="../BASE/ICONES/NAV.GIF"></CENTER><P align=center>Si votre &eacute;cran ne se pr&eacute;sente pas comme ceci, <A HREF="DIODE.HTM" target="_top"> cliquez l&agrave; </A><OL TYPE=I><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="D01">INTRODUCTION.</A></H3><P>La diode est le semi-conducteur  de base &nbsp;: on ne peut pas combiner du silicium dop&eacute; plus simplement.<P>Son fonctionnement macroscopique est assimilable &agrave; celui d'un interrupteur command&eacute; qui ne laisse passer le courant que dans un seul sens.<P>Cette propri&eacute;t&eacute; lui ouvre un champ d'applications assez vaste en &eacute;lectronique. C'est la diode qui va permettre de redresser le courant alternatif issu du secteur et autoriser la fabrication d'alimentations stabilis&eacute;es qui sont obligatoires dans la plupart des montages &eacute;lectroniques. On con&ccedil;oit donc que si ce composant est  basique , ainsi que son fonctionnement, il n'en n'est pas moins fondamental&nbsp;!<P>Dans la cat&eacute;gorie des diodes, on trouve aussi des diodes de r&eacute;gulation, dites diodes z&eacute;ner, qui ont un comportement de source de tension. Cette propri&eacute;t&eacute; va permettre d'&eacute;laborer autour de ce composant simple toute une s&eacute;rie de montages d&eacute;livrant une ou plusieurs tensions continues.<P>La fonction diode a exist&eacute; bien avant l'arriv&eacute;e du silicium&nbsp;: on utilisait alors des diodes &agrave; vide (les  lampes ) dont le fonctionnement &eacute;tait bas&eacute; sur l'effet thermo&eacute;lectronique. Le silicium a apport&eacute; les avantages suivants&nbsp;: co&ucirc;t, fiabilit&eacute;, encombrement, simplicit&eacute; d'utilisation <P>&nbsp;<P>&nbsp;<LI><H3><A NAME="D02">PRINCIPE DE FONCTIONNEMENT.</A></H3><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="D03">LA JONCTION.</A><A HREF="ANNEXE/JONCTION.GIF" target=_blank> (GIF couleur 22ko)</A></H4><P>Si on dope une partie d'un semi conducteur intrins&egrave;que avec des atomes &agrave; 5 &eacute;lectrons p&eacute;riph&eacute;riques (le semi conducteur devient extrins&egrave;que de type N) et l'autre avec des atomes &agrave; 3 &eacute;lectrons p&eacute;riph&eacute;riques (extrins&egrave;que de type P), on cr&eacute;e une jonction, qui est la limite de s&eacute;paration entre les deux parties.<P>Nous avons fabriqu&eacute; une diode &agrave; jonction.<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D04">&Eacute;quilibre sans g&eacute;n&eacute;rateur.</A><A HREF="ANNEXE/PNCHMP0.GIF" target=_blank> (GIF couleur 17ko)</A></FONT></H5><P><CENTER><IMG SRC="DIODE.FIG/DIODE02.GIF"></CENTER><CENTER><P>Fig. 1. &Eacute;quilibre au niveau de la jonction.</CENTER><STRONG>Au voisinage de la jonction</STRONG>, les trous de la zone P vont neutraliser les &eacute;lectrons libres de la zone N (il y a diffusion des charges). Ce ph&eacute;nom&egrave;ne va s'arr&ecirc;ter quand le champ &eacute;lectrique Eint cr&eacute;&eacute; par les atomes donneurs ou accepteurs (qui vont devenir respectivement des charges + et -) va &ecirc;tre suffisant pour contrarier le mouvement des charges mobiles. Ceci constitue une barri&egrave;re de potentiel pour les porteurs majoritaires. Par contre, cette barri&egrave;re de potentiel va favoriser le passage des porteurs minoritaires (conduction &eacute;lectrique).<P>Les deux courants antagonistes (diffusion des majoritaires et conduction des minoritaires) s'&eacute;quilibrent et leur somme est nulle en r&eacute;gime permanent et en l'absence de champ &eacute;lectrique ext&eacute;rieur.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D05">Avec un g&eacute;n&eacute;rateur en sens direct.</A><A HREF="ANNEXE/PNCHMPD.GIF" target=_blank> (GIF couleur 18ko)</A></FONT></H5><P>La barri&egrave;re de potentiel interne emp&ecirc;che donc toute circulation de courant. Si on applique un champ externe &agrave; l'aide d'un g&eacute;n&eacute;rateur en branchant le p&ocirc;le + sur la zone P et le p&ocirc;le - sur la zone N, on peut annuler les effets du champ interne et permettre au courant de circuler&nbsp;: le ph&eacute;nom&egrave;ne d'attraction des &eacute;lectrons libres de la partie N par les trous de la partie P (diffusion) n'est plus contrari&eacute;, et le g&eacute;n&eacute;rateur va pouvoir injecter des &eacute;lectrons dans la zone N et les  repomper  par la zone P.<P>Le courant de conduction constitu&eacute; par les porteurs minoritaires prend une valeur I<sub>f</sub> ind&eacute;pendante du champ ext&eacute;rieur.<P>Le courant total est la somme des deux courants, soit pratiquement le courant direct d&ucirc; aux porteurs majoritaires d&egrave;s que la tension atteint la centaine de mV.<P>La diode est alors polaris&eacute;e dans le sens direct, et un courant relativement intense peut circuler&nbsp;: de quelques dizaines de milliamp&egrave;res pour des diodes de signal &agrave; quelques amp&egrave;res pour des diodes de redressement standard, voire &agrave; des centaines d'amp&egrave;res pour des diodes industrielles de tr&egrave;s forte puissance.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D06">Avec un g&eacute;n&eacute;rateur en sens inverse.</A><A HREF="ANNEXE/PNCHMPI.GIF" target=_blank> (GIF couleur 18ko)</A></FONT></H5><P>Si on branche le g&eacute;n&eacute;rateur dans le sens inverse du cas pr&eacute;c&eacute;dent, on renforce le champ &eacute;lectrique interne, et on emp&ecirc;che le passage des porteurs majoritaires&nbsp;: les &eacute;lectrons libres sont repouss&eacute;s dans la zone N et les trous dans la zone P&nbsp;; on accentue la s&eacute;paration des charges (zone de <STRONG>d&eacute;pl&eacute;tion</STRONG>).<P>Par contre, les porteurs minoritaires (trous pour la zone N et &eacute;lectrons libres pour la zone P) peuvent traverser la jonction et reboucler par le g&eacute;n&eacute;rateur&nbsp;: ils forment  le courant inverse I<SUB>f</SUB> qui d&eacute;pend essentiellement de la temp&eacute;rature.<P>Le champ ext&eacute;rieur repousse les charges qui vont se trouver &agrave; une distance sensiblement proportionnelle &agrave;  |V|, cr&eacute;ant ainsi une capacit&eacute; proportionnelle &agrave; cette distance, donc &agrave;  |V|.<P>Cette capacit&eacute; est inh&eacute;rente &agrave; toute jonction de semi conducteurs, et va constituer la principale limitation (en r&eacute;gime lin&eacute;aire tout du moins) au fonctionnement &agrave; haute fr&eacute;quence des composants &eacute;lectroniques (diodes, transistors et circuits int&eacute;gr&eacute;s les employant).<P></OL><P>&nbsp;<LI><H4><A NAME="D07">CARACT&Eacute;RISTIQUES &Eacute;LECTRIQUES.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D08">Caract&eacute;ristique courant/tension.</A></FONT></H5><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D09">Caract&eacute;ristique globale.</A></FONT></H5>On a vu pr&eacute;c&eacute;demment que le courant &eacute;tait n&eacute;gligeable pour une tension V<sub>d</sub> = V<sub>p</sub>-V<sub>n</sub> n&eacute;gative (ceci est vrai jusqu'&agrave; une tension V<SUB>c</SUB> dite tension de claquage). Au dessus d'un certain seuil V<sub>o</sub> de tension V<sub>d</sub> positive, le courant direct croit tr&egrave;s rapidement avec V<sub>d</sub>.<P>Le seuil V<sub>o</sub> (barri&egrave;re de potentiel) d&eacute;pend du semi conducteur intrins&egrave;que de base utilis&eacute;. Il est d'environ 0,2V pour le germanium et 0,6V pour le silicium. <P>La caract&eacute;ristique a la forme suivante&nbsp;:<P><CENTER><IMG SRC="DIODE.FIG/DIODE03.GIF"></CENTER><CENTER><P>Fig. 2. Caract&eacute;ristique compl&egrave;te.</CENTER><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D10">Caract&eacute;ristique directe (V<sub>d</sub> &gt; 0)</A></FONT></H5><CENTER><IMG SRC="DIODE.FIG/DIODE04.GIF"></CENTER><CENTER><P>Fig. 3. Caract&eacute;ristique directe d'une diode.</CENTER>Sur ce type de diode au silicium, le courant croit assez rapidement au del&agrave; de 0,7V. C'est une diode de redressement supportant 1A en direct et 600V en tension inverse.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D11">Autour de z&eacute;ro.</A></FONT></H5>La caract&eacute;ristique passe par l'origine. Pour V<sub>d</sub> n&eacute;gatif, le courant tend rapidement vers la limite -I<sub>f</sub>  (courant de fuite) , car le courant de diffusion d&ucirc; aux porteurs majoritaires va s'annuler.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D12">Caract&eacute;ristique inverse (V<sub>d</sub> &lt; 0). Ph&eacute;nom&egrave;ne de claquage.</A></FONT></H5>Quand la tension appliqu&eacute;e d&eacute;passe la valeur sp&eacute;cifi&eacute;e par le fabricant, le courant d&eacute;cro&icirc;t (attention&nbsp;: il est d&eacute;j&agrave; n&eacute;gatif&nbsp;!) tr&egrave;s rapidement. S'il n'est pas limit&eacute; par des &eacute;l&eacute;ments externes, il y a destruction rapide de la diode. Deux ph&eacute;nom&egrave;nes sont &agrave; l'origine de ce r&eacute;sultat&nbsp;:<P><STRONG> - ph&eacute;nom&egrave;ne d'avalanche</STRONG>&nbsp;: quand le champ &eacute;lectrique au niveau de la jonction devient trop intense, les &eacute;lectrons acc&eacute;l&eacute;r&eacute;s peuvent ioniser les atomes par chocs, ce qui lib&egrave;re d'autres &eacute;lectrons qui sont &agrave; leur tour acc&eacute;l&eacute;r&eacute;s  Il y a divergence du ph&eacute;nom&egrave;ne, et le courant devient important.<P><STRONG> - ph&eacute;nom&egrave;ne Zener</STRONG>&nbsp;: les &eacute;lectrons sont arrach&eacute;s aux atomes directement par le champ &eacute;lectrique dans la zone de transition et cr&eacute;ent un courant qui devient vite intense quand la tension V<sub>d</sub> atteint une valeur V<sub>z</sub> dite tension Z&eacute;ner.<P>Si on construit la diode pour que le ph&eacute;nom&egrave;ne Z&eacute;ner l'emporte sur le ph&eacute;nom&egrave;ne d'avalanche (en s'arrangeant pour que la zone de transition soit &eacute;troite), on obtient une diode Z&eacute;ner.<P>On utilise alors cette diode en polarisation inverse. L'effet z&eacute;ner n'est pas destructif dans ce cas. Ces diodes sont tr&egrave;s utilis&eacute;es pour la r&eacute;gulation de tension.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D13">&Eacute;quation.</A></FONT></H5><P><CENTER><IMG SRC="DIODE.FIG/DIODE05.GIF"></CENTER><CENTER><P>Fig. 4. Lin&eacute;arit&eacute; de Log (I) fonction de V.</CENTER>la courbe Fig. 2. (&agrave; l'exception de la zone de claquage) r&eacute;pond assez bien &agrave; la formule suivante, expliqu&eacute;e par la thermodynamique statistique&nbsp;:<P><CENTER><IMG SRC="DIODE.FIG/DIODE06.GIF"></CENTER><P>o&ugrave;&nbsp;:<P> - I<sub>f</sub> est le courant de fuite<P> - q la charge de l'&eacute;lectron = 1,6E-19C<P> - k constante de Boltzman = 1,38E-23 J/K<P> - T temp&eacute;rature absolue<P>La loi logarithmique [1] est bien illustr&eacute;e par les figures&nbsp;3 et 4. La courbe exp&eacute;rimentale s'&eacute;loigne toutefois de la th&eacute;orie aux forts courants, o&ugrave; le mod&egrave;le n'a pas tenu compte d'autres ph&eacute;nom&egrave;nes dont les chutes de tension ohmiques dans le semi conducteur.<P>A noter que sur la figure 4, le courant maxi repr&eacute;sent&eacute; est &eacute;gal au 1/10&egrave;me admissible par cette diode.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D14">Effet de la temp&eacute;rature.</A></FONT></H5>Pour V<sub>d</sub> positif, la diode a un coefficient de temp&eacute;rature n&eacute;gatif &eacute;gal &agrave; -2mV/K. Cette d&eacute;rive en temp&eacute;rature est suffisament stable pour qu'on puisse utiliser des diodes comme thermom&egrave;tres.<P>Pour V<sub>d</sub> n&eacute;gatif, le courant de fuite I<sub>f</sub> varie tr&egrave;s rapidement avec la temp&eacute;rature. Il est plus important pour le germanium que pour le silicium, et cro&icirc;t plus vite, ce qui devient rapidement g&ecirc;nant. Dans le silicium, ce courant double tous les 6&#176;C.<P></UL><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D15">R&eacute;sistance diff&eacute;rentielle (ou dynamique).</A></FONT></H5><CENTER><IMG SRC="DIODE.FIG/DIODE07.GIF"></CENTER><CENTER><P>Fig. 5. R&eacute;sistance dynamique.</CENTER>La <A HREF="../OUTILS/COURS.HTM#O34" target=_blank> r&eacute;sistance dynamique</A> &eacute;tant l'inverse de la pente de la caract&eacute;ristique en un point donn&eacute;, on peut la d&eacute;duire par d&eacute;rivation de la formule [1]&nbsp;:<P><CENTER><IMG SRC="DIODE.FIG/DIODE08.GIF"></CENTER><P>C'est la r&eacute;sistance dynamique au point de fonctionnement (V<sub>d</sub> , I<sub>d</sub>). Elle est fonction du courant de polarisation I<sub>d</sub> au point &eacute;tudi&eacute;.<P>La figure 5 donne la valeur de r<sub>d</sub> en fonction de la tension de la diode&nbsp;: les variations sont tr&egrave;s importantes.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D16">Sch&eacute;ma &eacute;quivalent.</A></FONT></H5>La repr&eacute;sentation de la diode par sa loi logarithmique est un peu complexe pour l'emploi de tous les jours. Plusieurs sch&eacute;mas &eacute;quivalents simplifi&eacute;s sont propos&eacute;s&nbsp;:<P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D17">Diode id&eacute;ale.</A></FONT></H5>Dans ce cas, on n&eacute;glige la tension de seuil et la r&eacute;sistance interne de la diode. La caract&eacute;ristique est alors celle de la figure 6.<P>Ce sch&eacute;ma est utile pour des pr&eacute; calculs, surtout si les diodes sont employ&eacute;es dans des circuits o&ugrave; les tensions sont &eacute;lev&eacute;es (plusieurs dizaines de volts)&nbsp;: la tension de coude est alors n&eacute;gligeable. <P><CENTER><IMG SRC="DIODE.FIG/DIODE09.GIF"></CENTER><CENTER><P>Fig. 6. Caract&eacute;ristique id&eacute;ale.</CENTER><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D18">Diode avec seuil.</A></FONT></H5>On peut continuer &agrave; n&eacute;gliger la r&eacute;sistance interne, mais tenir compte du seuil de la diode. La caract&eacute;ristique devient&nbsp;:<P><CENTER><IMG SRC="DIODE.FIG/DIODE10.GIF"></CENTER><CENTER><P>Fig. 7. Caract&eacute;ristique avec seuil.</CENTER>Ce sch&eacute;ma est le plus utilis&eacute; pour les calculs.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D19">Diode avec seuil et r&eacute;sistance.</A></FONT></H5>Ici, on prend en compte la r&eacute;sistance de la diode. Ceci peut &ecirc;tre utile si on utilise la diode en petits signaux alternatifs et qu'on a besoin de sa r&eacute;sistance dynamique.<P><CENTER><IMG SRC="DIODE.FIG/DIODE11.GIF"></CENTER><CENTER><P>Fig. 8. Caract&eacute;ristique avec seuil et r&eacute;sistance.</CENTER><STRONG>Attention</STRONG>&nbsp;: dans ce cas, on consid&egrave;re que la r&eacute;sistance dynamique est constante, ce qui n'est vrai que si la variation du signal alternatif est tr&egrave;s petite autour du point de polarisation en continu.<P></UL></OL></OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="D20">UTILISATION.</A></H3>Il existe divers types de diodes correspondant &agrave; des technologies diff&eacute;rentes. Chaque technologie pr&eacute;sente le meilleur compromis pour une utilisation donn&eacute;e.<P>Nous allons balayer les applications des diodes en les classifiant par  groupe technologique.<P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D21"> Param&egrave;tres essentiels des diodes.</A></FONT></H5> En fonction de l'application consid&eacute;r&eacute;e, on s'int&eacute;ressera &agrave; certains param&egrave;tres des diodes plut&ocirc;t qu'&agrave; d'autres. Certains param&egrave;tres ne sont pas sp&eacute;cifi&eacute;s pour tous les types de diodes, sauf les suivants qui sont incontournables&nbsp;:<P><STRONG> - V<SUB>F</SUB></STRONG>&nbsp;: tension de coude de la diode sp&eacute;cifi&eacute;e &agrave; un courant direct donn&eacute;.<P><STRONG> - I<SUB>F</SUB></STRONG>&nbsp;: courant direct permanent admissible par la diode &agrave; la temp&eacute;rature maxi de fonctionnement.<P><STRONG> - I<SUB>FSM</SUB></STRONG>&nbsp;: courant temporaire de surcharge (r&eacute;gime impulsionnel). En g&eacute;n&eacute;ral, pour un courant de surcharge donn&eacute;, le constructeur sp&eacute;cifie l'amplitude des impulsions, leur dur&eacute;e, le rapport cyclique, et dans certains cas, le nombre maxi d'impulsions qu'on peut appliquer.<P><STRONG> - V<SUB>R</SUB></STRONG>&nbsp;: c'est la tension inverse maxi admissible par la diode (avant l'avalanche).<P><STRONG> - I<SUB>R</SUB></STRONG>&nbsp;: c'est le courant inverse de la diode. Il est sp&eacute;cifi&eacute; &agrave; une tension inverse donn&eacute;e, et pour plusieurs temp&eacute;ratures (g&eacute;n&eacute;ralement 25&#176;C et Tmax). Ce courant n'est pas seulement celui d&ucirc; aux porteurs minoritaires. Il provient aussi des courants parasites &agrave; la surface de la puce (le silicium est passiv&eacute; par oxydation, et il peut subsister des impuret&eacute;s qui vont permettre le passage de faibles courants). Le boitier d'encapsulation de la puce de silicium est aussi source de fuites.<P>Ces symboles sont ceux g&eacute;n&eacute;ralement employ&eacute;s par les diff&eacute;rents constructeurs, mais il peut y avoir des variantes, et il est toujours sage de se reporter &agrave; la documentation du constructeur pour savoir comment sont sp&eacute;cifi&eacute;s les param&egrave;tres, et &agrave; quoi ils correspondent exactement.<P></UL><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="D22">DIODES DE REDRESSEMENT.</A></H4>Une des principales applications de la diode est le redressement de la tension alternative du secteur pour  faire des g&eacute;n&eacute;rateurs de tension continue destin&eacute;s &agrave; alimenter les montages &eacute;lectroniques (entre autres).<P>Il y a deux types principaux de diodes de redressement&nbsp;: les diodes standard pour le redressement secteur classique, et les diodes rapides pour les alimentations &agrave; d&eacute;coupage. Nous &eacute;tudierons ces derni&egrave;res ult&eacute;rieurement.<P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D23">Caract&eacute;ristiques physiques.</A></FONT></H5>Les diodes de redressement standard sont les moins sophistiqu&eacute;es, et ne font l'objet d'aucun traitement particulier, les conditions d'utilisations &eacute;tant peu contraignantes.<P>Elles ont des tensions V<SUB>R</SUB> comprises entre 50 et 1000V environ, et les courants I<SUB>F</SUB> vont de 1A &agrave; plusieurs centaines d'amp&egrave;res.<P>Avant le syst&egrave;me de redressement, on a presque toujours un transformateur qui sert &agrave; abaisser la tension secteur (les montages &eacute;lectroniques fonctionnent souvent sous des tensions de polarisation allant de quelques volts &agrave; quelques dizaines de volts), et qui sert aussi &agrave; isoler les montages du secteur (220V, &ccedil;a peut faire tr&egrave;s mal&nbsp;!).<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D24">Redressement simple alternance.</A></FONT></H5>C'est le redressement le plus simple qui soit&nbsp;: quand la tension aux bornes du transformateur V<SUB>t</SUB> d&eacute;passe la tension de seuil de la diode, celle-ci conduit, laissant passer le courant direct dans la charge. La tension aux bornes de la charge V<SUB>r</SUB> est alors &eacute;gale &agrave; la tension aux bornes du transformateur moins la tension directe V<SUB>F</SUB> de la diode.<P><CENTER><IMG SRC="DIODE.FIG/DIODE12.GIF"></CENTER><P><CENTER><IMG SRC="DIODE.FIG/DIODE13.GIF"></CENTER><CENTER><P>Fig. 9. Redressement avec une diode.</CENTER>Quand la tension aux bornes du transformateur devient inf&eacute;rieure &agrave; la tension de seuil, la diode est bloqu&eacute;e&nbsp;; il ne subsiste que le courant de fuite, qui est n&eacute;gligeable en comparaison du courant direct.<P>La tension aux bornes de la diode est alors &eacute;gale &agrave; celle aux bornes du transformateur&nbsp;: il faudra choisir une diode avec une tension V<SUB>R</SUB> au minimum &eacute;gale &agrave; la tension cr&ecirc;te du secondaire du transformateur.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D25">Redressement double alternance.</A></FONT></H5><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D26">Avec transfo double enroulement.</A></FONT></H5><CENTER><IMG SRC="DIODE.FIG/DIODE14.GIF"></CENTER><P><CENTER><IMG SRC="DIODE.FIG/DIODE15.GIF"></CENTER><CENTER><P>Fig. 10. Redressement avec transfo double sortie.</CENTER>Le montage pr&eacute;c&eacute;dent pr&eacute;sente l'inconv&eacute;nient de ne laisser passer que la moiti&eacute; du courant que peut d&eacute;livrer le transformateur. Pour rem&eacute;dier &agrave; cel&agrave;, on utilise un transformateur avec deux enroulements secondaires que l'on c&acirc;ble de mani&egrave;re &agrave; ce qu'ils d&eacute;livrent des tensions en opposition de phase sur les diodes.<P>On notera la chute de tension dans les diodes&nbsp;: elle devient non n&eacute;gligeable quand les tensions alternatives sont faibles (4V cr&ecirc;te dans l'exemple ci-dessus).<P>Dans ce cas, tout se passe comme si on avait deux montages identiques &agrave; celui de la Fig. 9 qui fonctionnent l'un pour l'alternance positive, l'autre pour l'alternance n&eacute;gative. On v&eacute;rifie bien (Fig. 11 et 12) que le courant dans la charge est toujours orient&eacute; dans le m&ecirc;me sens.<P><CENTER><IMG SRC="DIODE.FIG/DIODE16.GIF"></CENTER><CENTER><P>Fig. 11. Alternance positive.</CENTER><CENTER><IMG SRC="DIODE.FIG/DIODE17.GIF"></CENTER><CENTER><P>Fig. 12. Alternance n&eacute;gative.</CENTER>Les diodes sont plus sollicit&eacute;es que pour le montage simple alternance&nbsp;: en effet, la diode qui ne conduit pas devra supporter en plus de la tension aux bornes de  son  secondaire de transformateur, la tension aux bornes de la r&eacute;sistance. Au total, elle devra supporter une tension V<SUB>R</SUB> double de celle requise dans le montage &agrave; simple alternance, soit deux fois la tension cr&ecirc;te pr&eacute;sente sur chacun des secondaires.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D27">Avec pont de Gr&aelig;tz.</A></FONT></H5><CENTER><IMG SRC="DIODE.FIG/DIODE18.GIF"></CENTER><P><CENTER><IMG SRC="DIODE.FIG/DIODE19.GIF"></CENTER><CENTER><P>Fig.13. Redressement avec pont de diodes.</CENTER>Il existe une autre mani&egrave;re de faire du redressement double alternance, ne n&eacute;cessitant pas un transformateur &agrave; double enroulement&nbsp;: on utilise 4 diodes mont&eacute;es en pont. Des ponts tous faits sont disponibles dans le commerce, permettant de r&eacute;duire le nombre de composants du montage.<P>Lorsque la tension aux bornes du transformateur est positive, D1 et D4 conduisent, et quand elle est n&eacute;gative, D2 et D3 conduisent (Fig. 14 et 15).<P><CENTER><IMG SRC="DIODE.FIG/DIODE20.GIF"></CENTER><CENTER><P>Fig. 14. Alternance positive.</CENTER><CENTER><IMG SRC="DIODE.FIG/DIODE21.GIF"></CENTER><CENTER><P>Fig.15. Alternance n&eacute;gative.</CENTER>Chaque diode n'a &agrave; supporter qu'une fois la tension cr&ecirc;te du secondaire du transformateur (contre deux fois pour le montage pr&eacute;c&eacute;dent), mais en revanche, on a deux tensions directes de diode en s&eacute;rie. La puissance totale dissip&eacute;e dans les diodes est double par rapport &agrave; la solution pr&eacute;c&eacute;dente.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D28">Quelle solution choisir&nbsp;?</A></FONT></H5>Quand on en aura la possibilit&eacute;, on pr&eacute;f&egrave;rera la solution &agrave; transfo &agrave; point milieu, pour plusieurs raisons&nbsp;:<P> - le transfo n'est pas plus cher que celui &agrave; secondaire simple.<P> - avec un transfo &agrave; un seul secondaire, on ne peut pas faire d'alimentation double sym&eacute;trique en redressement double alternance. Ce type de transfo est moins  universel .<P> - le fait que les diodes aient &agrave; tenir une tension double n'est pas un probl&egrave;me dans la plupart des cas, car les tensions redress&eacute;es sont tr&egrave;s souvent bien inf&eacute;rieures aux tensions V<SUB>R</SUB> minimum des diodes disponibles dans le commerce.<P> - dans le montage en pont, la charge est flottante par rapport au transformateur, ce qui peut &ecirc;tre g&ecirc;nant dans certains cas.<P></UL><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D29">Filtrage.</A></FONT></H5>Les montages pr&eacute;c&eacute;dents d&eacute;livrent des tensions redress&eacute;es mais non continues.<P>Pour obtenir une tension (quasi) continue, il suffit de mettre un gros condensateur en parall&egrave;le avec la charge.<P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D30">Redressement simple alternance.</A></FONT></H5>Ici, la charge est absolument quelconque, et peut &ecirc;tre un montage &eacute;lectronique complexe ayant une consommation en courant al&eacute;atoire.<P><CENTER><IMG SRC="DIODE.FIG/DIODE22.GIF"></CENTER><P><CENTER><IMG SRC="DIODE.FIG/DIODE23.GIF"></CENTER><CENTER><P>Fig. 16. Redressement simple alternance et filtrage.</CENTER>Sur le graphique du bas de la Fig. 16, on voit en pointill&eacute; la tension redress&eacute;e telle qu'elle serait sans condensateur. En traits pleins &eacute;pais, on voit la tension filtr&eacute;e.<P>Sur ce graphe, le courant de d&eacute;charge du condensateur est lin&eacute;aire&nbsp;: il correspond &agrave; l'hypoth&egrave;se de d&eacute;charge &agrave; courant constant.<P>Le fonctionnement est simple&nbsp;: quand la tension aux bornes du transformateur est sup&eacute;rieure &agrave; la tension aux bornes du condensateur additionn&eacute;e de la tension directe de la diode, la diode conduit. Le transformateur doit alors fournir le courant qui va alimenter la charge et le courant de recharge du condensateur.<P>Quand la tension du transformateur devient inf&eacute;rieure &agrave; celle du condensateur plus la tension de coude de la diode, la diode se bloque. L'ensemble condensateur / charge forme alors une boucle isol&eacute;e du transformateur.<P>Le condensateur se comporte comme un g&eacute;n&eacute;rateur de tension, et il restitue l'&eacute;nergie accumul&eacute;e dans la phase pr&eacute;c&eacute;dente.<P>A noter que la tension aux bornes du condensateur &eacute;tant en permanence voisine de la tension cr&ecirc;te positive du transformateur, lorsque celui-ci fournit la tension de cr&ecirc;te n&eacute;gative, la diode doit supporter deux fois la tension cr&ecirc;te d&eacute;livr&eacute;e par le transformateur&nbsp;: on perd le seul avantage (hormis la simplicit&eacute;) du montage &agrave; redressement simple alternance. <P><STRONG>Calcul du condensateur</STRONG>&nbsp;: dans la litt&eacute;rature, on trouve classiquement le calcul du condensateur pour une charge r&eacute;sistive. La d&eacute;charge est alors exponentielle et le calcul inutilement compliqu&eacute;.<P>Ce calcul est assez &eacute;loign&eacute; des besoins r&eacute;els&nbsp;: en g&eacute;n&eacute;ral, on ne fait pas des alimentations continues pour les faire d&eacute;biter dans des r&eacute;sistances&nbsp;!<P>Tr&egrave;s souvent, ces alimentations redress&eacute;es et filtr&eacute;es sont suivies d'un r&eacute;gulateur de tension. La charge est fr&eacute;quemment un montage complexe ayant une consommation variable au cours du temps.<P>Pour faire le calcul du condensateur, on prendra donc une d&eacute;charge &agrave; courant constant, le courant servant au calcul &eacute;tant le maximum (moyenn&eacute; sur une p&eacute;riode du secteur) consomm&eacute; par la charge.<P>Le crit&egrave;re de choix ne sera pas un taux d'ondulation qui n'a souvent aucune utilit&eacute; pratique, mais une chute de tension maxi autoris&eacute;e sur le condensateur pour que le montage connect&eacute; en aval fonctionne correctement.<P>Avec ces hypoth&egrave;ses, le calcul du condensateur devient tr&egrave;s simple&nbsp;: On consid&egrave;re que le condensateur C se d&eacute;charge &agrave; courant Imax constant pendant un temps <IMG SRC="../BASE/ICONES/DELTA.GIF">T et que la chute de sa tension est inf&eacute;rieure &agrave;  <IMG SRC="../BASE/ICONES/DELTA.GIF">V.<P>On a alors la relation&nbsp;:<P><CENTER><IMG SRC="DIODE.FIG/DIODE24.GIF"></CENTER><P>Le temps <IMG SRC="../BASE/ICONES/DELTA.GIF">T choisi va &ecirc;tre approxim&eacute; &agrave; la p&eacute;riode du secteur. En pratique, le condensateur va se d&eacute;charger moins longtemps (Fig. 16), on va donc le surdimensionner l&eacute;g&egrave;rement.<P>L'erreur commise est en fait tr&egrave;s faible compar&eacute;e &agrave; la dispersion que l'on aura sur le r&eacute;sultat de par les tol&eacute;rances des composants, et notamment des condensateurs de filtrage&nbsp;: on utilise des condensateurs chimiques qui ont des tol&eacute;rances tr&egrave;s larges (-20% / +80% en g&eacute;n&eacute;ral) et qui n'existent souvent que dans la s&eacute;rie E6 (1&nbsp;; 1,5&nbsp;; 2,2&nbsp;; 3,3&nbsp;; 4,7&nbsp;; 6,8). Les transformateurs sont eux aussi assez dispers&eacute;s,  ce qui fait qu'au final, mieux vaut pr&eacute;voir large pour &eacute;viter les mauvaises surprises&nbsp;!<P>Pour un redressement simple alternance, on aura un <IMG SRC="../BASE/ICONES/DELTA.GIF">T de 20ms, qui correspond &agrave; l'inverse de la fr&eacute;quence secteur 50Hz. La valeur du condensateur est alors&nbsp;:<P><CENTER><IMG SRC="DIODE.FIG/DIODE25.GIF"></CENTER><P>Il faudra veiller &agrave; choisir un condensateur supportant au moins la tension cr&ecirc;te du transformateur <STRONG>&agrave; vide</STRONG> (la tension sera plus faible en charge du fait des chutes de tensions diverses (r&eacute;sistance du transfo, diode ).<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D31">Redressement double alternance.</A></FONT></H5>Les hypoth&egrave;ses seront les m&ecirc;mes que pr&eacute;c&eacute;demment. La seule diff&eacute;rence viendra du temps <IMG SRC="../BASE/ICONES/DELTA.GIF">T&nbsp;; vu qu'on a un redressement double alternance, la fr&eacute;quence du courant redress&eacute; est double de celle du secteur. La formule de calcul du condensateur devient donc&nbsp;:<P><CENTER><IMG SRC="DIODE.FIG/DIODE26.GIF"></CENTER><P>Comme dans la formule [4], F est la fr&eacute;quence secteur (50Hz en France).<P>A chute de tension &eacute;gale, le condensateur sera donc deux fois plus petit que pour le redressement simple alternance, ce qui est int&eacute;ressant, vu la taille importante de ces composants.<P>La diode aura &agrave; tenir deux fois la tension cr&ecirc;te d&eacute;livr&eacute;e par chaque enroulement du transformateur.<P><CENTER><IMG SRC="DIODE.FIG/DIODE27.GIF"></CENTER><P><CENTER><IMG SRC="DIODE.FIG/DIODE28.GIF"></CENTER><CENTER><P>Fig. 17. Redressement double alternance et filtrage.</CENTER><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D32">Fonctionnement  des diodes et transfos.</A></FONT></H5>On peut remarquer Fig. 16 et 17 que les diodes ne conduisent pas pendant toute l'alternance du secteur, mais seulement pendant un temps tr&egrave;s court vis &agrave; vis de cette alternance. L'&eacute;nergie qui est restitu&eacute;e par le condensateur dans la phase de  roue libre  doit &ecirc;tre au pr&eacute;alable stock&eacute;e pendant ce court temps de conduction des diodes.<P>La cons&eacute;quence de ceci, c'est que pour assurer un certain courant moyen dans la charge, l'ensemble transfo plus diode devra d&eacute;biter un courant de cr&ecirc;te beaucoup plus intense que le courant moyen lors des phases de conduction des diodes (environ 15 fois le courant moyen).<A HREF="ANNEXE/REDDEM.GIF" target=_blank> Voir chronogramme (GIF couleur 15ko)</A><P>La chute de tension dans les diodes sera alors importante (plus pr&egrave;s d'1V que de 0,6V) ainsi que la chute de tension dans les r&eacute;sistances du transformateur.<P>Il ne faudra pas perdre ces consid&eacute;rations de vue quand on voudra calculer l'alimentation au plus juste&nbsp;!<P>L'autre cons&eacute;quence est le d&eacute;marrage de l'alimentation&nbsp;: lorsqu'on branche le transformateur sur le secteur, on peut se trouver au maximum de tension de l'alternance secteur. La charge du transformateur, principalement constitu&eacute;e du condensateur de filtrage, sera l'&eacute;quivalent d'un court-circuit. Le courant d'appel sera alors uniquement limit&eacute; par la r&eacute;sistance interne du transformateur (quelques dizi&egrave;mes d'ohms &agrave; quelques ohms), et il sera tr&egrave;s intense&nbsp;: les diodes devront supporter ce courant (param&egrave;tre I<SUB>FSM</SUB>)<P></UL><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D33">Alimentations doubles sym&eacute;triques.</A></FONT></H5>Si on analyse le fonctionnement du redresseur double alternance &agrave; transformateur &agrave; point milieu, on s'aper&ccedil;oit que chaque secondaire d&eacute;bite du courant seulement pendant une alternance. L'autre alternance serait susceptible de fournir un courant n&eacute;gatif.<P>Partant de cette constatation, on peut imaginer facilement une alimentation double sym&eacute;trique, avec 4 diodes dispos&eacute;e en pont&nbsp;: deux diodes vont conduire les alternances positives des secondaires du transformateur, et les deux autres les alternances n&eacute;gatives.<P>Le point milieu du transformateur sera le potentiel commun des deux alimentations.<P><CENTER><IMG SRC="DIODE.FIG/DIODE29.GIF"></CENTER><CENTER><P>Fig. 18. Alimentation double positive et n&eacute;gative.</CENTER>On peut bien &eacute;videmment mettre un condensateur aux bornes de chacune des charges pour filtrer les tensions redress&eacute;es obtenues.<P>Ces alimentations sont incontournables dans les montages sym&eacute;triques o&ugrave; il est n&eacute;cessaire d'amplifier des tensions continues, et notamment dans les montages &agrave; amplificateurs op&eacute;rationnels<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D34">Doubleur de tension.</A></FONT></H5>Dans certaines applications, on peut avoir besoin de tensions continues tr&egrave;s &eacute;lev&eacute;es (quelques milliers de volts). On pourrait les obtenir avec un transformateur &eacute;l&eacute;vateur et un redressement / filtrage classique.<P>Il existe une solution moins on&eacute;reuse faisable avec des diodes et des condensateurs&nbsp;: c'est le doubleur de tension.<P>Le montage de la Fig. 19. se d&eacute;compose en deux&nbsp;: redressement / filtrage par la cellule D1 / C1, puis d&eacute;tecteur de cr&ecirc;te D2 / C2.<P><CENTER><IMG SRC="DIODE.FIG/DIODE30.GIF"></CENTER><P><CENTER><IMG SRC="DIODE.FIG/DIODE31.GIF"></CENTER><CENTER><P>Fig. 19. Doubleur de tension de Schenkel.</CENTER>Aux bornes du condensateur C1, si la charge est infinie, la tension V<SUB>c</SUB> restera constante et &eacute;gale &agrave; la tension cr&ecirc;te du transformateur.<P>La diode D1 verra &agrave; ses bornes la tension V<SUB>t</SUB> + V<SUB>c</SUB>, dont la valeur cr&ecirc;te est &eacute;gale &agrave; deux fois la tension cr&ecirc;te du transformateur. Tout se passe comme si la tension du transformateur avait &eacute;t&eacute; translat&eacute;e d'une fois la valeur de la tension cr&ecirc;te.<P>Il suffit alors de filtrer cette tension &agrave; sa valeur de cr&ecirc;te avec D2 et C2&nbsp;: on obtient une tension continue &eacute;gale &agrave; deux fois la tension cr&ecirc;te du transformateur.<P>Il est possible de continuer ce raisonnement, et en ajoutant d'autres cellules semblables &agrave; celle du doubleur, on peut tripler, quadrupler ou plus les tensions.<P>Ces montages sont utilis&eacute;s entre autres pour g&eacute;n&eacute;rer les tensions d'acc&eacute;l&eacute;ration des tubes d'oscilloscopes (2 &agrave; 5 kV). On remarquera qu'ils ne peuvent pas d&eacute;biter beaucoup de courant (les tensions mises en jeu ne permettent pas d'utiliser des condensateurs de forte valeur), et donc, ils sont plut&ocirc;t destin&eacute;s &agrave; des applications quasi statiques.<P></OL><P>&nbsp;<LI><H4><A NAME="D35">DIODES &Agrave; AVALANCHE CONTR&Ocirc;L&Eacute;E.</A></H4>Les diodes de redressement standard ne sont pas garanties pour fonctionner au del&agrave; de la tension V<SUB>R</SUB> sp&eacute;cifi&eacute;e. Si on utilise des diodes standard dans des milieux parasit&eacute;s, il se peut qu'on d&eacute;passe momentan&eacute;ment la tension inverse maxi et qu'on d&eacute;truise la diode.<P>Certaines applications ont besoin de diodes qui ne soient pas d&eacute;truites par une entr&eacute;e en avalanche.<P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D36">Caract&eacute;ristiques physiques.</A></FONT></H5>Les diodes &agrave; avalanche contr&ocirc;l&eacute;es sont fabriqu&eacute;es dans du silicium de meilleure qualit&eacute; que les diodes standard&nbsp;: meilleure homog&eacute;n&eacute;it&eacute; du cristal, traitement de surface pouss&eacute; limitant les courants de fuite <P>La r&eacute;sistivit&eacute; du silicium est ainsi plus homog&egrave;ne, et lorsque le ph&eacute;nom&egrave;ne d'avalanche se produit, c'est dans tout le volume du cristal qui peut alors supporter des puissances tr&egrave;s &eacute;lev&eacute;es pendant quelques dizaines de &#181;s.<P>Ces diodes sont s&eacute;v&egrave;rement tri&eacute;es en fin de fabrication pour d&eacute;tecter les d&eacute;fauts &eacute;ventuels.<P>On sp&eacute;cifie en plus des I<SUB>R</SUB> et V<SUB>R</SUB> standards une tension inverse maxi pour un courant inverse donn&eacute;.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D37">Protection contre les surtensions.</A></FONT></H5>Une des applications est l'utilisation dans des milieux parasit&eacute;s&nbsp;: des surtensions br&egrave;ves (quelques &#181;s) d'une amplitude tr&egrave;s sup&eacute;rieure &agrave; la tension V<SUB>R</SUB> de la diode peuvent appara&icirc;tre&nbsp;: la diode va partir en avalanche, et limiter la surtension parasite. Ce ph&eacute;nom&egrave;ne ne sera pas destructif car la diode est con&ccedil;ue pour fonctionner en avalanche sans casser.<P>Il y a une double fonction d'autoprotection (la diode n'est pas d&eacute;truite), et de protection de l'environnement de cette diode (&eacute;cr&ecirc;tage de la surtension).<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D38">Mise en s&eacute;rie de diodes.</A></FONT></H5>Lorsqu'on veut bloquer des fortes tensions sans faire appel &agrave; des diodes sp&eacute;ciales haute tension (ch&egrave;res et difficiles &agrave; se procurer), on peut mettre en s&eacute;rie plusieurs diodes dont la somme des V<SUB>R</SUB> sera sup&eacute;rieure &agrave; la tension &agrave; bloquer.<P>Si on met en s&eacute;rie des diodes ordinaires, les tensions ne vont pas se r&eacute;partir de fa&ccedil;on &eacute;gale pour toutes les diodes comme le montre la Fig. 20.<P><CENTER><IMG SRC="DIODE.FIG/DIODE32.GIF"></CENTER><CENTER><P>Fig. 20. Caract&eacute;ristiques de deux diodes.</CENTER>Si on met les deux diodes de cet exemple en s&eacute;rie, sans autres composants en parall&egrave;le, le courant de fuite sera le m&ecirc;me pour les deux diodes, et tel que V<SUB>D1</SUB> + V<SUB>D2</SUB> = U, tension totale &agrave; bloquer&nbsp;; V<SUB>D1</SUB> et V<SUB>D2</SUB> sont les tensions aux bornes des diodes D1 et D2 pour le courant de fuite commun I<SUB>R</SUB>.<P>La diode D1 qui fuit plus que l'autre &agrave; tension donn&eacute;e va imposer un courant I<SUB>R</SUB> entra&icirc;nant une tension aux bornes de D2 sup&eacute;rieure &agrave; la tension de claquage V<SUB>R</SUB>&nbsp;: D2 va &ecirc;tre d&eacute;truite par avalanche.<P>Dans le cas g&eacute;n&eacute;ral o&ugrave; on met plusieurs diodes en s&eacute;rie, la rupture de la premi&egrave;re entra&icirc;ne la destruction en cha&icirc;ne de toutes les autres diodes.<P>La solution est dans les diodes &agrave; avalanche contr&ocirc;l&eacute;e&nbsp;: les courants de fuite (hors porteurs minoritaires) sont tr&egrave;s r&eacute;duits par construction, et une ou plusieurs diodes peuvent rentrer en avalanche sans probl&egrave;mes. Le courant de fuite &eacute;tant faible, la puissance dissip&eacute;e restera dans les limites admissibles par le composant.<P></OL><P>&nbsp;<LI><H4><A NAME="D39">DIODES DE REDRESSEMENT RAPIDES.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D40">Notions de charge recouvr&eacute;e.</A></FONT></H5>Nous avons d&eacute;j&agrave; mentionn&eacute; le ph&eacute;nom&egrave;ne de diffusion au travers de la jonction PN&nbsp;: les &eacute;lectrons majoritaires de la zone N franchissent la jonction et tendent &agrave; neutraliser les trous de la zone P et vice versa.<P>Quand la jonction est polaris&eacute;e en direct, le champ &eacute;lectrique externe s'oppose au champ &eacute;lectrique interne cr&eacute;e par les ions d&eacute;poss&eacute;d&eacute;s de leur &eacute;lectron (zone N) ou trou (zone P) libres, et permet ainsi une plus grande diffusion des porteurs majoritaires dans la r&eacute;gion de type oppos&eacute; o&ugrave; ils deviennent minoritaires. Ils se recombinent alors avec une charge de signe oppos&eacute;.<P>Ce ph&eacute;nom&egrave;ne de recombinaison n'est pas instantann&eacute;&nbsp;: les porteurs ont une dur&eacute;e de vie t &eacute;gale &agrave; environ 1ms dans le silicium. Il existe donc dans le cristal des charges en exc&egrave;s de part et d'autre de la jonction, &agrave; la mani&egrave;re de charges pr&eacute;sentes sur les armatures d'un condensateur.<P>On associe d'ailleurs &agrave; cette charge, appel&eacute;e <STRONG>charge stock&eacute;e</STRONG>, une capacit&eacute; appel&eacute;e<STRONG> capacit&eacute; de diffusion</STRONG>.<P>Si on inverse brusquement la polarit&eacute; aux bornes de la diode pour la bloquer, ces porteurs vont se comporter de la m&ecirc;me mani&egrave;re que les porteurs minoritaires en r&eacute;gime inverse &eacute;tabli&nbsp;: ils vont &ecirc;tre attir&eacute;s de l'autre c&ocirc;t&eacute; de la jonction par le champ &eacute;lectrique externe et vont former un courant intense qui va s'ajouter au courant de fuite I<SUB>s</SUB>, jusqu'&agrave; ce que la charge stock&eacute;e disparaisse.<P>Ce courant va d&eacute;cro&icirc;tre jusqu'&agrave; devenir nul pendant un temps t<SUB>RR</SUB> appel&eacute; <STRONG>temps de recouvrement inverse</STRONG>.<P>La charge stock&eacute;e est d'autant plus importante que le dopage est important. Le dopage intervenant directement dans la conductivit&eacute; du cristal, il se pose le probl&egrave;me pour les diodes de puissance qui n&eacute;cessitent une conductivit&eacute;, et donc un dopage importants.<P>Pour diminuer la charge stock&eacute;e dans ces composants, on utilise des pi&egrave;ges recombinants, qui sont souvent des atomes d'or. Ils diminuent la dur&eacute;e de vie des porteurs, ce qui induit une charge stock&eacute;e plus faible.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D41">Utilisation.</A></FONT></H5>Ces diodes sont utilis&eacute;es en &eacute;lectronique de puissance partout o&ugrave; l'on doit commuter tr&egrave;s rapidement des courants importants. Elles sont le compl&eacute;ment indispensable des transistors de puissance rapides.<P>Des diodes standard sont inutilisables dans ces cas l&agrave; car elles sont trop lentes. Lors de la commutation des transistors, elles se comporteraient comme des court circuits (pendant le temps de recouvrement inverse), ce qui entra&icirc;nerait des surcourants dans les transistors, et leur destruction plus ou moins rapide.<P></OL><P>&nbsp;<LI><H4><A NAME="D42">DIODES DE SIGNAL.</A></H4>Les diodes pr&eacute;c&eacute;demment &eacute;tudi&eacute;es font intervenir des courants et tensions non n&eacute;gligeables. Les diodes de signal sont utilis&eacute;es dans des applications &agrave; bas niveaux de courants et tensions.<P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D43">Carct&eacute;ristiques physiques.</A></FONT></H5>Les diodes de signal n'ont pas besoin de tenir des fortes tensions inverses&nbsp;: par construction, elles pourront avoir une capacit&eacute; parasite faible, et donc fonctionner &agrave; des fr&eacute;quences &eacute;lev&eacute;es.<P>Ces caract&eacute;ristiques sont obtenues gr&acirc;ce &agrave; une surface de jonction r&eacute;duite et un faible dopage (diminution des charges stock&eacute;es).<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D44">D&eacute;tecteur de cr&ecirc;te.</A></FONT></H5>Ce dispositif permet de m&eacute;moriser la valeur cr&ecirc;te d'un signal. Il est tr&egrave;s utilis&eacute; en instrumentation.<P>C'est en fait un redresseur simple alternance avec filtrage dont la charge est quasi nulle (aux courants de fuite pr&egrave;s)&nbsp;: la constante de temps de d&eacute;charge du condensateur est th&eacute;oriquement infinie, (tr&egrave;s grande en pratique).<P>Il se charge donc &agrave; la valeur cr&ecirc;te (moins la tension de seuil de la diode) et reste charg&eacute; &agrave; cette valeur.<P>La r&eacute;sitance R sert &agrave; limiter le courant de charge du condensateur &agrave; une valeur raisonnable pour le g&eacute;n&eacute;rateur d'attaque.<P>Lorsque la tension e est sup&eacute;rieure &agrave; la tension aux bornes du condensateur U plus la tension de coude de la diode, celle ci conduit et charge le condensateur &agrave; travers la r&eacute;sistance R.<P>A noter que tel quel, ce montage est inexploitable pour des petits signaux&nbsp;: la tension m&eacute;moris&eacute;e par la diode et le condensateur est inf&eacute;rieure &agrave; la valeur cr&ecirc;te du signal d'entr&eacute;e de la tension de seuil de la diode.<P>Il existe une version am&eacute;lior&eacute;e avec amplificateur op&eacute;rationnel qui pallie cet inconv&eacute;nient. Il faut aussi adjoindre &agrave; ce montage un syt&egrave;me permettant de d&eacute;charger le condensateur pour faire une nouvelle mesure.<P><CENTER><IMG SRC="DIODE.FIG/DIODE33.GIF"></CENTER><P><CENTER><IMG SRC="DIODE.FIG/DIODE34.GIF"></CENTER><CENTER><P>Fig. 21. D&eacute;tecteur de cr&ecirc;te.</CENTER><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D45">D&eacute;tection AM.</A></FONT></H5>En radio diffusion, on ne peut pas &eacute;mettre correctement un signal audible (20Hz-20kHz) directement sous forme d'une onde radio-&eacute;lectrique&nbsp;: il faut passer par un signal haute fr&eacute;quence (Fig. 22.).<P><CENTER><IMG SRC="DIODE.FIG/DIODE35.GIF"></CENTER><CENTER><P>Fig. 22. Signal HF modul&eacute; en amplitude.</CENTER><CENTER><IMG SRC="DIODE.FIG/DIODE36.GIF"></CENTER><CENTER><P>Fig. 23. D&eacute;tecteur  grandes ondes .</CENTER>Le signal haute fr&eacute;quence (quelques centaines de kHz), qu'on appelle la porteuse est modul&eacute; en amplitude par le signal audio (basse fr&eacute;quence) &agrave; &eacute;mettre. A l'arriv&eacute;e ( le poste &agrave; transistors &nbsp;!), on doit s&eacute;parer les deux signaux. On le fait tr&egrave;s simplement avec une diode et un condensateur (Fig. 23.).<P><CENTER><IMG SRC="DIODE.FIG/DIODE37.GIF"></CENTER><CENTER><P>Fig. 24. Signal d&eacute;modul&eacute;.</CENTER>Sans la r&eacute;sistance R, on aurait un d&eacute;tecteur de cr&ecirc;te comme pr&eacute;c&eacute;demment. On d&eacute;termine cette r&eacute;sistance de mani&egrave;re &agrave; ce que la constante de temps RC soit petite devant la p&eacute;riode de la porteuse, et grande devant la p&eacute;riode du signal &agrave; &eacute;mettre&nbsp;: on arrive ainsi &agrave; reconstituer le signal basse fr&eacute;quence (BF)&nbsp;: c'est la courbe en gras de la Fig. 24.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D46">Thermom&egrave;tres. Compensation thermique.</A></FONT></H5>C'est une utilisation importante des diodes. La tension directe des jonctions PN en silicium est affect&eacute;e d'un coefficient de temp&eacute;rature n&eacute;gatif (environ -2mV/&#176;C).<P>Certains montages &agrave; transistors n&eacute;c&eacute;ssitent une d&eacute;rive minimum en temp&eacute;rature. On peut arriver &agrave; compenser cette d&eacute;rive &agrave; l'aide d'une diode coupl&eacute;e thermiquement au transistor et plac&eacute;e judicieusement dans son circuit de base (voir chapitre sur les transistors).<P>Cette d&eacute;rive en temp&eacute;rature peut aussi &ecirc;tre utilis&eacute;e comme  thermom&egrave;tre  sur un montage. Lorsque la diode d&eacute;tecte des temp&eacute;ratures trop &eacute;lev&eacute;es, elle peut commander un circuit qui va (par exemple) couper certaines fonctions du montage (autoprotection). Cette fonction est tr&egrave;s utilis&eacute;e dans les composants int&eacute;gr&eacute;s.<P></OL></OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="D47">DIODES SP&Eacute;CIALES.</A></H3><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="D48">DIODES ZENER.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D49">Caract&eacute;ristique.</A></FONT></H5><CENTER><IMG SRC="DIODE.FIG/DIODE38.GIF"></CENTER><CENTER><P>Fig. 25. Caract&eacute;ristique d'une diode z&eacute;ner.</CENTER>Nous avons <A HREF="#D12">d&eacute;j&agrave; parl&eacute;</A> de l'effet z&eacute;ner. Il concerne la caract&eacute;ristique inverse de la diode.<P>En direct, une diode z&eacute;ner se comporte comme une  mauvaise  diode normale.<P>En inverse, on fait en sorte que par construction l'effet z&eacute;ner et / ou d'avalanche se produise &agrave; une tension bien d&eacute;termin&eacute;e, et ne soit pas destructif. La caract&eacute;ristique inverse pr&eacute;sente alors l'allure d'un g&eacute;n&eacute;rateur de tension &agrave; faible r&eacute;sistance interne.<P>En g&eacute;n&eacute;ral, les constructeurs sp&eacute;cifient&nbsp;:<P> - la tension d'avalanche V<SUB>zt</SUB> pour un courant d&eacute;termin&eacute; I<SUB>zt</SUB>. (les valeurs de tension sont normalis&eacute;es).<P> - &agrave; ce point de fonctionnement V<SUB>zt</SUB> / I<SUB>zt</SUB>, on donne la r&eacute;sistance dynamique de la diode r<SUB>zt</SUB>.<P> - le courant I<SUB>zm</SUB> pour lequel la puissance dissip&eacute;e dans le composant sera le maximum admissible.<P> - on indique aussi le coefficient de variation en temp&eacute;rature de la tension V<SUB>zt</SUB>.<P>En dessous de V<SUB>zt</SUB> = 5V, c'est l'effet z&eacute;ner qui pr&eacute;domine. Au dessus, c'est l'effet d'avalanche.<P>L'effet z&eacute;ner est affect&eacute; d'un coefficient de temp&eacute;rature n&eacute;gatif (V<SUB>zt</SUB> diminue quand la temp&eacute;rature augmente), et l'effet d'avalanche d'un coefficient positif. Les diodes ayant une tension V<SUB>zt</SUB> d'environ 5V ont un coefficient de temp&eacute;rature nul, car les deux ph&eacute;nom&egrave;nes se produisent de mani&egrave;re &eacute;quilibr&eacute;e, et leurs effets se compensent.<P>L'effet d'avalanche est plus  franc  que l'effet z&eacute;ner, ce qui fait que le coude de tension inverse est plus arrondi pour les diodes z&eacute;ner de faible tension.<P>Les diodes optimales en terme d'arrondi de coude et de r&eacute;sistance dynamique ont des tensions z&eacute;ner voisines de 6 &agrave; 7V.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D50">Sch&eacute;ma &eacute;quivalent.</A></FONT></H5>Pour simplifier les calculs, et comme pour la diode, on va d&eacute;finir un sch&eacute;ma &eacute;quivalent approchant la r&eacute;alit&eacute;.<P>Si on utilise le composant suffisamment loin du coude, le sch&eacute;ma suivant mod&eacute;lise bien le comportement d'une diode z&eacute;ner&nbsp;:<P><CENTER><IMG SRC="DIODE.FIG/DIODE39.GIF"></CENTER><CENTER><P>Fig. 26. Sch&eacute;ma &eacute;quivalent de la diode z&eacute;ner</CENTER>On d&eacute;finit une tension de coude Vzo, et une r&eacute;sistance interne constante Rz.<P>Ce sch&eacute;ma sera &agrave; utiliser avec beaucoup de prudence sur des z&eacute;ners de faible tension (&lt; 5V)&nbsp;: leur coude est tr&egrave;s arrondi, et la r&eacute;sistance dynamique varie beaucoup avec le courant. Pour des tensions sup&eacute;rieures &agrave; 5V, il n'y aura en g&eacute;n&eacute;ral pas de probl&egrave;mes.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D51">R&eacute;gulation de tension.</A></FONT></H5>De par leurs caract&eacute;ristiques de g&eacute;n&eacute;rateur de tension, ces diodes sont id&eacute;ales pour r&eacute;guler des tension continues ayant une ondulation r&eacute;siduelle non n&eacute;gligeable (cas des tensions redress&eacute;es filtr&eacute;es).<P><CENTER><IMG SRC="DIODE.FIG/DIODE40.GIF"></CENTER><CENTER><P>Fig. 27. R&eacute;gulation de tension avec diode z&eacute;ner.</CENTER>Il est n&eacute;cessaire d'intercaler une r&eacute;sistance (ou un g&eacute;n&eacute;rateur de courant) entre le g&eacute;n&eacute;rateur de tension filtr&eacute;e et la z&eacute;ner de r&eacute;gulation&nbsp;: ces deux &eacute;l&eacute;ments ayant des caract&eacute;ristiques de g&eacute;n&eacute;rateurs de tension &agrave; faible r&eacute;sitance interne, on ne peut pas les brancher directement l'un sur l'autre sans les d&eacute;truire.<P>Pour que la z&eacute;ner fonctionne et assure son r&ocirc;le de r&eacute;gulateur, il faut qu'un courant I<sub>z</sub> non nul circule en permanence dans ce composant, et ce quelles que soient les variations de la tension d'entr&eacute;e V<SUB>c</SUB> et de la charge R<SUB>u</SUB>.<P>La r&eacute;sistance R assure donc le r&ocirc;le de <STRONG>polarisation</STRONG> de la z&eacute;ner, et elle sera calcul&eacute;e pour que la condition &eacute;nonc&eacute;e ci-dessus soit remplie. Il faudra aussi veiller &agrave; ce que le courant I<sub>z</sub> ne d&eacute;passe pas le courant I<SUB>zm</SUB>, sous peine de d&eacute;truire le r&eacute;gulateur.<P><CENTER><IMG SRC="DIODE.FIG/DIODE41.GIF"></CENTER><CENTER><P>Fig. 28. Sch&eacute;ma &eacute;quivalent du r&eacute;gulateur</CENTER>Lorsque la polarisation est correcte, on peut faire le sch&eacute;ma &eacute;quivalent du montage. La tension d'entr&eacute;e du r&eacute;gulateur a &eacute;t&eacute; scind&eacute;e en une tension continue (la tension moyenne aux bornes du condensateur), et une tension alternative (l'ondulation).<P>On peut d&eacute;finir deux coefficients de stabilisation pour caract&eacute;riser ce montage. En effet, il est loin d'&ecirc;tre parfait, et la tension de sortie va varier lorsque la tension d'entr&eacute;e et / ou la charge vont varier. On distingue deux coefficients&nbsp;:<P><STRONG> - Stabilisation amont</STRONG>&nbsp;: ce coefficient est repr&eacute;sentatif de la sensibilit&eacute; du montage aux variations de la tension non r&eacute;gul&eacute;e, et ceci &agrave; <STRONG>charge constante</STRONG>. Si on utilise les notations de la Fig. 27, c'est le rapport (<IMG SRC="../BASE/ICONES/DELTA.GIF">V<sub>z</sub>/<IMG SRC="../BASE/ICONES/DELTA.GIF">V<SUB>c</SUB>)I<sub>u</sub> = cte.<P><STRONG> - Stabilisation aval</STRONG>&nbsp;: ce coefficient est repr&eacute;sentatif de la variation de la tension de sortie quand le courant dans la charge varie (R<SUB>u</SUB> varie de &#177;<IMG SRC="../BASE/ICONES/DELTA.GIF">R<SUB>u</SUB>), et ceci &agrave; tension d'entr&eacute;e constante. C'est le rapport (<IMG SRC="../BASE/ICONES/DELTA.GIF">V<sub>z</sub>/<IMG SRC="../BASE/ICONES/DELTA.GIF">I<sub>u</sub>)V<SUB>c</SUB> = cte, soit en fait,<STRONG> l'imp&eacute;dance de sortie du montage</STRONG>. Ce param&egrave;tre est tr&egrave;s important dans tous les r&eacute;gulateurs de tension.<P>Il est plus simple pour calculer ces coefficients d'utiliser le <A HREF="../OUTILS/COURS.HTM#O60" target=_blank>sch&eacute;ma &eacute;quivalent alternatif petits signaux</A>. On retire alors toutes les sources de tension continues.<P><P><CENTER><IMG SRC="DIODE.FIG/DIODE42.GIF"></CENTER><CENTER><P>Fig. 29. Sch&eacute;ma &eacute;quivalent petits signaux</CENTER>Pour le coefficient de stabilisation amont, on a&nbsp;:<P><CENTER><IMG SRC="DIODE.FIG/DIODE43.GIF"></CENTER><P>Comme en g&eacute;n&eacute;ral R<SUB>u</SUB> &gt;&gt; Rz, cette formule devient&nbsp;:<P><CENTER><IMG SRC="DIODE.FIG/DIODE44.GIF"></CENTER><P>On voit le dilemme&nbsp;: plus R est grand, plus la stabilisation amont est bonne, mais en contrepartie, quel g&acirc;chis&nbsp;! Il faudrait pr&eacute;voir des tensions filtr&eacute;es tr&egrave;s grandes par rapport aux tensions r&eacute;gul&eacute;es pour avoir un bon coefficient de r&eacute;gulation. Cela ferait beaucoup d'&eacute;nergie perdue dans R. Pour pallier cet inconv&eacute;nient, on remplace R par un g&eacute;n&eacute;rateur de courant&nbsp;: la chute de tension &agrave; ses bornes pourra &ecirc;tre petite, et par contre, sa r&eacute;sistance interne (celle qui va servir pour le calcul en remplacement de R) sera tr&egrave;s grande&nbsp;: on a les deux avantages, une tr&egrave;s bonne r&eacute;gulation et un bon rendement.<P>Le coefficient de stabilisation aval est &eacute;gal &agrave; l'imp&eacute;dance de sortie du montage&nbsp;; c'est la r&eacute;sistance du g&eacute;n&eacute;rateur de Th&eacute;venin &eacute;quivalent, soit&nbsp;:<P><CENTER><IMG SRC="DIODE.FIG/DIODE45.GIF"></CENTER><P>R &eacute;tant souvent tr&egrave;s sup&eacute;rieur &agrave; Rz, on obtient&nbsp;:<P><CENTER><IMG SRC="DIODE.FIG/DIODE46.GIF"></CENTER><P>Dans ce cas, il n'y a pas grand chose &agrave; esp&eacute;rer d'un artifice quelconque pour am&eacute;liorer cette valeur, sauf &agrave; rajouter d'autre composants actifs comme des transistors.<P>En g&eacute;n&eacute;ral, on rajoute toutefois un condensateur en parall&egrave;le avec la z&eacute;ner&nbsp;: son imp&eacute;dance vient diminuer celle du montage aux fr&eacute;quences &eacute;lev&eacute;es. C'est avantageux si le montage aliment&eacute; a une consommation en courant avec des composantes &agrave; hautes fr&eacute;quences.  Ce condensateur diminue aussi le bruit interne de la z&eacute;ner qui est assez important.<P>Ce type d'alimentation est appel&eacute; <STRONG>r&eacute;gulateur shunt</STRONG>, car le courant de r&eacute;gulation I<sub>z</sub> est d&eacute;riv&eacute; &agrave; la masse.<P>En pratique, ces r&eacute;gulateurs sont utilis&eacute;s dans des montages simples n&eacute;cessitant peu de puissance.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D52">&Eacute;cr&ecirc;tage des surtensions.</A></FONT></H5>De par  leurs caract&eacute;ristiques, les diodes z&eacute;ner sont id&eacute;ales pour &eacute;cr&ecirc;ter des surtension (commutation de selfs ou autres) et sont donc toutes indiqu&eacute;es pour la protection d'autre semi-conducteurs sensibles a ces surtensions.<P>Certains composants comme les <STRONG>transils</STRONG> ont des caract&eacute;ristiques similaires aux z&eacute;ners, mais peuvent supporter des puissances cr&ecirc;te consid&eacute;rables pendant de courts instants. Ils sont utilis&eacute;s pour prot&eacute;ger les installations co&ucirc;teuse contre la foudre et les parasites d'&eacute;quipements industriels (gros moteurs, relais de puissance, commutateurs statiques ).<P></OL><P>&nbsp;<LI><H4><A NAME="D53">DIODES &Eacute;LECTROLUMINESCENTES.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D54">Caract&eacute;ristique.</A></FONT></H5>Ces diodes sp&eacute;cifiques &agrave; base d'arseniure de gallium ont la propri&eacute;t&eacute; d'&eacute;mettre de la lumi&egrave;re dans une bande de fr&eacute;quence d&eacute;termin&eacute;e par les caract&eacute;ristiques du mat&eacute;riau employ&eacute; quand elles sont travers&eacute;es par un courant direct.<P>Il en existe de diverses couleurs (jaune, orang&eacute;, rose, rouge, vert, infrarouges).<P>Leur rendement lumineux est assz faible. On les utilise avec un courant direct d'environ 10 &agrave; 20mA.<P>La tension de coude de ces composants est plus &eacute;lev&eacute;e que pour les diodes standard, et elle d&eacute;pend de la couleur. Elle va de 1,2 &agrave; 2V environ.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="D55">Utilisation.</A></FONT></H5>Les utilisations des Led sont de plus en plus nombreuses, car ces composants sont plus fiables que des lampes &agrave; incandescence, et leur rendement est un peu meilleur.<P>On les rencontre partout o&ugrave; on a besoin de t&eacute;moins lumineux, et de plus en plus, associ&eacute;es en matrices pour remplacer des grosses lampes (feux tricolores de circulation par exemple), ou pour faire des panneaux d'affichage &eacute;lectroniques (heure, temp&eacute;rature, publicit&eacute;s diverses ).<P>Les diodes &agrave; infrarouges servent beaucoup dans les t&eacute;l&eacute;commandes d'appareils TV / HIFI. On les utilise alors avec des forts courants puls&eacute;s.<P></OL><P>&nbsp;<LI><H4><A NAME="D56">AUTRES.</A></H4>Il existe encore beaucoup d'autres vari&eacute;t&eacute;s de diodes. Citons entres autres&nbsp;:<P> - les diodes Schottky, &agrave; jonction m&eacute;tal / semi-conducteur&nbsp;: cette jonction h&eacute;t&eacute;rog&egrave;ne est caract&eacute;ris&eacute;e par l'absence de stockage des charges, elle est donc tr&egrave;s rapide. Elle est tr&egrave;s utilis&eacute;e dans les circuits logiques rapides (TTL Schottky).<P> - les diodes varicap&nbsp;: on utilise la variation de la capacit&eacute; de jonction avec la polarisation inverse dans des oscillateurs ou des circuits d'accord. On fait alors facilement varier la tension d'oscillation ou d'accord en modifiant la tension de polarisation.<P> <P> <P></OL></OL></BODY></HTML>