<HTML><HEAD><TITLE>OUTILS.HTM</TITLE></HEAD><BODY><CENTER><IMG SRC="../BASE/ICONES/NAV.GIF"></CENTER><P align=center>Si votre &eacute;cran ne se pr&eacute;sente pas comme ceci, <A HREF="OUTILS.HTM" target="_top"> cliquez l&agrave; </A><OL TYPE=I><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="O01">LES DIP&Ocirc;LES.</A></H3><P><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="O02">D&Eacute;FINITIONS. CLASSIFICATION.</A></H4>Un <STRONG>dip&ocirc;le</STRONG> est un <STRONG>syst&egrave;me accessible par deux bornes</STRONG> dans lequel peut <STRONG>circuler un courant &eacute;lectrique</STRONG>.<P>Pour qu'un courant puisse circuler dans un dip&ocirc;le, il faut brancher celui-ci sur un autre dip&ocirc;le.<P>La classification actif / passif est difficile &agrave; faire, car quelle que soit la d&eacute;finition utilis&eacute;e, on trouve toujours un contre exemple&nbsp;! Par exemple, un crit&egrave;re &eacute;nerg&eacute;tique (les actifs peuvent fournir de l'&eacute;nergie, contrairement aux passifs) &eacute;limine les semi-conducteurs de la cat&eacute;gorie des actifs <P>Les d&eacute;finitions propos&eacute;es ne sont donc pas &agrave; prendre comme argent comptant. Elles donnent une tendance qui sera entach&eacute;e d'exceptions&nbsp;!<P>Nous allons &eacute;tudier ici des dip&ocirc;les  de base . Dans la pratique, on trouvera ces dip&ocirc;les tels quels, mais on pourra aussi en construire d'autres en associant en s&eacute;rie et en parall&egrave;le ces dip&ocirc;les de base. Pour que l'&eacute;l&eacute;ment ainsi cr&eacute;&eacute; soit un dip&ocirc;le, il doit r&eacute;pondre &agrave; la d&eacute;finition donn&eacute;e ci-dessus.<P><P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O03">Dip&ocirc;le passif.</A></font></H5>Si on branche ensemble deux dip&ocirc;les identiques et qu'<STRONG>aucun courant permanent ne passe</STRONG> entre les deux dip&ocirc;les quel que soit le sens du branchement, ces dip&ocirc;les sont passifs. Ex : r&eacute;sistances, thermistances, selfs, condensateurs <P>Il va circuler du courant dans un dip&ocirc;le passif si on applique une diff&eacute;rence de potentiel entre ses bornes.<P>R&eacute;ciproquement, si on fait circuler un courant dans ce dip&ocirc;le, il va appara&icirc;tre une tension &agrave; ses bornes.<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O04">Dip&ocirc;le actif.</A></font></H5>Si on branche un dip&ocirc;le sur une r&eacute;sistance et qu'un courant permanent circule, alors ce dip&ocirc;le est actif. ex : pile, accumulateur, alternateur <P>Bien qu'ils ne r&eacute;pondent pas intrins&egrave;quement &agrave; la d&eacute;finition ci-dessus, on classera &eacute;galement dans cette cat&eacute;gorie les semi-conducteurs et circuits int&eacute;gr&eacute;s ayant des <A HREF="COURS.HTM#O16" target=COURS>caract&eacute;ristiques</A> de g&eacute;n&eacute;rateurs&nbsp;: diodes, z&eacute;ners, transistors <P><P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O05">Source de tension parfaite.</A></font></H5>La repr&eacute;sentation est la suivante&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS01.GIF"></CENTER><CENTER><P>Fig. 1. Sources de tension parfaites.<P></CENTER>Une source de tension est un dip&ocirc;le actif&nbsp;; elle peut &ecirc;tre continue ou alternative. Dans tous les cas, un dip&ocirc;le est une source de tension s'il maintient la <STRONG>m&ecirc;me tension</STRONG> entre ses bornes, et ce <STRONG>quel que soit le courant qu'il d&eacute;bite ou qu'il absorbe</STRONG>&nbsp;; c'est une source de tension continue si cette tension est fixe dans le temps, et une source de tension alternative si la tension varie dans le temps de fa&ccedil;on p&eacute;riodique.<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O06">Source de courant parfaite.</A></font></H5>La d&eacute;finition est la m&ecirc;me que pour la source de tension, sauf que la source de courant d&eacute;bite le <STRONG>m&ecirc;me courant quel que soit la tension pr&eacute;sente &agrave; ses bornes</STRONG>.<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS02.GIF"></CENTER><CENTER><P>Fig. 2. Sources de courant parfaites<P></CENTER><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O07">Sources r&eacute;elles.</A></font></H5>Une source de tension r&eacute;elle aura en r&eacute;alit&eacute; une imp&eacute;dance s&eacute;rie non nulle, et une source de courant r&eacute;elle une imp&eacute;dance parall&egrave;le non nulle. Les sch&eacute;mas deviennent&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS03.GIF"></CENTER><CENTER><P>Fig. 3. Sources de tension et courant r&eacute;elles.<P></CENTER><P></UL><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O08">Dip&ocirc;le lin&eacute;aire.</A></font></H5>Un dip&ocirc;le est lin&eacute;aire si la relation entre la tension &agrave; ses bornes et le courant qui y circule est lin&eacute;aire. Ex : r&eacute;sistance.<P><P></OL><P>&nbsp;<LI><H4><A NAME="O09">CONVENTIONS DE SIGNE.</A></H4>Les conventions de signe commun&eacute;ment admises pour repr&eacute;senter la tension aux bornes d'un dip&ocirc;le et le courant y circulant font la diff&eacute;rence entre g&eacute;n&eacute;rateurs et r&eacute;cepteurs.<P>Il faut noter ici que le sens du courant ainsi d&eacute;fini est totalement <STRONG>arbitraire dans l'absolu</STRONG>, et ne repr&eacute;sente qu'une <STRONG>convention</STRONG>.<STRONG> </STRONG>En pratique, physiquement, c'est la circulation des &eacute;lectrons qui forme le courant, et celle-ci se fait dans le sens oppos&eacute; au sens de circulation conventionnel du courant&nbsp;!<P>Lorsqu'on calcule les &eacute;l&eacute;ments d'un circuit &eacute;lectrique, <STRONG>on peut se fixer une convention diff&eacute;rente</STRONG>, mais il faut garder la <STRONG>m&ecirc;me pour tout le circuit</STRONG> &eacute;lectrique &eacute;tudi&eacute;.<P><P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O10">Convention g&eacute;n&eacute;rateur.</A></font></H5><CENTER><IMG SRC="OUTILS.FIG/OUTILS04.GIF"></CENTER><CENTER><P>Fig. 4. Dip&ocirc;le g&eacute;n&eacute;rateur.<P></CENTER>Un dip&ocirc;le est <STRONG>g&eacute;n&eacute;rateur</STRONG> lorsqu'il <STRONG>fournit de l'&eacute;nergie</STRONG> (m&ecirc;me de mani&egrave;re tr&egrave;s temporaire) au circuit sur lequel il est connect&eacute;.<P>Dans ce cas, le courant <STRONG>sort par le p&ocirc;le positif</STRONG> du dip&ocirc;le g&eacute;n&eacute;rateur. Les fl&egrave;ches repr&eacute;sentant tension et courant sont dans le m&ecirc;me sens.<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O11">Convention r&eacute;cepteur.</A></font></H5>Un dip&ocirc;le est un <STRONG>r&eacute;cepteur</STRONG> quand il <STRONG>consomme de l'&eacute;nergie </STRONG> (fournie par le circuit sur lequel il est connect&eacute;).<P>Dans ce cas, courant et tension sont orient&eacute;s en sens inverse. Le p&ocirc;le positif du dip&ocirc;le est celui par lequel <STRONG>rentre le courant</STRONG>.<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS05.GIF"></CENTER><CENTER><P>Fig. 5. Dip&ocirc;le r&eacute;cepteur<P></CENTER><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O12">Attention &agrave; la m&eacute;prise&nbsp;!</A></font></H5>Actif n'est pas synonyme de g&eacute;n&eacute;rateur, pas plus que passif n'est synonyme de r&eacute;cepteur, m&ecirc;me si c'est le cas le plus fr&eacute;quent. Il y a de nombreuses exceptions.<P>Certains dip&ocirc;les passifs (dits r&eacute;actifs&nbsp;: selfs, condensateurs) peuvent avoir <STRONG>temporairement</STRONG> un comportement de g&eacute;n&eacute;rateur et suivront cette convention de signe, alors que des dip&ocirc;les actifs sont parfois utilis&eacute;s comme r&eacute;cepteurs : on utilisera alors cette convention.<P>Si dans un sch&eacute;ma, le calcul du courant circulant dans un dip&ocirc;le actif et de la tension pr&eacute;sente &agrave; ses bornes indiquent que le courant <STRONG>rentre</STRONG> par le p&ocirc;le <STRONG>positif</STRONG>, alors ce dip&ocirc;le est utilis&eacute; en r&eacute;cepteur.<P>Exemple de composant passif utilis&eacute; comme g&eacute;n&eacute;rateur&nbsp;: le condensateur r&eacute;servoir, tr&egrave;s utilis&eacute; en &eacute;lectronique (filtrage des alimentations, d&eacute;couplage ).<P>Exemple de composant actif utilis&eacute; comme r&eacute;cepteur&nbsp;: batterie en phase de charge.<P><P></UL><P>&nbsp;<LI><H4><A NAME="O13">ASSOCIATION DE DIP&Ocirc;LES.</A></H4>Quand on connecte deux dip&ocirc;les ensemble, ils pr&eacute;sentent la m&ecirc;me tension &agrave; leurs bornes (!), et le courant entrant dans l'un est &eacute;gal au courant sortant de l'autre (dans une boucle ferm&eacute;e sans connections avec l'ext&eacute;rieur, le courant circule dans un seul sens !)<P><P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O14">Association passif / actif.</A></font></H5><CENTER><IMG SRC="OUTILS.FIG/OUTILS06.GIF"></CENTER><CENTER><P>Fig. 6. Association passif/actif<P></CENTER>Ce cas justifie la diff&eacute;rence de conventions entre g&eacute;n&eacute;rateur et r&eacute;cepteur : la tension aux bornes des deux dip&ocirc;les &eacute;tant la m&ecirc;me, il y en aura forc&eacute;ment un avec le courant dans le m&ecirc;me sens que la tension et l'autre avec le courant en sens inverse ! L'un d&eacute;livre de l'&eacute;nergie que l'autre absorbe.<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O15">Association actif / actif.</A></font></H5>Dans le cas o&ugrave; l'on branche deux dip&ocirc;les actifs ensemble, on ne peut pas toujours dire &agrave; priori si un des deux sera r&eacute;cepteur, et si oui, lequel. Dans ce cas, on fixe arbitrairement le sens du courant dans la boucle. Apr&egrave;s le calcul, si le courant est positif, l'hypoth&egrave;se &eacute;tait justifi&eacute;e, sinon, le sens du courant r&eacute;el est l'inverse de celui qui a &eacute;t&eacute; fix&eacute;.<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS07.GIF"></CENTER><CENTER><P>Fig. 7. Association actif/actif<P></CENTER>Le courant ainsi orient&eacute; sortira par le p&ocirc;le positif du dip&ocirc;le g&eacute;n&eacute;rateur. L'autre dip&ocirc;le actif est utilis&eacute; en r&eacute;cepteur (courant entrant par le p&ocirc;le positif).</OL><P><P><P>&nbsp;<LI><H4><A NAME="O16">CARACT&Eacute;RISTIQUE STATIQUE D'UN DIP&Ocirc;LE.</A></H4><P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O17">D&eacute;finition.</A></font></H5>La caract&eacute;ristique statique permet de d&eacute;crire <STRONG>tous</STRONG> les points de fonctionnement possibles <STRONG>en continu</STRONG> du dip&ocirc;le&nbsp;: quand on  applique une tension &agrave; ses bornes, le courant est d&eacute;fini, et vice versa. La repr&eacute;sentation de la caract&eacute;ristique est une courbe dans le plan (I, U).<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O18">Quadrants.</A></font></H5>Le domaine (I, U) est partag&eacute; par les axes en quatre quadrants&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS08.GIF"></CENTER><CENTER><P>Fig. 8. Les 4 quadrants d'une caract&eacute;ristique.<P></CENTER>Par habitude ou pour simplifier, on ne repr&eacute;sente souvent que le premier quadrant (I>0, U>0). En fait, la plupart des dip&ocirc;les ont une caract&eacute;ristique qui occupe au moins deux quadrants.<P>Les conventions I>0 et U>0 indiquent que les sens des courants sont conformes aux normes g&eacute;n&eacute;rateur ou r&eacute;cepteur selon le dip&ocirc;le.<P>Pour certains dip&ocirc;les, on est amen&eacute;s &agrave; pr&eacute;ciser la caract&eacute;ristique compl&egrave;te&nbsp;: par exemple, certaines alimentations stabilis&eacute;es r&eacute;glables de laboratoire ont un domaine de fonctionnement sp&eacute;cifi&eacute; dans un, deux ou quatre quadrants (on a des caract&eacute;ristiques diff&eacute;rentes en fonction du r&eacute;glage)&nbsp;; leur comportement en sera diff&eacute;rent.<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O19">Dip&ocirc;le passif.</A></font></H5><P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O20">R&eacute;sistance.</A></font></H5><CENTER><IMG SRC="OUTILS.FIG/OUTILS09.GIF"></CENTER><CENTER><P>Fig. 9. Caract&eacute;ristique de r&eacute;sistance.<P></CENTER>La relation I =f(U) est lin&eacute;aire (loi d'Ohm). La pente de la droite est &eacute;gale &agrave; 1/R.<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O21">Dip&ocirc;le passif non lin&eacute;aire.</A></font></H5><CENTER><IMG SRC="OUTILS.FIG/OUTILS10.GIF"></CENTER><CENTER><P>Fig. 10. Caract&eacute;ristique non lin&eacute;aire.<P></CENTER>La relation I =f(U) est quelconque. Ex : varistance, certains capteurs utilis&eacute;s en instrumentation </UL><P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O22">Dip&ocirc;le actif utilis&eacute; comme r&eacute;cepteur.</A></font></H5>Les composants actifs utilis&eacute;s comme r&eacute;cepteurs sont tr&egrave;s employ&eacute;s dans l'&eacute;lectronique analogique&nbsp;: on leur accordera une importance particuli&egrave;re.<P>Les raisonnements qui suivent sont faits avec des sources continues. Le raisonnement est strictement le m&ecirc;me avec des sources alternatives.<P><P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O23">Source de tension continue parfaite.</A></font></H5><CENTER><IMG SRC="OUTILS.FIG/OUTILS11.GIF"></CENTER><CENTER><P>Fig. 11. Source de tension continue parfaite.<P></CENTER>Une source de tension parfaite impose une tension constante aux bornes du dip&ocirc;le sur lequel elle est branch&eacute;e, et ce quel que soit le courant qu'elle absorbe. La caract&eacute;ristique est verticale.<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O24">Source de tension avec r&eacute;sistance s&eacute;rie.</A></font></H5>La tension augmente quand le courant impos&eacute; au dip&ocirc;le augmente. C'est la chute de tension cr&eacute;&eacute;e aux bornes de R par le courant qui est responsable de cette augmentation.<P>La pente de la courbe est &eacute;gale &agrave; l'inverse de la r&eacute;sistance interne du g&eacute;n&eacute;rateur, soit 1 / R.<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS12.GIF"></CENTER><CENTER><P>Fig. 12. Source de tension quelconque.<P></CENTER>Il convient de noter que dans ce cas, la caract&eacute;ristique est contenue dans un seul quadrant&nbsp;: si on prolongeait la caract&eacute;ristique dans le quadrant I<0, la source serait g&eacute;n&eacute;ratrice, et plus r&eacute;ceptrice comme on en a fait l'hypoth&egrave;se&nbsp;! C'est vrai pour tous les cas du paragraphe I.D.4.<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O25">Source de courant continu parfaite.</A></font></H5><CENTER><IMG SRC="OUTILS.FIG/OUTILS13.GIF"></CENTER><CENTER><P>Fig. 13. Source de courant parfaite.<P></CENTER>Un g&eacute;n&eacute;rateur de courant parfait impose un courant constant dans le dip&ocirc;le sur lequel il est branch&eacute;, quelle que soit la tension pr&eacute;sente &agrave; ses bornes. La caract&eacute;ristique obtenue est horizontale.<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O26">Source de courant avec r&eacute;sistance parall&egrave;le.</A></font></H5>Lorsque la tension aux bornes de la source de courant augmente, le courant qu'elle absorbe augmente, avec une pente &eacute;gale &agrave; 1 / R. En effet, la r&eacute;sistance interne en parall&egrave;le avec la source de courant absorbe un courant proportionnel &agrave; U qui vient s'ajouter &agrave; I<sub>o</sub>.<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS14.GIF"></CENTER><CENTER><P>Fig. 14. Source de courant quelconque.</UL></OL><P></CENTER><P><P>&nbsp;<LI><H4><A NAME="O27">DROITE DE CHARGE D'UN G&Eacute;N&Eacute;RATEUR.</A></H4>Un g&eacute;n&eacute;rateur (dans le sens g&eacute;n&eacute;rateur d'&eacute;nergie) est susceptible de faire circuler un courant dans un dip&ocirc;le passif. Il peut &ecirc;tre int&eacute;ressant de voir quelle tension ou quel courant il va d&eacute;livrer dans un dip&ocirc;le passif lorsque l'imp&eacute;dance de celui-ci varie.<P>Nous prendrons le cas g&eacute;n&eacute;ral des g&eacute;n&eacute;rateurs avec r&eacute;sistances internes.<P><P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O28">G&eacute;n&eacute;rateur de tension continue.</A></font></H5>Si on fait varier la r&eacute;sistance de charge R<sub>ch</sub> de 0 &agrave; l'infini, le courant dans la charge va passer du courant de court-circuit  (valeur maxi &eacute;gale &agrave; : I<sub>cc</sub> = E<sub>g</sub>/R<sub>g</sub> pour une tension U&nbsp;=&nbsp;0) &agrave; une valeur nulle correspondant &agrave; la tension &agrave; vide E<sub>g</sub> du g&eacute;n&eacute;rateur. La courbe reliant ces deux points est une droite de pente -1/R<sub>g</sub> , R<sub>g</sub> &eacute;tant la r&eacute;sistance interne du g&eacute;n&eacute;rateur : c'est la droite de charge du g&eacute;n&eacute;rateur.<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS15.GIF"></CENTER><CENTER><P>Fig. 15. Droite de charge d'un g&eacute;n&eacute;rateur de tension.<P></CENTER><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O29">G&eacute;n&eacute;rateur de courant continu.</A></font></H5><CENTER><IMG SRC="OUTILS.FIG/OUTILS16.GIF"></CENTER><CENTER><P>Fig. 16. Droite de charge d'un g&eacute;n&eacute;rateur de courant.<P></CENTER>Si on fait varier la r&eacute;sistance de charge R<sub>ch</sub> de 0 &agrave; l'infini, la tension aux bornes du g&eacute;n&eacute;rateur de courant va passer de 0 (avec un courant de court-circuit  &eacute;gal &agrave; I<sub>g</sub>) &agrave; une valeur maxi U  = R<sub>g</sub>I<sub>g</sub> pour un courant d&eacute;bit&eacute; nul. La pente de la droite de charge reliant ces deux points est &eacute;gale &agrave; -1/R<sub>g</sub>.<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O30">Remarque.</A></font></H5>Si on compare les deux figures pr&eacute;c&eacute;dentes, on remarque une &eacute;trange similitude des droites de charges du g&eacute;n&eacute;rateur de tension et de celui de courant&nbsp;! En fait, &agrave; partir du moment o&ugrave; un g&eacute;n&eacute;rateur pr&eacute;sente une imp&eacute;dance s&eacute;rie interne non nulle ou une imp&eacute;dance parall&egrave;le non infinie, la notion de g&eacute;n&eacute;rateur de courant ou de tension s'estompe. Il existe d'ailleurs une <A HREF="COURS.HTM#O62" target=COURS> transformation math&eacute;matique </A> qui permet de faire la conversion g&eacute;n&eacute;rateur de tension / g&eacute;n&eacute;rateur de courant. Toutefois, en fonction de la valeur de la pente de la droite de charge, on parlera plut&ocirc;t de g&eacute;n&eacute;rateur de courant ou bien de g&eacute;n&eacute;rateur de tension.<P>Par exemple, une batterie d'automobile pr&eacute;sente une imp&eacute;dance s&eacute;rie interne tellement faible qu'il serait ridicule de parler de g&eacute;n&eacute;rateur de courant, et &agrave; fortiori, de faire des calculs avec ce formalisme.</UL><P><P><P>&nbsp;<LI><H4><A NAME="O31">POINT DE POLARISATION.</A></H4>Si on associe un dip&ocirc;le r&eacute;cepteur avec un dip&ocirc;le g&eacute;n&eacute;rateur, on aura une tension et un courant bien d&eacute;termin&eacute;s dans ces dip&ocirc;les. Ce point doit appartenir &agrave; la fois &agrave; la caract&eacute;ristique du dip&ocirc;le r&eacute;cepteur et &agrave; la droite de charge du dip&ocirc;le g&eacute;n&eacute;rateur. C'est le point P d'intersection des deux courbes (Voir Fig. 17.).<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS17.GIF"></CENTER><CENTER><P>Fig. 17. Point de polarisation d'une r&eacute;sistance.<P></CENTER>Ce point de fonctionnement en continu est appel&eacute; point de polarisation du dip&ocirc;le r&eacute;cepteur.<P><P><P>&nbsp;<LI><H4><A NAME="O32">DIP&Ocirc;LES NON LIN&Eacute;AIRES.<STRONG></A></H4></STRONG><P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O33">N&Eacute;CESSIT&Eacute; DE LIN&Eacute;ARISER.</A></font></H5>Pour calculer les tensions et courants de circuits &eacute;lectriques simples compos&eacute;s de g&eacute;n&eacute;rateurs et de r&eacute;sistances, on applique la loi d'Ohm et on obtient un syst&egrave;me d'&eacute;quations lin&eacute;aires permettant de trouver la solution.<P>Les composants &agrave; semi-conducteurs ont, quant &agrave; eux, des caract&eacute;ristiques non lin&eacute;aires. Or, dans un circuit complexe, on trouvera souvent les valeurs de courants et tensions en r&eacute;solvant un syst&egrave;me de plusieurs &eacute;quations &agrave; plusieurs inconnues. La r&eacute;solution de tels probl&egrave;mes est tr&egrave;s difficile quand on a affaire &agrave; des &eacute;quations non lin&eacute;aires.<P>Pour pallier cet inconv&eacute;nient, on va s'arranger pour utiliser les composants non lin&eacute;aires sur une tr&egrave;s petite portion de leur caract&eacute;ristique, et on va assimiler cette portion &agrave; une droite (droite qui sera la tangente &agrave; la caract&eacute;ristique au niveau de la portion utilis&eacute;e).<P>On va ainsi d&eacute;finir des param&egrave;tres <STRONG>dynamiques</STRONG> (ou <STRONG>diff&eacute;rentiels</STRONG>) du composant non lin&eacute;aire, ces param&egrave;tres &eacute;tant <STRONG>utilisables uniquement sur la portion de caract&eacute;ristique &eacute;tudi&eacute;e</STRONG> ; on pourra utiliser ces param&egrave;tres classiquement, et leur appliquer la loi d'ohm et les th&eacute;or&egrave;mes classiques de l'&eacute;lectricit&eacute;. Le syst&egrave;me d'&eacute;quations sera alors lin&eacute;aire, donc simple &agrave; r&eacute;soudre avec des outils classiques.<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O34">R&Eacute;SISTANCE DIFF&Eacute;RENTIELLE.</A></font></H5>Tr&egrave;s souvent, en &eacute;lectronique, on doit polariser le montage, et ensuite, on applique un signal alternatif &agrave; l'entr&eacute;e de ce montage pour qu'il y soit trait&eacute;.<P>Pour ce qui suit, et conform&eacute;ment &agrave; ce qui a &eacute;t&eacute; dit pr&eacute;c&eacute;demment, on va faire l'hypoth&egrave;se que le signal alternatif est de <STRONG>faible amplitude compar&eacute; aux tensions de polarisation </STRONG>: on parle de r&eacute;gime des petits signaux.<P>Supposons qu'au d&eacute;part, on polarise le dip&ocirc;le Z<sub>ch</sub> avec un g&eacute;n&eacute;rateur de tension continu (E<sub>g</sub>,&nbsp;R<sub>g</sub>). Le point de polarisation P<sub>o</sub> correspond au courant I<sub>o</sub> et &agrave; la tension E<sub>o</sub> (e = 0).<P>Si on rajoute au g&eacute;n&eacute;rateur de polarisation (E<sub>g</sub>,&nbsp;R<sub>g</sub>) un g&eacute;n&eacute;rateur alternatif e avec e << E<sub>g</sub>, on d&eacute;place la droite de charge qui correspond alors au g&eacute;n&eacute;rateur &eacute;quivalent (E<sub>g</sub>+e,&nbsp;R<sub>g</sub>). A un instant donn&eacute;, le nouveau point de polarisation est alors P(E<sub>o</sub>+<IMG SRC="../BASE/ICONES/DELTA.GIF" align=bottom>E, I<sub>o</sub>+<IMG SRC="../BASE/ICONES/DELTA.GIF" align=bottom>I).<P>Si <IMG SRC="../BASE/ICONES/DELTA.GIF" align=bottom>E est suffisamment petit, on peut consid&eacute;rer que P se d&eacute;place sur la tangente de la caract&eacute;ristique en P<sub>o</sub>.<P>A une petite variation <IMG SRC="../BASE/ICONES/DELTA.GIF" align=bottom>E de E<sub>o</sub> va correspondre une petite variation <IMG SRC="../BASE/ICONES/DELTA.GIF" align=bottom>I de I<sub>o</sub>. <P><CENTER><IMG SRC="OUTILS.FIG/OUTILS18.GIF"></CENTER><CENTER><P>Fig. 18. R&eacute;sistance dynamique.<P></CENTER>Par d&eacute;finition, on pose :<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS19.GIF"></CENTER><P>r<sub>o</sub> est la r&eacute;sistance <STRONG>dynamique</STRONG> (ou <STRONG>diff&eacute;rentielle</STRONG>) du dip&ocirc;le au point de polarisation P<sub>o</sub> (E<sub>o</sub>,&nbsp;I<sub>o</sub>). Ceci revient &agrave; assimiler localement la caract&eacute;ristique &agrave; sa tangente.<P>Pour des petites variations autour d'un point de polarisation donn&eacute;, on lin&eacute;arise le dip&ocirc;le, et gr&acirc;ce &agrave; la notion de r&eacute;sistance dynamique, on a une loi d'Ohm simple. Ceci va permettre de simplifier grandement les calculs.<P><STRONG>ATTENTION : la r&eacute;sistance dynamique est une caract&eacute;ristique du point de polarisation consid&eacute;r&eacute;. Si on modifie la polarisation, la r&eacute;sistance dynamique va varier. Cette notion n'a de sens que pour des petits signaux alternatifs (e << E<sub>g</sub>).</STRONG><P>Ces <STRONG>notions</STRONG> de<STRONG> petits signaux</STRONG> et de param&egrave;tres <STRONG>diff&eacute;rentiels</STRONG> sont <STRONG>absolument incontournables</STRONG> pour &eacute;tudier un montage amplificateur en &eacute;lectronique.</OL></OL><P><P><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="O35">LES QUADRIP&Ocirc;LES.</A></H3>Nous n'allons pas entrer ici dans les d&eacute;tails de cette th&eacute;orie, mais juste indiquer ce qui nous sera utile pour l'&eacute;tude des transistors.<P><P><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="O36">D&Eacute;FINITION.</A></H4>Un quadrip&ocirc;le est une boite noire &agrave; quatre bornes dans laquelle des courants &eacute;lectriques peuvent circuler&nbsp;; cette boite comporte deux bornes d'entr&eacute;e et deux bornes de sortie&nbsp;:<P><P> <CENTER><IMG SRC="OUTILS.FIG/OUTILS20.GIF"></CENTER><CENTER><P>Fig. 19. Repr&eacute;sentation d'un quadrip&ocirc;le.<P></CENTER>La <STRONG>condition</STRONG> pour que cette boite noire soit un quadrip&ocirc;le est que le <STRONG>courant entrant par une des bornes d'entr&eacute;e</STRONG> (resp. de sortie) soit <STRONG>&eacute;gal au courant sortant par l'autre borne d'entr&eacute;e</STRONG> (resp. de sortie).<P>Quatre param&egrave;tres &eacute;lectriques caract&eacute;risent alors le quadrip&ocirc;le&nbsp;: tension et courant d'entr&eacute;e v<sub>e</sub> et i<sub>e</sub>, et tension et courant de sortie v<sub>s</sub> et i<sub>s</sub>.<P>Deux de ces variables sont ind&eacute;pendantes. Les autre y sont li&eacute;es par les param&egrave;tres du quadrip&ocirc;le.<P><P><P>&nbsp;<LI><H4><A NAME="O37">PARAM&Egrave;TRES HYBRIDES.</A></H4>Vu qu'on a quatre variables dont deux ind&eacute;pendantes, il y a plusieurs possibilit&eacute;s pour &eacute;crire les &eacute;quations liant ces variables. Nous choisirons ici les &eacute;quations faisant intervenir les param&egrave;tre hybrides, ce qui est le formalisme le plus simple pour d&eacute;crire le fonctionnement des transistors.<P>On d&eacute;montre que l'on peut &eacute;crire&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS21.GIF"></CENTER><P>On peut mettre ce syst&egrave;me sous la forme matricielle suivante&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS22.GIF"></CENTER><P>La matrice de transfert est appel&eacute;e matrice hybride du quadrip&ocirc;le.<P>La signification des param&egrave;tres est la suivante&nbsp;:<P><P>- h<sub>11</sub> est l'imp&eacute;dance d'entr&eacute;e du quadrip&ocirc;le avec la sortie en court-circuit.<P><P>- h<sub>12</sub> est un coefficient adimensionnel quantifiant la r&eacute;action de la sortie sur l'entr&eacute;e.<P><P>- h<sub>21</sub> est le gain en courant avec sortie en court-circuit.<P><P>- h<sub>22</sub> est l'admittance de sortie avec entr&eacute;e &agrave; vide.<P><P><P>&nbsp;<LI><H4><A NAME="O38">SCH&Eacute;MA &Eacute;QUIVALENT.</A></H4>A partir des param&egrave;tres d&eacute;finis pr&eacute;c&eacute;demment, on peut donner un sch&eacute;ma &eacute;lectrique &eacute;quivalent du quadrip&ocirc;le&nbsp;; ce sch&eacute;ma ne fait intervenir que des composants classiques de l'&eacute;lectricit&eacute; (voir Fig. 20).<P>Ce sch&eacute;ma est typiquement celui qui sera utilis&eacute; pour repr&eacute;senter le transistor en petits signaux alternatifs.<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS23.GIF"></CENTER><CENTER><P>Fig. 20. Sch&eacute;ma &eacute;quivalent d'un quadrip&ocirc;le.<P></CENTER><P></OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="O39">LES INDISPENSABLES.</A></H3>En &eacute;lectronique, il existe des conventions un peu diff&eacute;rentes de ce qu'on trouve en &eacute;lectricit&eacute;, et aussi des utilisations sp&eacute;cifiques de certains composants passifs . Nous allons &eacute;tudier ces particularit&eacute;s dans ce paragraphe.<P><P><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="O40">MOD&Eacute;LISATION.</A></H4>Les sch&eacute;mas &eacute;lectroniques font intervenir des composants ayant un comportement simple &agrave; d&eacute;crire math&eacute;matiquement (R, L, C ), et d'autres ayant un comportement plus complexe. C'est le cas notamment des semi-conducteurs.<P>De mani&egrave;re &agrave; pouvoir mod&eacute;liser les circuits utilisant ces composants et pr&eacute;voir leur fonctionnement, on est amen&eacute;s &agrave; faire un sch&eacute;ma &eacute;quivalent des composants complexes, ce sch&eacute;ma &eacute;tant b&acirc;ti &agrave; partir de composants simples&nbsp;: r&eacute;sistances, sources de tension, de courant <A HREF="ANNEXE/MODEL.GIF" target=_blank>(GIF 8ko)</A><P>Par exemple, on pourra mod&eacute;liser une diode z&eacute;ner avec un g&eacute;n&eacute;rateur de tension parfait et une r&eacute;sistance s&eacute;rie.<P>Il faudra garder &agrave; l'esprit que ce n'est qu'un <STRONG>sch&eacute;ma &eacute;quivalent, sous certaines hypoth&egrave;ses bien d&eacute;finies</STRONG>. Il ne saurait &ecirc;tre question d'appliquer le r&eacute;sultat obtenu par le calcul&nbsp;hors de ces hypoth&egrave;ses !<P>Exemple&nbsp;: bien qu'on puisse mod&eacute;liser une diode z&eacute;ner par un g&eacute;n&eacute;rateur de tension, si on branche une telle diode sur une ampoule, il ne se passera rien&nbsp;! Ce composant n'est pas l'&eacute;quivalent d'une pile ou d'un accumulateur.<P>Cette remarque volontairement grossie reste valable pour la mod&eacute;lisation en g&eacute;n&eacute;ral, quel que soit le domaine de la physique consid&eacute;r&eacute;.<P><P><P>&nbsp;<LI><H4><A NAME="O41">APPROXIMATIONS.</A></H4>Lorsqu'on fera des calculs sur un circuit &eacute;lectronique, on sera guid&eacute;s en permanence par leur pr&eacute;cision&nbsp;:<P><P>- les composants (r&eacute;sistances, condensateurs, transistors) font l'objet de dispersions (r&eacute;sistances &agrave;  5% par exemple ).<P><P>- les hypoth&egrave;ses de calcul conduisent &agrave; des simplifications (lin&eacute;arisation, petits signaux )<P><P>- le r&eacute;sultat d&eacute;sir&eacute; le sera avec une pr&eacute;cision plus ou moins &eacute;lev&eacute;e.<P>Par cons&eacute;quent, aussi savantes que puissent para&icirc;tre les &eacute;quations permettant de r&eacute;soudre un circuit, on aura toujours pr&eacute;sent &agrave; l'esprit que&nbsp;:<P><P>- elles sont fausses&nbsp;!<P><P>- elles sont inapplicables &agrave; des composants r&eacute;els.<P>Elles sont fausses car b&acirc;ties sur des hypoth&egrave;ses repr&eacute;sentant des approximations, et inutilisables telles quelles car il faudra tenir compte de la dispersion des composants et des valeurs normalis&eacute;es (on ne trouve pas toutes les valeurs de r&eacute;sistances dans le commerce par exemple).<P>Dans ce cas, dans la majeure partie des probl&egrave;mes d'&eacute;lectronique, on se contentera de d&eacute;terminer un ordre de grandeur des param&egrave;tres permettant de dimensionner les composants. On pourra dans ce cadre faire un maximum de simplifications. On adoptera souvent pour ce faire la <STRONG>r&egrave;gle du dixi&egrave;me</STRONG>&nbsp;: si deux param&egrave;tres s'ajoutent dans une &eacute;quation, et que l'un soit plus de dix fois plus petit que l'autre, alors, on va le n&eacute;gliger. Exemple&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS24.GIF"></CENTER><P>En partant du constat qu'un calcul rigoureux est infaisable, et que de toutes fa&ccedil;ons, il ne servirait &agrave; rien, le meilleur calcul sera le plus simple&nbsp;!<P><P><P>&nbsp;<LI><H4><A NAME="O42">REPR&Eacute;SENTATION DES SCH&Eacute;MAS.</A></H4>En g&eacute;n&eacute;ral, et contrairement &agrave; ce qui se pratique en &eacute;lectricit&eacute;, on ne repr&eacute;sentera pas toutes les connections entre les composants d'un sch&eacute;ma &eacute;lectronique. On omettra souvent les g&eacute;n&eacute;rateurs de tension continue, et de ce fait, le rebouclage des points o&ugrave; ils sont connect&eacute;s avec la masse.<P>De m&ecirc;me, pour mieux comprendre le fonctionnement d'un montage, on t&acirc;chera (dans la mesure du possible) de b&acirc;tir le sch&eacute;ma en mettant le potentiel le plus &eacute;lev&eacute; en haut de la feuille et de respecter une &eacute;chelle des potentiels d&eacute;croissants lorsqu'on dessinera les &eacute;l&eacute;ments du haut vers le bas de la feuille. En proc&eacute;dant ainsi, on aura les fl&egrave;ches de repr&eacute;sentation des potentiels dans le m&ecirc;me sens, et des courants descendants&nbsp;: la compr&eacute;hension en sera largement accrue.<P><P><P>&nbsp;<LI><H4><A NAME="O43">MASSE.</A></H4>La masse est le potentiel de r&eacute;f&eacute;rence (fix&eacute; par convention &agrave; 0) du montage &eacute;lectronique : un potentiel n'est pas d&eacute;fini dans l'absolu, on parle toujours de diff&eacute;rence de potentiel.<P>Dans un montage &eacute;lectronique, quand on parlera du potentiel d'un point, il sera sous entendu que ce potentiel est r&eacute;f&eacute;renc&eacute; &agrave; la masse du montage.<P>La masse sera en g&eacute;n&eacute;ral le p&ocirc;le moins de l'alimentation continue servant &agrave; polariser le montage. Cette  r&egrave;gle  est uniquement une coutume, elle ne sera pas syst&eacute;matiquement respect&eacute;e sur les sch&eacute;mas rencontr&eacute;s !<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS25.GIF"></CENTER><CENTER><P>Fig. 21. Repr&eacute;sentations de la masse.<P></CENTER><P><P>&nbsp;<LI><H4><A NAME="O44">TERRE.</A></H4>La terre est une connexion physique au sol (&agrave; la terre&nbsp;!). Contrairement aux croyances souvent &eacute;nonc&eacute;es, en aucun cas ce potentiel ne peut &ecirc;tre consid&eacute;r&eacute; comme r&eacute;f&eacute;rence absolue, car il est diff&eacute;rent d'un endroit de la Terre (la plan&egrave;te) &agrave; un autre. De plus, le c&acirc;ble de liaison  du laboratoire au sol pr&eacute;sente une imp&eacute;dance non nulle&nbsp;: si un courant parasite circule dans ce c&acirc;ble, il va y cr&eacute;er une chute de potentiel&nbsp;; on aura une diff&eacute;rence de potentiel entre la prise de terre du labo et  le sol.<P>La <STRONG>fonction d'une terre</STRONG> est la <STRONG>s&eacute;curit&eacute;</STRONG>&nbsp;: elle permet de <STRONG>prot&eacute;ger les utilisateurs d'&eacute;quipement sous tension</STRONG>, et aussi d'&eacute;vacuer les courants induits par la foudre.<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS26.GIF"></CENTER><CENTER><P>Fig. 22. Repr&eacute;sentations de la terre.<P></CENTER><P><P>&nbsp;<LI><H4><A NAME="O45">INTERRUPTEURS.</A></H4>Ils permettent d'introduire une coupure dans un circuit &eacute;lectrique. Nous allons &eacute;tudier ici le comportement d'un interrupteur parfait.<P><P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O46">Interrupteur ouvert.</A></font></H5>Lorsque l'interrupteur est ouvert, aucun courant ne circule dans la boucle, et toute la tension se retrouve sur l'interrupteur (U2 est nul, car le courant I est nul).<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS27.GIF"></CENTER><CENTER><P>Fig. 23. Interrupteur ouvert dans une boucle.<P></CENTER>La caract&eacute;ristique de l'interrupteur ouvert se confond avec l'axe horizontal&nbsp;: le courant est nul quelle que soit la tension &agrave; ses bornes&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS28.GIF"></CENTER><CENTER><P>Fig. 24. Caract&eacute;ristique d'un interrupteur ouvert.<P></CENTER><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O47">Interrupteur ferm&eacute;.</A></font></H5>Lorsque l'interrupteur est ferm&eacute;, le courant peut circuler librement, la tension &agrave; ses bornes &eacute;tant nulle&nbsp;; on suppose celui-ci parfaitement conducteur, exempt de toute imp&eacute;dance parasite.<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS29.GIF"></CENTER> <CENTER><P>Fig. 25. Interrupteur ferm&eacute; dans une boucle.<P></CENTER>La caract&eacute;ristique de l'interrupteur ferm&eacute; se confond avec l'axe vertical&nbsp;: tension nulle quel que soit le courant qui circule &agrave; travers&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS30.GIF"></CENTER><CENTER><P>Fig. 26. Caract&eacute;ristique d'un interrupteur ferm&eacute;.<P></CENTER><P></OL><P>&nbsp;<LI><H4><A NAME="O48">DIVISEUR DE TENSION.</A></H4>C'est <STRONG>le</STRONG> montage fondamental de l'&eacute;lectronique :<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS31.GIF"></CENTER><CENTER><P>Fig. 27. Diviseur de tension.<P></CENTER>Plut&ocirc;t que d'appliquer la <A HREF="COURS.HTM#O56" target=COURS> loi des mailles</A>, on utilisera cette propri&eacute;t&eacute; au maximum&nbsp;; les calculs en seront tr&egrave;s souvent simplifi&eacute;s.<P>La formule donnant la tension de sortie V<sub>s</sub> en fonction de la tension d'entr&eacute;e du pont V<sub>e</sub> est la suivante&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS32.GIF"></CENTER><P>En fait, on s'affranchit des courants dans la formulation, ce qui revient implicitement &agrave; diminuer le nombre d'inconnues, donc d'&eacute;quations du probl&egrave;me. On arrive ainsi beaucoup plus vite et plus s&ucirc;rement &agrave; le r&eacute;soudre.<P><P><P>&nbsp;<LI><H4><A NAME="O49">ASSOCIATION DE R&Eacute;SISTANCES.</A></H4><P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O50">En parall&egrave;le.</A></font></H5><CENTER><IMG SRC="OUTILS.FIG/OUTILS33.GIF"></CENTER><CENTER><P>Fig. 28. R&eacute;sistances en parall&egrave;le.<P></CENTER><CENTER><IMG SRC="OUTILS.FIG/OUTILS34.GIF"></CENTER><P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O51">En s&eacute;rie.</A></font></H5><CENTER><IMG SRC="OUTILS.FIG/OUTILS35.GIF"></CENTER><CENTER><P>Fig. 29. R&eacute;sistances en s&eacute;rie.<P></CENTER><CENTER><IMG SRC="OUTILS.FIG/OUTILS36.GIF"></CENTER></OL><P><P><P>&nbsp;<LI><H4><A NAME="O52">CONDENSATEURS DE LIAISON.</A></H4>La plupart des montages &eacute;lectroniques &agrave; composants discrets n&eacute;cessitent une polarisation (adjonction d'une tension continue) pour fonctionner correctement.<P>&Agrave; l'entr&eacute;e du montage, sur ces tensions continues de polarisation, on va superposer un signal alternatif. Dans la plupart des cas, le g&eacute;n&eacute;rateur alternatif ne pourrait pas supporter qu'un courant continu le traverse ; de plus, si on ne veut pas modifier la polarisation du montage, ce g&eacute;n&eacute;rateur doit &ecirc;tre neutre du point de vue du r&eacute;gime continu vis &agrave; vis du montage qu'il attaque.<P>Pour satisfaire &agrave; toutes ces exigences, on relie le g&eacute;n&eacute;rateur alternatif &agrave; l'entr&eacute;e du montage par l'interm&eacute;diaire d'un condensateur.<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS37.GIF"></CENTER><CENTER><P>Fig. 30. Condensateurs de liaison et d&eacute;couplage.<P></CENTER>Ce condensateur pr&eacute;sente une imp&eacute;dance infinie au courant continu : il va ainsi emp&ecirc;cher qu'un tel courant ne traverse le g&eacute;n&eacute;rateur alternatif ; on ne modifiera pas la polarisation du montage.<P>Ce condensateur est dit de <STRONG>liaison</STRONG>. On le choisira toujours pour que son imp&eacute;dance soit n&eacute;gligeable aux fr&eacute;quences d&eacute;livr&eacute;es par le g&eacute;n&eacute;rateur alternatif :<P><P>- Pour le <STRONG>r&eacute;gime alternatif</STRONG>, et pour les fr&eacute;quences des signaux utilis&eacute;s, on l'assimilera &agrave; un <STRONG>court circuit</STRONG>.<P><P>- Pour le <STRONG>r&eacute;gime continu</STRONG>, on le consid&eacute;rera comme un <STRONG>circuit ouvert</STRONG>.<P><P><P>&nbsp;<LI><H4><A NAME="O53">CONDENSATEURS DE D&Eacute;COUPLAGE.</A></H4>Les n&eacute;cessit&eacute;s de la polarisation peuvent amener &agrave; introduire dans le montage des &eacute;l&eacute;ments (des r&eacute;sistances notamment) qui nuisent au bon fonctionnement du r&eacute;gime alternatif. Pour &eacute;viter ceci, on peut mettre en parall&egrave;le sur ces &eacute;l&eacute;ments un condensateur qui va se comporter comme un court circuit pour les signaux alternatifs. Comme pour les condensateurs de liaison, ils ne modifient en rien la polarisation du montage. (voir figure 30).</OL><P><P><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="O54">TH&Eacute;OR&Egrave;MES FONDAMENTAUX.</A></H3><P><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="O55">LOIS DE KIRCHOFF.</A></H4>Les lois de Kirchoff sont les lois fondamentales qui r&eacute;gissent le fonctionnement de tout circuit &eacute;lectrique. N&eacute;anmoins, en pratique, elles sont peu appliqu&eacute;es telles quelles en &eacute;lectronique ; on leur pr&eacute;f&eacute;rera souvent les propri&eacute;t&eacute;s du diviseur de tension, et les th&eacute;or&egrave;mes de th&eacute;venin et de superposition pour faire les calculs. A noter qu'on a besoin des lois de Kirchoff pour d&eacute;montrer ces th&eacute;or&egrave;mes. <P><P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O56">Loi des mailles.</A></font></H5>Une <STRONG>maille</STRONG> est une <STRONG>boucle ferm&eacute;e</STRONG> compos&eacute;e d'&eacute;l&eacute;ments r&eacute;els ou virtuels (immat&eacute;riels) pr&eacute;sentant une diff&eacute;rence de potentiel entre leurs bornes.<P>La <STRONG>somme des tensions rencontr&eacute;es lorsqu'on parcourt une boucle ferm&eacute;e est nulle</STRONG>.<P>Cette loi est en quelque sorte la  relation de Chasles  de l'&eacute;lectricit&eacute;.<P>Pratiquement, on impose d'abord le sens des courant dans chaque &eacute;l&eacute;ment de la maille. Ensuite, on repr&eacute;sente les tensions par des fl&egrave;ches en respectant les r&egrave;gles suivantes :<P><P>- convention r&eacute;cepteur pour les dip&ocirc;les passifs avec le sens du courant qu'on a impos&eacute;.<P><P>- respect de la polarit&eacute; des g&eacute;n&eacute;rateurs (fl&egrave;che au p&ocirc;le positif). <STRONG>Attention&nbsp;:</STRONG> cette r&egrave;gle est absolue, m&ecirc;me si le g&eacute;n&eacute;rateur est utilis&eacute; comme r&eacute;cepteur&nbsp;! <STRONG>(Exception notable&nbsp;: les fcem)</STRONG>.<P><P>- une tension rencontr&eacute;e sur la boucle peut correspondre &agrave; un &eacute;l&eacute;ment immat&eacute;riel (qui n'est ni un g&eacute;n&eacute;rateur, ni un composant passif : cas de la tension U dans l'exemple ci-dessous). Cette astuce permet de  casser  une boucle trop grande et de simplifier les calculs.<P>Le sens et le d&eacute;but du parcours n'importent pas. On met un signe positif &agrave; toute tension rencontr&eacute;e en direct (la fl&egrave;che la repr&eacute;sentant est orient&eacute;e dans le sens de parcours de la boucle), sinon, le signe est n&eacute;gatif.<P><P>- boucle 1 :<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS38.GIF"></CENTER><P><P>- boucle 2<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS39.GIF"></CENTER><P><CENTER><IMG SRC="OUTILS.FIG/OUTILS40.GIF"></CENTER><CENTER><P>Fig. 31. Circuit &agrave; deux mailles.<P></CENTER>Pour  r&eacute;soudre totalement le probl&egrave;me d'&eacute;lectricit&eacute; pos&eacute;, il va falloir d&eacute;terminer autant d'&eacute;quations ind&eacute;pendantes qu'on a d'inconnues (tensions et courants). La loi des mailles ne sera d'ailleurs pas suffisante pour d&eacute;finir toutes les &eacute;quations n&eacute;cessaires, il faudra aussi utiliser la <A HREF="COURS.HTM#O57" target=COURS> loi des noeuds</A>.<P>Quand on a autant d'&eacute;quations que d'inconnues, on peut r&eacute;soudre le syst&egrave;me. Il se peut alors qu'on obtienne des courants n&eacute;gatifs. <STRONG>Si le circuit ne comporte aucun &eacute;l&eacute;ment appel&eacute;  force contre &eacute;lectro-motrice (fcem)  en &eacute;lectricit&eacute;</STRONG>, le courant circule en fait dans le sens oppos&eacute; &agrave; celui d&eacute;fini arbitrairement. Ceci ne remet pas en cause les r&eacute;sultats obtenus.<P><STRONG>Par contre, si le circuit contient des fcem, et que des courants n&eacute;gatifs apparaissent dans la solution, il faut imp&eacute;rativement retraiter tout le probl&egrave;me en modifiant le sens arbitraire des courants, et ceci jusqu'&agrave; ce que tous les courants soient positifs.</STRONG><P>En pratique, dans les probl&egrave;mes d'&eacute;lectronique abord&eacute;s dans le cadre de ce cours, il n'y aura jamais d'ambiguit&eacute;s&nbsp;: on n'aura que des composants passifs simples, et des sources de tension utilis&eacute;es soit comme g&eacute;n&eacute;rateurs, soit comme r&eacute;cepteurs, mais dans tous les cas, leur polarit&eacute; ne d&eacute;pendra pas du sens du passage du courant.<P>Par contre, la polarit&eacute; des fcem d&eacute;pend du sens du courant les traversant, ce qui fait que si on inverse celui-ci, le probl&egrave;me d'&eacute;lectricit&eacute; &agrave; r&eacute;soudre est diff&eacute;rent&nbsp;!<P>En &eacute;lectronique, on fera essentiellement attention aux inductances, qui ont un comportement de fcem.<STRONG><P></STRONG><STRONG>Nota&nbsp;:</STRONG> on trouvera dans la litt&eacute;rature une autre m&eacute;thode de r&eacute;solution de ces probl&egrave;mes appel&eacute;e r&eacute;solution matricielle. Elle consiste &agrave; d&eacute;finir un  courant de maille  totalement fictif et n'ayant rien &agrave; voir avec la circulation r&eacute;elle des courants (qui sont mesurables &agrave; l'aide d'un amp&egrave;rem&egrave;tre). On obtient les courants r&eacute;els en sommant les courants fictifs communs aux diff&eacute;rentes branches. Cette m&eacute;thode est tr&egrave;s efficace pour faire du calcul de circuits sur ordinateur (r&eacute;solution de syst&egrave;mes d'&eacute;quations). Elle est d&eacute;conseill&eacute;e ici, car elle ne permet pas d'y voir clair dans un circuit &eacute;lectronique, ni surtout pas d'intuiter son fonctionnement&nbsp;!<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O57">Loi des noeuds.</A></font></H5>Un noeud est la jonction d'au moins trois conducteurs.<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS41.GIF"></CENTER><CENTER><P>Fig. 32. Noeud de courant.<P></CENTER>La <STRONG>somme des courants entrant</STRONG> dans le noeud est <STRONG>&eacute;gale</STRONG> &agrave; la<STRONG> somme des courants en sortant</STRONG>. Ici, on a :<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS42.GIF"></CENTER></OL><P><P><P>&nbsp;<LI><H4><A NAME="O58">TH&Eacute;OR&Egrave;ME DE SUPERPOSITION.</A></H4><P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O59">D&eacute;finition.</A></font></H5>Ce th&eacute;or&egrave;me est fondamental. Il va permettre d'&eacute;tudier des circuits comportant plusieurs g&eacute;n&eacute;rateurs (de tension ou de courant) en consid&eacute;rant l'influence de chaque g&eacute;n&eacute;rateur ind&eacute;pendamment des autres, ce qui va beaucoup simplifier la plupart des probl&egrave;mes.<P>Une des grandes applications est le sch&eacute;ma alternatif petits signaux, qu'on utilise tr&egrave;s souvent sans m&ecirc;me penser qu'il d&eacute;coule du th&eacute;or&egrave;me de superposition !<P>Dans un circuit comportant plusieurs g&eacute;n&eacute;rateurs, la solution du probl&egrave;me (les tensions et courants inconnus) est la somme des solutions trouv&eacute;es en ne consid&eacute;rant qu'un g&eacute;n&eacute;rateur &agrave; la fois.<P>Pour ce faire, on remplace chaque source de tension parfaite par un court circuit, et chaque source de courant par un circuit ouvert, &agrave; l'exception de la source dont on veut conna&icirc;tre l'influence.<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS43.GIF"></CENTER><CENTER><P>Fig. 33. Probl&egrave;me global.<P></CENTER>Dans l'exemple ci-dessus, on va commencer par supprimer E<sub>2</sub> et faire le calcul de la tension U avec E<sub>1</sub> seul. On a alors un diviseur de tension :<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS44.GIF"></CENTER><CENTER><P>Fig. 34. 1&egrave;re &eacute;tape.<P></CENTER><CENTER><IMG SRC="OUTILS.FIG/OUTILS45.GIF"></CENTER><P>Pour avoir la contribution de E<sub>2</sub>, on fait ensuite la m&ecirc;me chose en supprimant E<sub>1</sub> :<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS46.GIF"></CENTER><P><CENTER><IMG SRC="OUTILS.FIG/OUTILS47.GIF"></CENTER><CENTER><P>Fig. 35. 2&egrave;me &eacute;tape.<P></CENTER>La solution totale U est &eacute;gale &agrave; la somme des deux solutions pr&eacute;c&eacute;demment trouv&eacute;es :<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS48.GIF"></CENTER><P>On voit bien ici l'int&eacute;r&ecirc;t de ce th&eacute;or&egrave;me : on applique deux fois la formule du diviseur de tension et le tour est jou&eacute; ! Il n'y a pas eu besoin de recourir aux &eacute;quations lourdes de la loi des mailles.<P>Tout comme pour le th&eacute;or&egrave;me de th&eacute;venin, on utilisera ce th&eacute;or&egrave;me avec une extr&ecirc;me prudence quand on aura affaire &agrave; des sources command&eacute;es<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O60">Application au sch&eacute;ma &eacute;quivalent alternatif petits signaux.</A></font></H5>En g&eacute;n&eacute;ral, on con&ccedil;oit un circuit &eacute;lectronique &agrave; &eacute;l&eacute;ments discrets en deux temps : on calcule d'abord les &eacute;l&eacute;ments n&eacute;cessaires &agrave; sa bonne polarisation, et ensuite, on &eacute;tudie son comportement en petits signaux alternatifs (la fonction principale du montage) ind&eacute;pendamment de la polarisation (qui est n&eacute;cessaire au bon fonctionnement des semi conducteurs, mais ne constitue pas une fin en soi).<P>Ce faisant, on utilise implicitement le th&eacute;or&egrave;me de superposition, car les tensions et courants du montage seront toujours la somme des tensions et courants de polarisation et des signaux alternatifs.<P>Ainsi, dans un circuit, on pourra se focaliser sur l'effet d'un seul g&eacute;n&eacute;rateur. Il sera ind&eacute;pendant de la contribution du ou des autres g&eacute;n&eacute;rateurs du circuit.<P>Pour <STRONG>construire un sch&eacute;ma &eacute;quivalent en alternatif</STRONG> d'un montage, on appliquera les <STRONG>r&egrave;gles suivantes</STRONG> :<P><P>- On remplacera toutes les sources de tension continue parfaites par des court-circuits.<P><P>- On remplacera toutes les sources de courant continu parfaites par des circuits ouverts.<P><P>- On remplacera toutes les sources de tension continue et de courant continu ayant une r&eacute;sistance interne par leur r&eacute;sistance interne.<P><P>- Les condensateurs de d&eacute;couplage seront remplac&eacute;s par des court-circuits.<P><P>- En g&eacute;n&eacute;ral, on remplacera les condensateurs de liaison par des court-circuits.<P><P>- Tous les dip&ocirc;les non lin&eacute;aires seront pr&eacute;alablement lin&eacute;aris&eacute;s pour nous permettre d'appliquer simplement la loi d'Ohm.<P>On obtient ainsi le sch&eacute;ma simplifi&eacute; qui va permettre l'&eacute;tude de la fonctionnalit&eacute; du montage. <A HREF="ANNEXE/SCHEMAEQ.GIF" target=_blank>Application pratique, mode d'emploi (GIF 26ko).</A><P><STRONG>ATTENTION !!!</STRONG> : il faudra toujours se souvenir des hypoth&egrave;ses de base qui ont servi &agrave; faire ce sch&eacute;ma, et notamment le fait que quand on a un courant (ou une tension) n&eacute;gatif dans le sch&eacute;ma alternatif, dans le montage, en r&eacute;alit&eacute;, il sera positif, mais inf&eacute;rieur au courant (ou &agrave; la tension) de polarisation.<P>On pourra avoir des surprises de fonctionnement qui n'ont pas &eacute;t&eacute; pr&eacute;vues par l'&eacute;tude du sch&eacute;ma alternatif &eacute;quivalent, de par les simplifications faites.<P>Un montage pourra avoir ainsi un fonctionnement dissym&eacute;trique sur les ondes positives et n&eacute;gatives du signal alternatif. Il faudra faire particuli&egrave;rement attention au fonctionnement de ce montage sur charge capacitive (certains circuits pr&eacute;sentent une imp&eacute;dance de sortie dissym&eacute;trique : par exemple, dans une diode ou un transistor, le courant ne peut circuler physiquement que dans un seul sens. Le montage ne pourra donc pas "absorber" un courant n&eacute;gatif, mais seulement fournir un courant positif inf&eacute;rieur au courant de polarisation).<P>Ne pas oublier non plus qu'on est en r&eacute;gime de petits signaux, et que si on pousse le montage aux limites, cette hypoth&egrave;se devient fausse, et le comportement observ&eacute; n'est plus ce qui a &eacute;t&eacute; pr&eacute;vu !<P>En cas de probl&egrave;mes, il faudra rechercher la cause de dysfonctionnement en consid&eacute;rant le sch&eacute;ma global, et non plus le sch&eacute;ma &eacute;quivalent en alternatif.</OL><P><P><P>&nbsp;<LI><H4><A NAME="O61">TH&Eacute;OR&Egrave;ME DE TH&Eacute;VENIN.</A></H4>Il a &eacute;t&eacute; dit au d&eacute;but de ce chapitre qu'on pouvait associer des dip&ocirc;les de base en s&eacute;rie et en parall&egrave;le de mani&egrave;re &agrave; former des dip&ocirc;les plus complexes. Le th&eacute;or&egrave;me de th&eacute;venin permet de remplacer un montage complexe par un g&eacute;n&eacute;rateur de tension &eacute;quivalent avec sa r&eacute;sistance interne &eacute;quivalente et de calculer ces &eacute;l&eacute;ments.<P>On pourra ainsi consid&eacute;rer ce montage comme une source de tension r&eacute;elle et &eacute;tudier plus simplement son comportement lorsqu'on le <A HREF="COURS.HTM#O13" target=COURS> connecte &agrave; un autre dip&ocirc;le</A>.<P>On peut aussi gr&acirc;ce &agrave; ce th&eacute;or&egrave;me aborder un sch&eacute;ma compliqu&eacute; en isolant des morceaux et en les transformant en g&eacute;n&eacute;rateurs de th&eacute;venin &eacute;quivalents. Cela permet souvent d'y voir plus clair dans un sch&eacute;ma complexe, et de simplifier et bien faire ressortir des blocs cl&eacute; du sch&eacute;ma.<P>Dans l'exemple suivant, il pourrait &ecirc;tre int&eacute;ressant de r&eacute;duire la partie gauche du sch&eacute;ma (en pointill&eacute;s) &agrave; un seul g&eacute;n&eacute;rateur &eacute;quivalent.<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS49.GIF"></CENTER><CENTER><P>Fig. 36. Dip&ocirc;le complexe.<P></CENTER>Le th&eacute;or&egrave;me de th&eacute;venin va permettre de r&eacute;duire cette partie &agrave; un g&eacute;n&eacute;rateur E<sub>Th</sub> et sa r&eacute;sistance interne R<sub>Th</sub> de la mani&egrave;re suivante :<P><P>- E<sub>Th</sub> est la tension &agrave; vide de la partie gauche du sch&eacute;ma&nbsp;: R<sub>3</sub> est infinie.<P><P>- R<sub>Th</sub> est la r&eacute;sistance &eacute;quivalente vue entre les points A et B lorsque les sources de tension <STRONG>non command&eacute;es    </STRONG>  sont &eacute;teintes et que R<sub>3</sub> est infinie.<P> La tension &eacute;quivalente se calcule ici ais&eacute;ment par le th&eacute;or&egrave;me de superposition :<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS50.GIF"></CENTER><CENTER><P>Fig. 37. G&eacute;n&eacute;rateur de tension &eacute;quivalent.<P></CENTER><CENTER><IMG SRC="OUTILS.FIG/OUTILS51.GIF"></CENTER><P>La r&eacute;sistance est obtenue en rempla&ccedil;ant les g&eacute;n&eacute;rateurs de tension par des court-circuits (s'il y avait eu des g&eacute;n&eacute;rateurs de courant, on les aurait remplac&eacute;s par des circuits ouverts) :<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS52.GIF"></CENTER><CENTER><P>Fig. 38. R&eacute;sistance &eacute;quivalente.<P></CENTER><CENTER><IMG SRC="OUTILS.FIG/OUTILS53.GIF"></CENTER><P>Le circuit &eacute;quivalent est le suivant, avec les valeurs de E<sub>Th</sub> et R<sub>Th</sub> calcul&eacute;es pr&eacute;c&eacute;demment.<P>Si maintenant, on veut utiliser la m&ecirc;me partie gauche du sch&eacute;ma avec une charge diff&eacute;rente de R<sub>3</sub>, le g&eacute;n&eacute;rateur de th&eacute;venin reste identique : il n'y a pas besoin de refaire de laborieux calculs avec les lois de Kirchoff !<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS54.GIF"></CENTER><CENTER><P>Fig. 39. G&eacute;n&eacute;rateur de th&eacute;venin &eacute;quivalent.<P></CENTER>Il existe le th&eacute;or&egrave;me dual de celui de th&eacute;venin : c'est le th&eacute;or&egrave;me de norton. On raisonne alors en termes de source de courant. Il est plus rarement utilis&eacute; en &eacute;lectronique, et donc, nous ne l'&eacute;tudierons pas ici (voir cours d'&eacute;lectricit&eacute;).<P><P><P>&nbsp;<LI><H4><A NAME="O62">TRANSFORMATION NORTON / TH&Eacute;VENIN.</A></H4>Il est parfois int&eacute;ressant de passer d'une repr&eacute;sentation de g&eacute;n&eacute;rateur de tension &agrave; celle de g&eacute;n&eacute;rateur de courant.<P>Si on reprend les <A HREF="COURS.HTM#O28" target=COURS> figures 15 et 16</A>, on voit que la caract&eacute;ristique de ces deux g&eacute;n&eacute;rateurs est similaire&nbsp;; la pente de cette caract&eacute;ristique est dans les deux cas &eacute;gale &agrave; -1/R<sub>g</sub>, o&ugrave; R<sub>g</sub> est la r&eacute;sistance s&eacute;rie du g&eacute;n&eacute;rateur de tension ou la r&eacute;sistance parall&egrave;le du g&eacute;n&eacute;rateur de courant.<P>Il reste &agrave; d&eacute;terminer la valeur de la tension duale du g&eacute;n&eacute;rateur de courant et vice versa.<P>La solution est donn&eacute;e par les figures 15 et 16 et dans le texte associ&eacute;.<P>Lorsqu'on transforme un g&eacute;n&eacute;rateur de courant (I<sub>g</sub>, R) en g&eacute;n&eacute;rateur de tension (E<sub>g</sub>, r), on a les relations&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS55.GIF"></CENTER><P>En effet, la tension &agrave; vide du g&eacute;n&eacute;rateur de courant est donn&eacute;e lorsque tout le courant de la source est absorb&eacute; par la r&eacute;sistance parall&egrave;le interne R.<P>Les r&eacute;sistances R et r sont &eacute;gales (les pentes des caract&eacute;ristiques sont les m&ecirc;mes).<P>Lorsqu'on transforme un g&eacute;n&eacute;rateur de tension (E<sub>g</sub>, r) en g&eacute;n&eacute;rateur de courant (I<sub>g</sub>, R), on a les relations&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS56.GIF"></CENTER><P>I<sub>g</sub> est &eacute;gal au courant de court-circuit de la source de tension (E<sub>g</sub>, r).<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS57.GIF"></CENTER><CENTER><P>Fig. 40. Transformation norton / th&eacute;venin.<P></CENTER>Comme il a d&eacute;j&agrave; &eacute;t&eacute; dit <A HREF="COURS.HTM#O28" target=COURS> auparavant</A>, ces calculs sont purement th&eacute;oriques, et ils am&egrave;nent &agrave; des valeurs de courant et tension &eacute;quivalents irr&eacute;alistes.<P>Les calculs de tensions et courants dans un circuit comprenant des g&eacute;n&eacute;rateurs auxquels on aura appliqu&eacute; la transformation th&eacute;venin/norton seront justes, mais le fonctionnement r&eacute;el de ces sources sera tr&egrave;s diff&eacute;rent de celui d&eacute;crit par le formalisme utilis&eacute;.<P><STRONG>Attention&nbsp;:</STRONG> Il ne faudra surtout pas faire de <STRONG>calculs de puissance</STRONG> dissip&eacute;e <STRONG>&agrave; l'int&eacute;rieur</STRONG> des <STRONG>sources</STRONG> avec le <STRONG> mauvais  formalisme</STRONG>&nbsp;: par exemple, calculer des puissances dissip&eacute;es &agrave; l'int&eacute;rieur d'une batterie en utilisant le mod&egrave;le du g&eacute;n&eacute;rateur de courant &eacute;quivalent am&egrave;nerait &agrave; des valeurs totalement erron&eacute;es&nbsp;!</OL><P><P><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="O63">G&Eacute;N&Eacute;RALIT&Eacute;S SUR L'AMPLIFICATION.</A></H3><P><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="O64">INTRODUCTION</A></H4>Une des grandes fonctions de l'&eacute;lectronique analogique est l'amplification de signaux &eacute;lectriques. Cette fonction sera partout pr&eacute;sente dans la mesure, et sera notamment cach&eacute;e dans les appareils de mesure de laboratoire.<P>Ces appareils seront assimil&eacute;s &agrave; des bo&icirc;tes noires, dont on ne conna&icirc;t pas le contenu, mais dont le fabricant sp&eacute;cifie divers param&egrave;tres nous permettant de les interfacer avec d'autres &eacute;l&eacute;ments de la cha&icirc;ne de mesure.<P>La pr&eacute;sentation de l'amplificateur qui va &ecirc;tre faite ici indique les param&egrave;tres essentiels et &agrave; quoi ils se rapportent.<P><P><P>&nbsp;<LI><H4><A NAME="O65">REPR&Eacute;SENTATION D'UN AMPLIFICATEUR.</A></H4>Un amplificateur est un quadrip&ocirc;le, avec deux bornes d'entr&eacute;e et deux bornes de sortie. Une des bornes sera g&eacute;n&eacute;ralement commune &agrave; l'entr&eacute;e et &agrave; la sortie (Fig. 41.). <P>On pourra repr&eacute;senter cet amplificateur par le sch&eacute;ma &eacute;quivalent suivant&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS58.GIF"></CENTER><CENTER><P>Fig. 41. Sch&eacute;ma &eacute;quivalent d'un amplificateur.<P></CENTER>Dans ce sch&eacute;ma, on va distinguer trois s&eacute;ries de param&egrave;tres, relatifs &agrave;&nbsp;:<P><P>- l'entr&eacute;e (comment se comporte l'ampli vis &agrave; vis de la source qui l'attaque).<P><P>- la relation qui lie l'entr&eacute;e et la sortie (transfert).<P><P>- la sortie (de quelle mani&egrave;re la charge perturbe-t-elle l'ampli&nbsp;?)<P><P><P>&nbsp;<LI><H4><A NAME="O66">PARAM&Egrave;TRES ESSENTIELS.</A></H4><P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O67">les param&egrave;tres d'entr&eacute;e.</A></font></H5><P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O68">Imp&eacute;dance d'entr&eacute;e.</A></font></H5>C'est tout simplement l'imp&eacute;dance vue de la source, &agrave; savoir le rapport&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS59.GIF"></CENTER><P>Cette imp&eacute;dance est en g&eacute;n&eacute;ral &eacute;lev&eacute;e pour ne pas perturber la source qui l'attaque.<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O69">Sensibilit&eacute; d'entr&eacute;e.</A></font></H5>C'est la tension Se appliqu&eacute;e &agrave; l'entr&eacute;e pour laquelle l'ampli atteindra sa tension de sortie maximum admissible.</UL><P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O70">les param&egrave;tres de transfert.</A></font></H5><P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O71">Gain en tension.</A></font></H5>C'est le rapport de la tension de sortie  sur la tension d'entr&eacute;e. C'est le facteur multiplicatif de l'ampli&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS60.GIF"></CENTER><P>Le gain est adimensionnel. Il d&eacute;pend de la fr&eacute;quence du signal d'entr&eacute;e tout en restant pratiquement constant dans la plage de fr&eacute;quences constituant la bande passante.<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O72">Gain en d&eacute;cibels.</A></font></H5>Tr&egrave;s souvent, le gain sera exprim&eacute; en d&eacute;cibels (dB)<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS61.GIF"></CENTER><P>Ce type de notation sera utilis&eacute; de fa&ccedil;on tr&egrave;s large en &eacute;lectronique&nbsp;: <STRONG>fondamental&nbsp;!<P></STRONG><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O73">Bande passante.</A></font></H5>C'est la plage de fr&eacute;quence pour laquelle le gain en tension A<sub>v</sub> reste dans une fourchette comprise entre   xdB autour d'une valeur nominale A<sub>vo</sub>. G&eacute;n&eacute;ralement, x est &eacute;gal &agrave; 3. On parle de bande passante &agrave; 3dB.<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS62.GIF"></CENTER><CENTER><P>Fig. 42. Bande passante d'un amplificateur.<P></CENTER><P></UL><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O74">les param&egrave;tres de sortie.</A></font></H5><P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O75">Imp&eacute;dance de sortie.</A></font></H5>C'est l'imp&eacute;dance vue de la charge, &agrave; savoir le rapport&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS63.GIF"></CENTER><P>Cette valeur sera en g&eacute;n&eacute;ral faible.<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O76">Plage de sortie.</A></font></H5>C'est la tension de sortie maximum que peut d&eacute;livrer l'ampli. Il faudra faire attention (comme pour la sensibilit&eacute;) au formalisme utilis&eacute; pour la d&eacute;finir&nbsp;: tension cr&ecirc;te &agrave; cr&ecirc;te, cr&ecirc;te, ou efficace, les valeurs donn&eacute;es variant alors dans un rapport  de 1 &agrave; 2<IMG SRC="../BASE/ICONES/RACINE.GIF" align=bottom>2&nbsp;!<P><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="O77">Rapport signal sur bruit.</A></font></H5>Les composants &eacute;lectroniques g&eacute;n&egrave;rent des bruits &eacute;lectriques d'origines diverses (agitation thermique entres autres), et les circuits sont sensibles aux perturbations ext&eacute;rieures (parasitages dus &agrave; des champs &eacute;lectromagn&eacute;tiques, &agrave; des couplages ).<P>En cons&eacute;quence, la tension de sortie de l'amplificateur sera non nulle m&ecirc;me avec une tension d'entr&eacute;e nulle. Cette tension est al&eacute;atoire, et son niveau sera sensiblement constant quel que soit la tension pr&eacute;sente &agrave; l'entr&eacute;e de l'amplificateur.<P>Le rapport signal sur bruit sera d&eacute;fini comme le rapport maxi du signal utile (la plage de sortie) sur le niveau de bruit&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS64.GIF"></CENTER><P>Ce rapport signal sur bruit sera la plupart du temps exprim&eacute; en dB.<P>Cette notion est importante en instrumentation et d&eacute;borde largement le cadre de l'amplification&nbsp;; on la retrouvera aussi dans divers appareils de mesure et de traitement de signal.</UL></OL><P><P><P>&nbsp;<LI><H4><A NAME="O78">ADAPTATION D'IMP&Eacute;DANCE.</A></H4>Lorsqu'on veut connecter plusieurs &eacute;tages amplificateurs en cascade, ou plus simplement, quand on d&eacute;sire relier un amplificateur &agrave; un g&eacute;n&eacute;rateur en amont et &agrave; une charge en aval, il faut faire attention aux imp&eacute;dances des divers constituants de la cha&icirc;ne.<P>La figure 43 repr&eacute;sente un amplificateur d'imp&eacute;dance d'entr&eacute;e Z<sub>e</sub>, d'imp&eacute;dance de sortie Z<sub>s</sub>, connect&eacute; &agrave; un g&eacute;n&eacute;rateur d'imp&eacute;dance interne R<sub>g</sub> et &agrave; une charge Z<sub>u</sub>.<P>Le g&eacute;n&eacute;rateur d&eacute;livre une tension &agrave; vide E<sub>g</sub>&nbsp;; la tension &agrave; l'entr&eacute;e de l'amplificateur est V<sub>e</sub>, et celle sur la charge est V<sub>s</sub>.<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS65.GIF"></CENTER><CENTER><P>Fig. 43. Connexion d'un amplificateur.<P></CENTER>Avec la repr&eacute;sentation sch&eacute;matique de l'amplificateur, on distingue tr&egrave;s nettement deux ponts diviseurs qui vont d&eacute;t&eacute;riorer l'amplification.<P>En entr&eacute;e, on a&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS66.GIF"></CENTER><P>Et en sortie, on obtient&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS67.GIF"></CENTER><P>Au total, l'amplification r&eacute;elle devient&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS68.GIF"></CENTER><P>Si on veut transmettre le maximum de tension entre le g&eacute;n&eacute;rateur et la charge (on parle ici d'adaptation en tension, mais on peut aussi r&eacute;aliser une adaptation en courant ou en puissance), il faudra les deux conditions suivantes&nbsp;:<P><CENTER><IMG SRC="OUTILS.FIG/OUTILS69.GIF"></CENTER><P><CENTER><IMG SRC="OUTILS.FIG/OUTILS70.GIF"></CENTER><P>En th&eacute;orie, pour r&eacute;aliser une bonne adaptation en tension en entr&eacute;e et en sortie, un ampli id&eacute;al aura une imp&eacute;dance d'entr&eacute;e infinie (en pratique, elle sera la plus grande possible, de l'ordre de quelques M<IMG SRC="../BASE/ICONES/OHM.GIF" align=bottom>), et une imp&eacute;dance de sortie nulle (en pratique, elle sera de quelques   &agrave; quelques m<IMG SRC="../BASE/ICONES/OHM.GIF" align=bottom>).<P>Cette notion d'adaptation d'imp&eacute;dance est fondamentale, et s'applique tr&egrave;s largement, d&egrave;s qu'on veut interconnecter des appareils &eacute;lectroniques entre eux, et en particulier, des instruments de mesure.</OL></OL></BODY></HTML>