<HTML><HEAD><TITLE>Perturbation dans les mesures</TITLE></HEAD><BODY><CENTER><IMG SRC="../BASE/ICONES/NAV.GIF"></CENTER><P align=center>Si votre &eacute;cran ne se pr&eacute;sente pas comme ceci, <A HREF="PERTU.HTM" target="_top"> cliquez l&agrave; </A><OL TYPE=I><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="P01">INTRODUCTION.</A></H3><P>Les plus gros soucis que devra affronter le sp&eacute;cialiste en mesures lors de la mise au point de manips ou de bancs de mesures viendront des nombreuses perturbations ext&eacute;rieures qui affecteront le r&eacute;sultat.<P>L'objet de ce cours est de r&eacute;pertorier les principaux modes de perturbations &eacute;lectriques ; pour chacun de ces modes, on donnera une d&eacute;finition th&eacute;orique (donc assez large), et pour ne pas rester dans le flou, on passera tout de suite &agrave; un exemple concret, repr&eacute;sentatif de ce qu'on trouve fr&eacute;quemment dans la pratique de la mesure.<P>Il ne faudra bien entendu pas se borner &agrave; cet exemple, et garder &agrave; l'esprit qu'il est seulement repr&eacute;sentatif d'une famille de perturbations.<P>Ce cours est tr&egrave;s simplifi&eacute;. En effet, on rentre dans le domaine plut&ocirc;t complexe de la Compatibilit&eacute; &Eacute;lectroMagn&eacute;tique (CEM) des &eacute;quipements &eacute;lectriques. Ce domaine est assez mal ma&icirc;tris&eacute;, car jusqu'&agrave; pr&eacute;sent, il est rest&eacute; confin&eacute; dans des domaines pointus (spatial, militaire, radiodiffusion...).<P>L'&eacute;mergence de nouvelles normes en mati&egrave;re de CEM visant &agrave; r&eacute;duire les parasites &eacute;mis par les &eacute;quipements &eacute;lectriques augmente actuellement de fa&ccedil;on consid&eacute;rable le champ d'action de cette discipline.<P>Il n'est pas question dans ce cours de rentrer dans le d&eacute;tail des notions complexes de ce domaine ; le but est juste de sensibiliser de futurs sp&eacute;cialistes en mesure aux plus gros probl&egrave;mes qu'ils devront affronter, et leur permettre :<P> - d'&eacute;viter les pi&egrave;ges les plus grossiers.<P> - de &quot; flairer&nbsp;&quot; les pi&egrave;ges plus subtils ; il feront alors appel &agrave; un sp&eacute;cialiste de la CEM qui les aidera &agrave; mettre le montage de mesure au point. Quelquefois, des conseils simples suffiront.<P>&nbsp;<P>&nbsp;<LI><H3><A NAME="P02">NOTIONS DE COUPLAGE &Eacute;LECTRIQUE.</A></H3><P>Pour qu'il y ait couplage, il faut au moins deux &eacute;quipements en pr&eacute;sence : un qui va g&eacute;n&eacute;rer des signaux parasites (le <STRONG>coupable</STRONG>), et un autre qui va subir la perturbation (la <STRONG>victime</STRONG>).<P>Dans notre cas, le coupable pourra &ecirc;tre quelconque (alimentation, ventilateur, ordinateur, c&acirc;ble v&eacute;hiculant des forts courants puls&eacute;s...), et la victime sera l'ensemble compos&eacute; du syst&egrave;me &agrave; mesurer, de l'&eacute;quipement de mesure, et bien s&ucirc;r, encore et toujours des c&acirc;bles.<P>A noter que dans le cas d'un banc de mesure complexe, certaines parties de ce banc peuvent devenir des coupables pour d'autres parties qui en seront victimes...<P>Le couplage est la liaison physique (au sens de ph&eacute;nom&egrave;ne physique) qui va permettre au coupable de polluer la victime.<P>Les six modes de couplage recens&eacute;s sont les suivants :<P> - couplage par <STRONG>imp&eacute;dance commune</STRONG><P> - couplage par <STRONG>diaphonie inductive</STRONG><P> - couplage par <STRONG>diaphonie capacitive</STRONG><P> - couplage <STRONG>carte &agrave; ch&acirc;ssis</STRONG><P> - couplage de <STRONG>champ &agrave; fil</STRONG><P> - couplage de <STRONG>champ &agrave; boucle</STRONG><P>Les quatre premiers sont des couplages par conduction (&agrave; travers une r&eacute;sistance, une inductance, une mutuelle inductance, un condensateur, ces &eacute;l&eacute;ments &eacute;tant parasites), et les deux derniers, des couplages par rayonnement de champs &eacute;lectromagn&eacute;tique.<P>Nous allons voir ces six couplages en d&eacute;tail et &eacute;tudier des exemples concrets pour chacun d'eux.<P>&nbsp;<P>&nbsp;<LI><H3><A NAME="P03">COUPLAGE PAR IMP&Eacute;DANCE COMMUNE.</A></H3><P>Quand on rencontre des probl&egrave;mes de parasitage des mesures, on va souvent chercher des explications compliqu&eacute;es mettant en cause des champs &eacute;lectromagn&eacute;tiques ou pis, des d&eacute;mons inconnus...<P>Tr&egrave;s souvent, nous sommes seulement (&nbsp;!&nbsp;) victimes de couplage par imp&eacute;dance commune.<OL TYPE=A><P>&nbsp;<LI><H4><A NAME="P04">D&Eacute;FINITION.</A></H4><P>Dans une boucle de mesure, on a un couplage par imp&eacute;dance commune lorsqu'une imp&eacute;dance parasite faisant partie de la boucle est parcourue par un courant &eacute;tranger &agrave; la boucle de mesure. La chute de tension cr&eacute;&eacute;e par ce courant dans l'imp&eacute;dance parasite va s'ajouter &agrave; la tension &agrave; mesurer et la fausser.<P>En g&eacute;n&eacute;ral, l'imp&eacute;dance parasite sera r&eacute;sistive (99% des cas), et parfois inductive. Les inductances parasites des c&acirc;bles &eacute;tant faibles, le ph&eacute;nom&egrave;ne sera g&ecirc;nant en HF et lors de commutation rapide de courants importants.<P>Le couplage par inductance est plus probl&eacute;matique pour le concepteur de circuits &eacute;lectroniques rapides que pour le sp&eacute;cialiste en mesures.<P>&nbsp;<LI><H4><A NAME="P05">EXEMPLES.</A></H4><P>Les cas les plus critiques seront toujours les mesures de signaux de faible niveau : le niveau relatif des perturbations devient alors g&ecirc;nant pour qu'on puisse garantir la pr&eacute;cision. Nous allons donc insister sur ces cas.<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P06">Cas d'&eacute;cole.</A></FONT></H5><P>Dans la litt&eacute;rature, ce mode de couplage est pr&eacute;sent&eacute; de la fa&ccedil;on th&eacute;orique suivante&nbsp;:<P align=center><IMG SRC="PERTU.FIG/PERTU01.GIF"><P align=center>Fig. 1. Couplage par imp&eacute;dance commune.<P>Consid&eacute;rons une imp&eacute;dance Z<SUB>m</SUB> aux bornes de laquelle on d&eacute;sire mesurer une tension V<SUB>r</SUB>.<P>Cet &eacute;l&eacute;ment &agrave; mesurer est reli&eacute; &agrave; un amplificateur de mesure de gain A<SUB>v</SUB> par 2 fils, dont l'un pr&eacute;sente une imp&eacute;dance parasite Z<SUB>p</SUB>.<P>La boucle de mesure, sch&eacute;matis&eacute;e figure&nbsp;1 comprend l'imp&eacute;dance aux bornes de laquelle on mesure une tension, l'entr&eacute;e de l'ampli d'instrumentation, et les fils aller (point chaud) et retour (<A HREF="../OUTILS/COURS.HTM#O43" target=_blank>masse</A>) du c&acirc;ble.<P>Dans le cas o&ugrave; l'imp&eacute;dance Z<SUB>m</SUB> est interconnect&eacute;e avec d'autres &eacute;l&eacute;ments (circuit &eacute;lectronique), ainsi que l'ampli de mesure (par exemple &agrave; un oscilloscope), il peut exister un courant parasite I<SUB>p</SUB> ind&eacute;pendant de la mesure et circulant dans le fil d'imp&eacute;dance Z<SUB>p</SUB> liant l'&eacute;l&eacute;ment &agrave; mesurer &agrave; l'amplificateur.<P>Le courant de mesure proprement dit est conditionn&eacute; par l'imp&eacute;dance d'entr&eacute;e de l'ampli, qui est (sauf en HF) en g&eacute;n&eacute;ral tr&egrave;s &eacute;lev&eacute;e (&gt; 1M<IMG SRC="../BASE/ICONES/OHM.GIF">) pour ne justement pas perturber l'&eacute;l&eacute;ment &agrave; mesurer. Ce courant &eacute;tant infime, on va le n&eacute;gliger.<P>Nous &eacute;tudierons dans les exemples suivants d'o&ugrave; peut provenir le courant I<SUB>p</SUB>. Pour l'instant, on va admettre qu'il existe et analyser les perturbations induites.<P>Si on applique la loi d'ohm dans la boucle de mesure, on trouve une tension &agrave; l'entr&eacute;e de l'ampli &eacute;gale &agrave; :<P align=center><IMG SRC="PERTU.FIG/PERTU02.GIF"><P>En effet, l'entr&eacute;e de l'ampli &quot;&nbsp;voit&nbsp;&quot; tout ce qui compose la boucle de mesure, &agrave; savoir la tension &agrave; mesurer plus la chute de tension dans l'imp&eacute;dance parasite Z<SUB>p</SUB>.<UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P07">Application num&eacute;rique.</A></FONT></H5><P>Si le signal V<SUB>r</SUB> est de l'ordre de 100mV (ce qui est d&eacute;j&agrave;, en mesure, une valeur &quot;&nbsp;importante&nbsp;&quot;), I<SUB>p</SUB> = 1A et Z<SUB>p</SUB> = Rp = 10m<IMG SRC="../BASE/ICONES/OHM.GIF">, le signal d'erreur repr&eacute;sentera 10% du signal &agrave; mesurer... et le r&eacute;sultat sera inexploitable !<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P08">Cause fondamentale.</A></FONT></H5><P>Le point de d&eacute;part de toutes ces perturbations est une remise en cause d'un postulat de l'&eacute;lectronique th&eacute;orique : <STRONG>la <A HREF="../OUTILS/COURS.HTM#O43" target=_blank>masse</A> n'est pas une v&eacute;ritable &eacute;quipotentielle</STRONG>, surtout lorsqu'on a plusieurs &eacute;quipements interconnect&eacute;s. C'est le probl&egrave;me de base de la CEM, et c'est d&ucirc; &agrave; un ph&eacute;nom&egrave;ne non pris en compte dans les cours d'&eacute;lectronique de base : tout conducteur, quel qu'il soit, pr&eacute;sente une imp&eacute;dance &agrave; ses bornes. C'est donc vrai pour toutes les liaisons, et en particulier celles entre masses.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P09">D&eacute;passer la mise en &eacute;quation.</A></FONT></H5><P>Ces &eacute;l&eacute;ments th&eacute;oriques ne sont pas suffisants pour permettre au n&eacute;ophyte de les mettre en &eacute;vidence sur une manip, et de voir les branchements et m&eacute;canismes concrets qui ram&egrave;nent &agrave; ce cas d'&eacute;cole.<P>Passons donc au concret : nous allons voir sur 3 cas extr&ecirc;mement r&eacute;pandus en mesure le m&eacute;canisme de couplage par imp&eacute;dance commune.</UL><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P10">Exemple de mesure de courant &agrave; l'aide d'un shunt.</A></FONT></H5><P>L'illustration la plus proche du cas th&eacute;orique pr&eacute;c&eacute;dent est la mesure d'un courant &agrave; l'aide d'un shunt sur un &eacute;quipement &eacute;lectronique.<UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P11">Description du montage.</A></FONT></H5><P>Le montage est compos&eacute; des &eacute;l&eacute;ments suivants&nbsp;:<P> - un montage &eacute;lectronique comprenant le shunt de mesure d'un courant, un des p&ocirc;les du shunt &eacute;tant reli&eacute; &agrave; la masse du montage &eacute;lectronique.<P> - une alimentation stabilis&eacute;e fournissant l'&eacute;nergie au montage &eacute;lectronique.<P> - un oscilloscope permettant de visualiser et mesurer le courant du montage &eacute;lectronique.<P> - un c&acirc;ble coaxial liant le montage &agrave; l'oscilloscope.<P>Le montage r&eacute;el sera le suivant&nbsp;:<P align=center><IMG SRC="PERTU.FIG/PERTU03.GIF"><P align=center>Fig. 2. Mesure sur shunt.<P>Il est tr&egrave;s important de noter que chaque appareil poss&egrave;de sa masse &eacute;lectrique, que ces masses sont reli&eacute;es entre elles par les c&acirc;bles de liaison, et que les masses de l'alimentation et de l'oscilloscope sont reli&eacute;es &agrave; la <A HREF="../OUTILS/COURS.HTM#O44" target=_blank>terre</A>.<P>A ce titre, dans tous les laboratoires, les prises de courant sont toutes &eacute;quip&eacute;es de terre, et tous les appareils &eacute;lectriques et &eacute;lectroniques d'alimentation, de g&eacute;n&eacute;ration et transformation de signaux, et ceux de mesure sont &eacute;quip&eacute;s de prises de terre, ceci afin de mettre ces appareils &agrave; un potentiel tr&egrave;s voisin de celui des humains qui les utilisent : on &eacute;vite ainsi les chocs &eacute;lectriques et on assure la s&eacute;curit&eacute; des personnes qui manipulent.<P>Le respect de ces r&egrave;gles est obligatoire, et les circuits de mise &agrave; la terre sont r&eacute;guli&egrave;rement contr&ocirc;l&eacute;s.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P12">Sch&eacute;ma &eacute;quivalent.</A></FONT></H5><P align=center><IMG SRC="PERTU.FIG/PERTU04.GIF"><P align=center>Fig. 3. Sch&eacute;ma de c&acirc;blage &eacute;quivalent.<P>A partir du sch&eacute;ma de branchement, on va b&acirc;tir le sch&eacute;ma &eacute;lectrique &eacute;quivalent en tenant compte des imp&eacute;dances parasites&nbsp;des c&acirc;bles (Fig. 3.).<P>Dans ce sch&eacute;ma, nous n'avons mentionn&eacute; que les r&eacute;sistances parasites. Le raisonnement serait strictement le m&ecirc;me si on incluait les selfs parasites.<P>Si dans un premier temps on supprime l'oscilloscope, le fonctionnement est le suivant : tout le courant I<SUB>s</SUB> circulant dans le shunt est fourni par le p&ocirc;le + de l'alimentation et revient par le p&ocirc;le - de cette alimentation, ainsi que les autres courants circulant dans le module &eacute;lectronique.<P>La prise de <A HREF="../OUTILS/COURS.HTM#O44" target=_blank>terre</A> sert uniquement &agrave; mettre le montage au potentiel de la terre&nbsp;: <STRONG>aucun courant ne circule dans cette connexion</STRONG> (sauf gros probl&egrave;me !).<P>Si maintenant on rajoute l'oscilloscope avec sa prise de terre, et le c&acirc;ble de liaison avec le montage &eacute;lectronique, la r&egrave;gle pr&eacute;c&eacute;dente reste valable : aucun courant ne &quot;&nbsp;dispara&icirc;t&nbsp;&quot; dans la terre. Par contre, le courant I<SUB>s</SUB> circulant dans le shunt a maintenant 2 circuits possibles pour retourner vers l'alimentation&nbsp;:<P> - le circuit direct pr&eacute;vu &agrave; cet effet, &agrave; savoir le c&acirc;ble de masse reliant l'alimentation au montage (courant I<SUB>1</SUB>).<P> - un circuit parasite, compos&eacute; du fil de masse du c&acirc;ble de mesure, du fil de terre reliant l'oscilloscope au secteur, et du fil de terre reliant le secteur &agrave; l'alimentation (courant I<SUB>2</SUB>).<P>Les courants I<SUB>1</SUB> et I<SUB>2</SUB> peuvent &ecirc;tre ais&eacute;ment calcul&eacute;s par la loi du diviseur de courant&nbsp;:<P align=center><IMG SRC="PERTU.FIG/PERTU05.GIF"><P align=center><IMG SRC="PERTU.FIG/PERTU06.GIF"><P>On retrouve ici le cas d'&eacute;cole, avec l'imp&eacute;dance parasite qui est R<SUB>cbl</SUB> et le courant parasite I<SUB>2</SUB> circulant dans la boucle de mesure. On en d&eacute;duit alors facilement la valeur du signal d'erreur V<SUB>err</SUB>&nbsp;:<P align=center><IMG SRC="PERTU.FIG/PERTU07.GIF"><P align=center><IMG SRC="PERTU.FIG/PERTU08.GIF"><P>Ces &eacute;quations sont donn&eacute;es &agrave; titre indicatif : dans la pratique, on ne connait pas les imp&eacute;dances parasites avec pr&eacute;cision, ni surtout les r&eacute;sistances de contact des c&acirc;bles aux borniers. On ne saura donc pas faire un calcul pr&eacute;cis. On se bornera &agrave; estimer un ordre de grandeur de l'erreur qu'on corr&egrave;lera &agrave; l'aide de la mesure d'une pi&egrave;ce &eacute;talon pour voir si on ne fait pas fausse route dans le diagnostic des sources d'erreur de la mesure.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P13">Discussion.</A></FONT></H5><P>Ce cas typique (et surtout ses variantes) se pr&eacute;sente assez souvent ; il permet de faire le lien avec le cas d'&eacute;cole, et surtout, de voir le m&eacute;canisme de bouclage des courants par des circuits d&eacute;riv&eacute;s, et donc d'interpr&eacute;ter la pr&eacute;sence d'un courant parasite dans la boucle de mesure (le diagnostic &eacute;tant fait, il sera plus facile d'&eacute;liminer ce courant ou ses cons&eacute;quences).<P>Il faut noter un aspect extr&ecirc;mement vicieux du ph&eacute;nom&egrave;ne de &quot;&nbsp;parasitage&nbsp;&quot; de la mesure dans ce cas particulier : le signal d'erreur a exactement la m&ecirc;me forme que le signal utile&nbsp;; il ne va affecter que son amplitude, et le r&eacute;sultat de mesure para&icirc;tra &quot;&nbsp;propre&nbsp;&quot;. Il sera alors difficile de d&eacute;tecter l'erreur si on ne conna&icirc;t pas exactement le r&eacute;sultat attendu (on a int&eacute;r&ecirc;t dans ce cas &agrave; mesurer une pi&egrave;ce &eacute;talon pour valider la mesure).<P>Le pi&egrave;ge est plus grossier et facilement d&eacute;tectable quand le courant parasite n'est pas celui qu'on d&eacute;sire mesurer&nbsp;: l'oscilloscope montre alors un &quot;&nbsp;vrai&nbsp;&quot; bruit.<P>La principale parade existant pour contrer la circulation de ces courants parasites consiste &agrave; faire une <A HREF="../AINST/COURS.HTM#AI07" target=_blank>mesure diff&eacute;rentielle</A>&nbsp;: ceci fera l'objet d'un cours sp&eacute;cifique.<P><STRONG><EM>Remarque</EM></STRONG> : ce type de perturbation se rencontre plus g&eacute;n&eacute;ralement pour toute mesure faite en mode commun (mesure d'un point chaud par rapport &agrave; la <A HREF="../OUTILS/COURS.HTM#O43" target=_blank>masse</A>).<P>Il est clair que si dans l'exemple pr&eacute;c&eacute;dent <A HREF="../AINST/COURS.HTM#AI08" target=_blank>le shunt &eacute;tait flottant</A> (aucun p&ocirc;le &agrave; la masse), il serait hors de question de faire une mesure de mode commun en mettant un des p&ocirc;les du shunt directement &agrave; la masse de l'oscilloscope par exemple : on court-circuiterait une partie du montage &eacute;lectronique, avec tous les d&eacute;g&acirc;ts que cela peut engendrer. Dans ce cas, la mesure en diff&eacute;rentiel est <STRONG>imp&eacute;rative</STRONG>.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P14">Extension &agrave; d'autres cas.</A></FONT></H5><P>En pratique, les mesures sur shunt sont (presque) toujours faites en mode diff&eacute;rentiel&nbsp;: il n'y aura donc pas de probl&egrave;me dans ce cas.<P>Par contre, il est plus fr&eacute;quent qu'on ait &agrave; mesurer une faible tension par rapport &agrave; la masse sur une carte &eacute;lectronique o&ugrave; circulent des forts courants. Les perturbations seront strictement les m&ecirc;mes : les forts courants auront souvent (au moins) deux chemins possibles pour retourner au p&ocirc;le - de l'alimentation, et un de ces chemins est en g&eacute;n&eacute;ral le fil de masse du c&acirc;ble de mesure.<P>Si les courants sont puls&eacute;s (pr&eacute;sence d'une alimentation &agrave; d&eacute;coupage par exemple), il faudra prendre en compte les inductances parasites pour expliquer des surtensions br&egrave;ves mais parfois de forte amplitude au moment des commutations du courant parasite. Ces surtensions peuvent &ecirc;tre dangereuses pour certains &eacute;quipements de mesure fragiles.</UL><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P15">Mesure simultan&eacute;e  d'une tension et d'un courant par sonde.</A></FONT></H5><P>Cet exemple particulier va nous montrer que m&ecirc;me si la sonde de mesure est &quot;&nbsp;isol&eacute;e&nbsp;&quot; du montage &agrave; mesurer, on peut avoir des couplages parasites venant fausser les r&eacute;sultats.<UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P16">Description du montage.</A></FONT></H5><P>On se propose de mesurer un courant sur un montage &eacute;lectronique par l'interm&eacute;diaire d'une sonde de courant, ainsi qu'une tension (sonde reli&eacute;e &agrave; l'oscilloscope).<P>Pour ce faire, on dispose&nbsp;:<P> - d'un montage &eacute;lectronique.<P> - d'une alimentation stabilis&eacute;e fournissant l'&eacute;nergie au montage.<P> - d'un oscilloscope.<P> - d'une sonde d'oscilloscope standard.<P> - d'une sonde de courant et de son amplificateur, celui-ci d&eacute;livrant une tension proportionnelle au courant mesur&eacute;. Cette tension doit &ecirc;tre analys&eacute;e &agrave; l'oscilloscope positionn&eacute; sur le calibre 10mV/div (faible signal).<P align=center><IMG SRC="PERTU.FIG/PERTU09.GIF"><P align=center>Fig. 4. Mesure de courant par sonde.<P>Le principe de la sonde de courant est bas&eacute; sur des ph&eacute;nom&egrave;nes de couplage par mutuelle induction (transformateur de courant) ou sur l'effet hall, celui-ci permettant de mesurer des courants continus. Dans tous les cas, il n'y a pas besoin de couper le circuit pour mesurer le courant comme dans le cas d'un shunt. La sonde de courant se pr&eacute;sente sous forme d'une pince entourant le c&acirc;ble o&ugrave; circule le courant &agrave; mesurer : il y a donc isolation parfaite entre la sonde et le circuit &agrave; mesurer.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P17">Sch&eacute;ma &eacute;quivalent</A></FONT></H5><P align=center><IMG SRC="PERTU.FIG/PERTU10.GIF"><P align=center>Fig. 5. Sch&eacute;ma &eacute;quivalent<P>Si on fait le sch&eacute;ma &eacute;quivalent du montage comme dans l'exemple pr&eacute;c&eacute;dent, on pourra constater les choses suivantes&nbsp;: si on mesure uniquement le courant, la sonde de tension &eacute;tant d&eacute;branch&eacute;e, il n'y a aucun probl&egrave;me. D&egrave;s que l'on rajoute la sonde de tension, et surtout, sa connection de masse sur le montage, on ouvre la voie &agrave; deux chemins parasites pour le courant de retour du montage &eacute;lectronique&nbsp;: un va transiter par le c&acirc;ble de masse de la sonde de tension, l'autre par le c&acirc;ble de masse liant l'ampli de sonde de courant &agrave; l'oscilloscope. On pollue d'un seul coup deux signaux&nbsp;!</UL><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P18">Application &agrave; la mesure de faibles r&eacute;sistances : mesure 4 points.</A></FONT></H5><P>Une mesure de r&eacute;sistance est faite selon le principe suivant : on injecte un courant calibr&eacute; dans la r&eacute;sistance &agrave; mesurer, et on mesure la chute de tension induite aux bornes de cette r&eacute;sistance.<P>Dans ce cas, l'instrument de mesure (un multim&egrave;tre) va comporter &agrave; la fois le g&eacute;n&eacute;rateur de courant et le voltm&egrave;tre (qui est, rappelons le, l'instrument de mesure de base).<P>Dans les multim&egrave;tre &agrave; bon march&eacute;, il n'y a que deux bornes de sortie permettant de faire cette mesure : les cordons de mesure vont donc servir &agrave; v&eacute;hiculer le courant et recueillir la tension.<P align=center><IMG SRC="PERTU.FIG/PERTU11.GIF"><P align=center>Fig. 6. Principe de mesure d'une r&eacute;sistance.<P>Or, ces c&acirc;bles, ainsi que leur contact avec le composant &agrave; mesurer sont r&eacute;sistifs. Le courant de mesure va donc provoquer des chutes de tension parasites dans ces r&eacute;sistances, et au lieu de mesurer R<SUB>test</SUB>, on va mesurer R<SUB>test</SUB> + R<SUB>cord1</SUB> + R<SUB>cord2</SUB>&nbsp;:<P align=center><IMG SRC="PERTU.FIG/PERTU12.GIF"><P align=center>Fig. 7. Perturbation de la mesure de r&eacute;sistance.<P>Le ph&eacute;nom&egrave;ne sera plus g&ecirc;nant pour les mesures de faibles r&eacute;sistances, car les r&eacute;sistances parasites ont une valeur sensiblement constante : plus la r&eacute;sistance mesur&eacute;e a une valeur &eacute;lev&eacute;e, plus l'erreur sera faible.<P>L&agrave; encore, on est en pr&eacute;sence de couplage par imp&eacute;dance commune. D'aucun objecteront que le courant &quot;&nbsp;parasite&nbsp;&quot; est le courant de mesure. En fait, on peut consid&eacute;rer que l'instrument de mesure est le voltm&egrave;tre, et qu'il est perturb&eacute; par le courant I qui est pour lui un courant parasite&nbsp;!<P>La parade &agrave; cet inconv&eacute;nient consiste &agrave; faire une mesure dite &quot;&nbsp;4 points&nbsp;&quot; : on am&egrave;ne le courant de mesure et on lit la tension avec deux jeux de c&acirc;bles diff&eacute;rents. On lit alors vraiment la valeur de la r&eacute;sistance &agrave; mesurer&nbsp;:<P align=center><IMG SRC="PERTU.FIG/PERTU13.GIF"><P align=center>Fig. 8. Mesure de r&eacute;sistance &quot;&nbsp;4 points&nbsp;&quot;<P>Les multim&egrave;tres de pr&eacute;cision poss&egrave;dent 4 bornes de sortie pour la mesure 4 fils :<P> - 2 bornes not&eacute;es &quot;&nbsp;force&nbsp;&quot; qui injectent le courant.<P> - 2 bornes not&eacute;es &quot;&nbsp;sense&nbsp;&quot; qui mesurent la tension.<P>Attention &agrave; la pr&eacute;cision&nbsp;! 1k<IMG SRC="../BASE/ICONES/OHM.GIF"> n'est pas une faible valeur, certes, mais si on veut mesurer une telle r&eacute;sistance avec une pr&eacute;cision de 1 pour 10000, il faudra passer par une mesure 4 points, alors que ce ne sera pas n&eacute;cessaire pour mesurer 100<IMG SRC="../BASE/ICONES/OHM.GIF"> &agrave; 1%. Tout est relatif&nbsp;!<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P19">Conclusions.</A></FONT></H5><P>Ces petits exemples de tous les jours ont permis de mettre en &eacute;vidence les m&eacute;canismes de couplage par imp&eacute;dance commune. Les &eacute;l&eacute;ments essentiels &agrave; retenir sont :<P> - les &quot;&nbsp;&eacute;quipotentielles&nbsp;&quot; ne sont jamais parfaites.<P> - il convient de bien faire le sch&eacute;ma &eacute;quivalent de tout le montage, en prenant en compte tous les chemins possibles (mises &agrave; la terre, mises &agrave; la masse multiples...) pour arriver &agrave; d&eacute;tecter les probl&egrave;mes et y rem&eacute;dier.<P> - on aura d'autant plus de probl&egrave;mes qu'un des appareils consommera ou g&eacute;n&eacute;rera des forts courants.<P> - il faut se rappeler qu'un c&acirc;ble de masse suppl&eacute;mentaire mal plac&eacute; sur un montage de mesure peut fausser toutes les mesures&nbsp;: il faut r&eacute;fl&eacute;chir &agrave; deux fois avant de modifier quelque chose qui marche&nbsp;!<P> - ces exemples illustrent l'ampleur des probl&egrave;mes potentiels qui se posent lors de la conception d'un <A HREF="../MESU/COURS.HTM#M18" target=_blank> banc de mesure automatis&eacute;</A>, r&eacute;alisant la commande, la mesure et le traitement d'un grand nombre de param&egrave;tres, et comprenant plusieurs appareils interconnect&eacute;s&nbsp;!</OL><P>&nbsp;<LI><H4><A NAME="P20">REM&Egrave;DES.</A></H4><P>Il n'y a pas de rem&egrave;de miracle universel et poss&eacute;dant toutes les qualit&eacute;s. Tr&egrave;s souvent, un simple toilettage du montage suffira (c&acirc;blage rationnel des appareils, pas de c&acirc;bles superflus, c&acirc;bles courts...).<P>Ensuite, en fonction des r&eacute;sultats d&eacute;sir&eacute;s et des moyens disponibles, on pourra piocher dans les m&eacute;thodes propos&eacute;es ci dessous.<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P21">&quot;&nbsp;Flottement&nbsp;&quot; d'un appareil.</A></FONT></H5><P>Nous avons vu que la source de tous nos probl&egrave;mes venait souvent de couplages d&ucirc;s aux liaisons &agrave; la terre des divers appareils interconnect&eacute;s.<P>Pour &eacute;viter ces probl&egrave;mes &agrave; peu de frais, on peut &ecirc;tre tent&eacute;s de couper ces liaisons avec la terre.<P>Mais alors, attention&nbsp;!&nbsp;!&nbsp;! Ce genre de manipulation peut &ecirc;tre extr&ecirc;mement dangereux, et ne devra pas &ecirc;tre fait &agrave; la l&eacute;g&egrave;re. Dans tous les cas, il faudra qu'il subsiste au moins un appareil &agrave; la terre pour assurer la s&eacute;curit&eacute; des personnes qui vont manipuler les appareils.<P>Il faudra que toutes les liaisons entre appareils restent en place (et notamment les masses).<P>De plus, on risque de se retrouver avec des couplages autres (<A HREF="#P34">carte &agrave; ch&acirc;ssis</A> par exemple) qui ruineront les gains obtenus, surtout s'il existe des courants ou tensions HF dans le montage. Cette m&eacute;thode est donc fortement d&eacute;conseill&eacute;e dans la plupart des cas.<P>Tout au plus, dans certaines manips, on pourra d&eacute;solidariser l'alimentation stabilis&eacute;e de la terre. Certaines alimentations poss&egrave;dent d'ailleurs des bornes de masse et de terre s&eacute;par&eacute;es en face avant. On pourra ou non les relier en fonction des besoins. On constatera alors le r&eacute;sultat sur l'oscilloscope : si le flottement donne de bons r&eacute;sultats, on laissera tel quel, sinon, on remettra la connexion de terre.<P>Cette m&eacute;thode peut &ecirc;tre efficace dans les exemples de mesure sur shunt ou avec la sonde de courant cit&eacute;s plus haut. A proscrire si les tensions mises en jeu sont &eacute;lev&eacute;es&nbsp;!<P>Il est tr&egrave;s d&eacute;conseill&eacute; de flotter des oscilloscopes : certains sont alors dangereux. De plus, les potentiels atteints par le ch&acirc;ssis peuvent l'endommager.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P22">Mesure en diff&eacute;rentiel.</A></FONT></H5><P>C'est une m&eacute;thode quasi universelle pour la r&eacute;solution de ce genre de probl&egrave;me. Nous allons l'&eacute;tudier en d&eacute;tail au <A HREF="../AINST/COURS.HTM#AI07" target=_blank>chapitre suivant&nbsp;</A>: &quot;&nbsp;L'amplificateur d'instrumentation&nbsp;&quot;.<P>Elle n'est pas utilis&eacute;e syst&eacute;matiquement, car elle est plus complexe &agrave; mettre en &#156;uvre et plus ch&egrave;re qu'une mesure simple par rapport &agrave; la masse.<P>De plus, les amplificateurs diff&eacute;rentiels ont aussi des limitations qui emp&ecirc;chent leur utilisation partout.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P23">Amplification &quot;&nbsp;&agrave; la source&nbsp;&quot;.</A></FONT></H5><P>Si on con&ccedil;oit soi-m&ecirc;me la carte &eacute;lectronique dont on veut mesurer un faible signal, il est possible d'amplifier ce signal sur la carte m&ecirc;me. Dans ce cas, la r&eacute;jection du signal d'erreur sera multipli&eacute;e par le gain de l'amplificateur.<P>Par exemple, si on a un signal utile de 100mV et un signal d'erreur de 10mV d&ucirc; au c&acirc;blage, un ampli de gain 10 va permettre de monter la tension utile &agrave; 1V, et le signal d'erreur ne fera plus que 1% du signal utile au lieu de 10%. L'ampli &quot;&nbsp;local&nbsp;&quot; &eacute;tant r&eacute;f&eacute;renc&eacute; &agrave; la masse du montage, il n'y a pas de probl&egrave;me local de couplage par imp&eacute;dance commune (&agrave; condition que le routage du montage &eacute;lectronique soit fait convenablement&nbsp;!).<P>Le c&acirc;ble de mesure va alors v&eacute;hiculer un signal de fort niveau et &agrave; basse imp&eacute;dance, donc &quot;&nbsp;robuste&nbsp;&quot;.<P>Cette m&eacute;thode peut &ecirc;tre tr&egrave;s bon march&eacute; et efficace. Elle &eacute;vite une mesure en diff&eacute;rentiel, plus lourde &agrave; mettre en &#156;uvre et plus ch&egrave;re.</OL></OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="P24">COUPLAGE PAR DIAPHONIE INDUCTIVE.</A></H3><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="P25">D&Eacute;FINITION.</A></H4><P> Tout <STRONG>courant variable</STRONG> circulant dans un conducteur va cr&eacute;er un champ magn&eacute;tique  autour de lui. La variation de flux ainsi produite va cr&eacute;er des tensions induites parasites dans les boucles form&eacute;es par les c&acirc;bles conducteurs contigus au c&acirc;ble perturbateur.<P>En pratique, cela revient &agrave; consid&eacute;rer la mutuelle inductance entre le c&acirc;ble perturbateur et le c&acirc;ble victime.<P>Parmi les perturbateurs, on fera attention aux c&acirc;bles d'alimentation des convertisseurs statiques, des moteurs &eacute;lectriques, des relais, et aussi aux c&acirc;bles v&eacute;hiculant des signaux logiques &agrave; front raide.<P>En mesure, on aura des probl&egrave;mes avec les convertisseurs statiques, et aussi avec des c&acirc;bles en nappe dans le cas de bancs informatis&eacute;s : ces c&acirc;bles sont pratiques pour v&eacute;hiculer beaucoup de signaux sans avoir une for&ecirc;t de fils, mais ils posent des gros probl&egrave;mes de diaphonie.<P>&nbsp;<LI><H4><A NAME="P26">REM&Egrave;DES.</A></H4><P>Les rem&egrave;des peuvent &ecirc;tre simples : <P> - dans la mesure du possible, on &eacute;loignera les c&acirc;bles &agrave; courants puls&eacute;s (dI/dt &eacute;lev&eacute;s) des c&acirc;bles v&eacute;hiculant des signaux faible niveau &agrave; mesurer.<P> - surtout, il faudra se garder de faire courir le c&acirc;ble source et le c&acirc;ble victime parall&egrave;lement sur une grande distance.<P> - si le c&acirc;ble source et le c&acirc;ble victime doivent se croiser, il faudra le faire &agrave; angle droit (couplage nul, m&ecirc;me si les deux c&acirc;bles se touchent).<P> - on &eacute;vitera de faire circuler dans un c&acirc;ble en nappe des signaux logiques (fort dI/dt) et des signaux analogiques bas niveau.<P> - afin de r&eacute;duire la boucle form&eacute;e par les conducteurs aller et retour d'un signal bas niveau, on rapprochera ces deux fils au maximum.<P> - dans la mesure du possible, on torsadera ces deux c&acirc;bles : le champ perturbateur va cr&eacute;er des effets qui vont s'annuler gr&acirc;ce &agrave; l'inversion des c&acirc;bles induite par le torsadage.</OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="P27">COUPLAGE PAR DIAPHONIE CAPACITIVE</A></H3><P>Ce ph&eacute;nom&egrave;ne est d&ucirc; au fait que deux conducteurs en regard et s&eacute;par&eacute;s par un di&eacute;lectrique (l'air, ou un isolant quelconque) forment une capacit&eacute; qui va les relier.<OL TYPE=A><P>&nbsp;<LI><H4><A NAME="P28">D&Eacute;FINITION.</A></H4><P>Le couplage par diaphonie capacitive est cr&eacute;&eacute; par <STRONG>variation de tension</STRONG> entre deux conducteurs en regard. La capacit&eacute; parasite form&eacute;e par les deux conducteurs va pr&eacute;senter une imp&eacute;dance faible en HF &agrave; cette variation de ddp et permettre le passage d'un courant parasite.<P><STRONG><EM>Remarque</EM></STRONG> : la diff&eacute;rence essentielle qu'il y a avec la diaphonie inductive est que la <STRONG>diaphonie capacitive est provoqu&eacute;e par une variation de tension</STRONG> (champ &eacute;lectrique), alors que la <STRONG>diaphonie inductive est provoqu&eacute;e par une variation de courant</STRONG> (champ magn&eacute;tique).<P>&nbsp;<LI><H4><A NAME="P29">EXEMPLES.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P30">Isolation galvanique.</A></FONT></H5><P>Une m&eacute;thode a &eacute;t&eacute; beaucoup utilis&eacute;e pendant l'&acirc;ge d'or de l'&eacute;lectronique analogique pour r&eacute;soudre les probl&egrave;mes de couplage par imp&eacute;dance commune : c'est l'isolation galvanique, r&eacute;alis&eacute;e notamment &agrave; l'aide de transformateurs d'isolement, et plus r&eacute;cemment, par des isolateurs opto-&eacute;lectroniques.<P>Les diff&eacute;rents &eacute;l&eacute;ments d'un syst&egrave;me &eacute;lectronique &eacute;tant isol&eacute;s, il n'y a plus de chemin pour les courants parasites.<P align=center><IMG SRC="PERTU.FIG/PERTU14.GIF"><P align=center>Fig. 9. Isolation galvanique en HF.<P>Ce rem&egrave;de &eacute;tait valable &agrave; une certaine &eacute;poque, lorsqu'on travaillait principalement avec des fr&eacute;quences relativement faibles, et que la commutation en &eacute;tait &agrave; ses balbutiements.<P>Aujourd'hui, les choses ont chang&eacute; : les fr&eacute;quences de travail sont tr&egrave;s &eacute;lev&eacute;es, on a de plus en plus de signaux logiques tr&egrave;s rapides (on d&eacute;passe le GHz pour les processeurs), et la commutation est entr&eacute;e en force dans l'&eacute;lectronique de puissance.<P>Il y a donc de plus en plus de signaux HF dans les circuits &eacute;lectroniques actuels, qui vont mettre en d&eacute;faut les composants d'isolation galvanique. En effet, ceux-ci pr&eacute;sentent entre les deux parties isol&eacute;es des capacit&eacute;s parasites non n&eacute;gligeables : de quelques pF pour les composants optiques &agrave; quelques dizaines  de pF pour les transformateurs.<P>Si le secondaire du transformateur d'isolement est soumis &agrave; des variations rapides de tension de mode commun, les capacit&eacute;s parasites vont r&eacute;injecter ces signaux au primaire, et pourront perturber par conduction tout le circuit &eacute;lectronique qui y est reli&eacute;.<P>La figure 9 est une illustration d'isolation galvanique par transformateur. On y remarque deux masses&nbsp;: ces deux masses sont bien &eacute;videmment s&eacute;par&eacute;es, sinon, l'isolation galvanique n'aurait pas de sens&nbsp;! Ce sont des masses locales. Si une ddp appara&icirc;t entre ces deux masses (tension de mode commun <IMG SRC="../BASE/ICONES/DELTA.GIF" align=bottom>V<SUB>mc</SUB>), les capacit&eacute;s parasites C<SUB>p2</SUB> et C<SUB>p2</SUB> laisseront passer les composantes HF de cette tension, introduisant une tension de mode commun sur le circuit amont qui peut perturber ce circuit et les appareils qui y sont reli&eacute;s.<P>Il faut noter que les capacit&eacute;s parasites C<SUB>p1</SUB> et C<SUB>p2</SUB> n'existent pas physiquement telles quelles&nbsp;: la capacit&eacute; parasite est en fait r&eacute;partie uniform&eacute;ment sur tout le bobinage. Les deux capacit&eacute;s discr&egrave;tes indiqu&eacute;es sur le sch&eacute;ma sont des capacit&eacute;s &eacute;quivalentes permettant de raisonner et de faire des calculs simples.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P31">Routage des circuits imprim&eacute;s.</A></FONT></H5><P>Dans les interfaces de mesure, on trouve presque toujours des signaux analogiques, souvent bas niveau et/ou &agrave; haute imp&eacute;dance voisinant avec des signaux logiques rapides.<P align=center><IMG SRC="PERTU.FIG/PERTU15.GIF"><P align=center>Fig. 10. C&acirc;blage d'une carte mixte.<P>Il ne faudra jamais perdre de vue que si deux de ces pistes sur un tel circuit imprim&eacute; sont rout&eacute;es parall&egrave;lement et &agrave; faible distance l'une de l'autre, elles vont &ecirc;tre reli&eacute;es par une capacit&eacute; parasite non n&eacute;gligeable. Le signal analogique pourra alors &ecirc;tre pollu&eacute; par les variations rapides de potentiel inh&eacute;rentes aux signaux logiques.<P>Prenons l'exemple de la figure 10&nbsp;: un capteur est reli&eacute; &agrave; une carte &eacute;lectronique&nbsp;; il est &eacute;quivalent &agrave; un g&eacute;n&eacute;rateur de tension E<SUB>c</SUB> en s&eacute;rie avec une r&eacute;sistance R<SUB>c</SUB>. Sur la carte &eacute;lectronique, le signal est conditionn&eacute; par un amplificateur &agrave; haute imp&eacute;dance d'entr&eacute;e (amplificateur op&eacute;rationnel ou d'instrumentation par exemple).<P>L'entr&eacute;e du capteur est voisine d'une entr&eacute;e logique, et les pistes cheminent parall&egrave;lement sur quelques centim&egrave;tres&nbsp;: il en r&eacute;sulte une capacit&eacute; parasite C<SUB>p</SUB> reliant ces deux pistes.<P>Pour la suite, on va supposer que le signal logique est d&eacute;livr&eacute; par un g&eacute;n&eacute;rateur de tension &agrave; imp&eacute;dance interne faible qu'on va donc n&eacute;gliger.<P>On va consid&eacute;rer aussi que ce signal logique de tension V<SUB>l</SUB> est p&eacute;riodique&nbsp;: il est alors possible de le d&eacute;composer en une s&eacute;rie de Fourier&nbsp;:<P align=center><IMG SRC="PERTU.FIG/PERTU16.GIF"><P>La pulsation du fondamental est <IMG SRC="../BASE/ICONES/PULS.GIF" align=bottom>, et correspond &agrave; une fr&eacute;quence f<SUB>o</SUB>. En th&eacute;orie, la s&eacute;rie est infinie&nbsp;; en pratique, au del&agrave; d'une certaine fr&eacute;quence, les composantes V<SUB>il</SUB> sont n&eacute;gligeables.<P>Le sch&eacute;ma &eacute;quivalent de ce montage &eacute;lectronique est le suivant&nbsp;:<P align=center><IMG SRC="PERTU.FIG/PERTU17.GIF"><P align=center>Fig. 11. Sch&eacute;ma &eacute;quivalent.<P>La tension &agrave; l'entr&eacute;e de l'amplificateur est &eacute;gale &agrave;&nbsp;:<P align=center><IMG SRC="PERTU.FIG/PERTU18.GIF"><P>Dans cette &eacute;quation, Z<SUB>Cp</SUB> repr&eacute;sente l'imp&eacute;dance complexe de la capacit&eacute; C<SUB>p</SUB>, et est &eacute;gale &agrave; :<P align=center><IMG SRC="PERTU.FIG/PERTU19.GIF"><P>La pulsation <IMG SRC="../BASE/ICONES/PULS.GIF" align=bottom><SUB>i</SUB>, &eacute;gale &agrave; i<IMG SRC="../BASE/ICONES/PULS.GIF" align=bottom>, est celle de l'harmonique i des composantes de Fourier du signal logique (les harmoniques d'ordre &eacute;lev&eacute; sont les plus perturbantes), et la pulsation <IMG SRC="../BASE/ICONES/PULS.GIF" align=bottom><SUB>c</SUB> celle du signal d&eacute;livr&eacute; par le capteur.<P>On voit clairement (deuxi&egrave;me terme de l'&eacute;quation [7]) que le terme perturbateur est proportionnel au pont diviseur form&eacute; par la capacit&eacute; parasite d'une part, et l'imp&eacute;dance &eacute;quivalente de Th&eacute;venin vue du point perturb&eacute; de la piste sensible.<P>Ici, cette imp&eacute;dance &eacute;quivalente est &eacute;gale &agrave; l'imp&eacute;dance interne du capteur en parall&egrave;le avec l'imp&eacute;dance d'entr&eacute;e de l'ampli, qui est en g&eacute;n&eacute;ral tr&egrave;s grande.<P>Plus l'imp&eacute;dance de la capacit&eacute; sera faible, plus grande sera la perturbation. C'est aux fr&eacute;quences &eacute;lev&eacute;es qu'on aura le plus de probl&egrave;mes (c'est le cas des harmoniques des signaux logiques).<P>On pourra noter au passage que la capacit&eacute; parasite diminue l'imp&eacute;dance sous laquelle le capteur &quot;&nbsp;voit&nbsp;&quot; le circuit d'entr&eacute;e (premier terme de l'&eacute;quation [7]). Il faudra  prendre ce ph&eacute;nom&egrave;ne en compte si le capteur d&eacute;livre des composantes &agrave; haute fr&eacute;quence (<IMG SRC="../BASE/ICONES/PULS.GIF" align=bottom><SUB>c</SUB> &eacute;lev&eacute;e).<P>On peut tirer deux conclusions de ce rapide calcul&nbsp;:<P> - On a int&eacute;r&ecirc;t &agrave; diminuer autant que faire se peut les capacit&eacute;s de couplages en &eacute;vitant de faire cheminer des pistes sensibles en parall&egrave;le avec des pistes perturbantes. Il convient de noter ici que si l'imp&eacute;dance de la source perturbatrice est non nulle, elle se rajoute &agrave; l'imp&eacute;dance de la capacit&eacute; parasite, ce qui a un effet b&eacute;n&eacute;fique. En pratique, il ne faut pas r&ecirc;ver, les imp&eacute;dances de source des perturbateurs sont souvent faibles...<P> - Les circuits &agrave; haute imp&eacute;dance d'entr&eacute;e sont particuli&egrave;rement sensibles aux couplages capacitifs. On sera en permanence pris entre deux imp&eacute;ratifs&nbsp;: avoir un ampli &agrave; forte imp&eacute;dance d'entr&eacute;e pour ne pas perturber le capteur, et limiter au maximum l'effet des couplages capacitifs parasites, donc, avoir une faible imp&eacute;dance d'entr&eacute;e...<P>Il y aura donc toujours un compromis &agrave; faire. En pratique, on choisira l'imp&eacute;dance d'entr&eacute;e la plus basse possible qui soit compatible avec les imp&eacute;ratifs de pr&eacute;cision de mesure qu'on s'est fix&eacute;s.<P>Si les signaux d&eacute;livr&eacute;s par le capteur sont &agrave; basse fr&eacute;quence, un filtre passe bas dispos&eacute; &agrave; l'entr&eacute;e de l'amplificateur permettra de r&eacute;soudre &agrave; bon compte certains probl&egrave;mes de diaphonie avec des signaux logiques.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P32">C&acirc;ble en nappe.</A></FONT></H5><P>Comme dans le cas de la diaphonie inductive, les signaux fragiles circulant dans un c&acirc;ble en nappe vont &ecirc;tre pollu&eacute;s par les variations relatives de potentiel qui existent sur les c&acirc;bles contigus, et ceci via les capacit&eacute;s parasites existant fatalement entre ces c&acirc;bles.<P>M&ecirc;me rem&egrave;de : ne pas faire circuler des signaux &quot;&nbsp;fragiles&nbsp;&quot; &agrave; c&ocirc;t&eacute; de signaux &agrave; fort dV/dt.</OL><P>&nbsp;<LI><H4><A NAME="P33">CONCLUSION.</A></H4><P>Le couplage capacitif sera perturbant uniquement lorsque le montage de mesure sera entour&eacute; de mat&eacute;riel fonctionnant &agrave; haute fr&eacute;quence.<P>Ce cas sera malheureusement courant, car la logique est pr&eacute;sente quasiment partout, et les fronts raides des signaux logiques sont g&eacute;n&eacute;rateurs de parasites HF.<P>Les principaux rem&egrave;des sont la s&eacute;paration des c&acirc;bles perturbateurs et perturb&eacute;s, faire des circuits d'interface &agrave; la plus basse imp&eacute;dance possible, et en dernier recours, filtrer.<P>Une autre conclusion remarquable est qu'un isolement galvanique ne prot&egrave;ge pas des perturbations de mode commun HF.</OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="P34">COUPLAGE CARTE &Agrave; CH&Acirc;SSIS.</A></H3><P>Ce mode de couplage va affecter prioritairement des &eacute;quipements isol&eacute;s de leur ch&acirc;ssis (le bo&icirc;tier prot&eacute;geant l'&eacute;quipement consid&eacute;r&eacute;) soumis &agrave; des tensions de mode commun HF &eacute;lev&eacute;es. Il est finalement un cas particulier de la diaphonie capacitive.<OL TYPE=A><P>&nbsp;<LI><H4><A NAME="P35">D&Eacute;FINITION.</A></H4><P>Le couplage carte &agrave; ch&acirc;ssis a lieu lorsqu'une carte &eacute;lectronique est isol&eacute;e du bo&icirc;tier qui l'enveloppe, et qu'il existe une diff&eacute;rence de potentiel variable entre la masse de cette carte et le ch&acirc;ssis (variation de tension de mode commun).<P>Il existe des capacit&eacute;s parasites entre la carte et le ch&acirc;ssis. Si le potentiel entre la carte et le ch&acirc;ssis est variable, ces capacit&eacute;s vont former un chemin de passage pour des courants parasites.<P>&nbsp;<LI><H4><A NAME="P36">EFFETS PRODUITS ET REM&Egrave;DES.</A></H4><P>Il est n&eacute;cessaire ici de parler de ce mode de couplage, car, comme il a &eacute;t&eacute; dit pr&eacute;c&eacute;demment, on peut &ecirc;tre tent&eacute;s de <A HREF="#P21">&quot;&nbsp;flotter&nbsp;&quot;</A> certains &eacute;quipements pour couper des chemins conducteurs parasites et &eacute;viter ainsi les couplages par imp&eacute;dance commune.<P>Il faut savoir que quand on fait cela, on s'expose &agrave; un autre couplage parasite qui est le couplage carte &agrave; ch&acirc;ssis.<P>Ce type de couplage sera &eacute;videmment important si les &eacute;quipements concern&eacute;s sont le si&egrave;ge de courants ou tensions HF.<P>Sur des &eacute;quipements uniquement BF, on pourra flotter des cartes &eacute;lectroniques sans probl&egrave;mes.<P>Si on a des composantes HF, il faudra emp&ecirc;cher le flottement des potentiels en reliant la masse de la carte &agrave; son ch&acirc;ssis. On &eacute;vitera alors les couplages par imp&eacute;dance commune en utilisant des liaisons diff&eacute;rentielles entre les diff&eacute;rentes cartes ou appareils.</OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="P37">COUPLAGE CHAMP &Agrave; FIL.</A></H3><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="P38">D&Eacute;FINITION.</A></H4><P>Tout c&acirc;ble conducteur plong&eacute; dans un champ &eacute;lectrique variable va &ecirc;tre le si&egrave;ge d'un courant de conduction induit par le champ &eacute;lectrique. Ce ph&eacute;nom&egrave;ne sera significatif uniquement en HF.<P>&nbsp;<LI><H4><A NAME="P39">EXEMPLES.</A></H4><P>L'exemple le plus simple, bien que n'ayant rien &agrave; voir avec la mesure, est celui de l'antenne de voiture pour autoradio. Cette antenne n'est qu'un vulgaire bout de ferraille qui va collecter les champs &eacute;lectriques HF &eacute;mis par les stations de radiodiffusion, et transformer ces champs en courant conduit qui va &ecirc;tre achemin&eacute; vers l'entr&eacute;e de l'autoradio pour y &ecirc;tre trait&eacute;.<P>En pratique, l'espace qui nous entoure est enti&egrave;rement baign&eacute; d'ondes radio&eacute;lectriques&nbsp;: &eacute;metteurs radio, TV, talkies walkies, t&eacute;l&eacute;phones portables, ainsi que des parasites d'origine industrielle v&eacute;hicul&eacute;s par les lignes &eacute;lectriques du secteur qui se comportent alors comme des &eacute;metteurs.<P>Il ne faut pas oublier non plus les montages &eacute;lectroniques g&eacute;n&eacute;rant des composantes HF rayonn&eacute;es&nbsp;: ordinateurs, variateurs &agrave; triacs, alimentations &agrave; d&eacute;coupage...<P>Ces champs sont in&eacute;vitables, et il va falloir s'en prot&eacute;ger&nbsp;!<P>&nbsp;<LI><H4><A NAME="P40">REM&Egrave;DES</A></H4><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P41">Des manips propres&nbsp;!</A></FONT></H5><P>Premi&egrave;re r&egrave;gle simple&nbsp;: pas de fils qui tra&icirc;nent&nbsp;! C'est facile &agrave; dire, c'est peu souvent bien r&eacute;alis&eacute;.<P>Sur une manip, on enl&egrave;vera tous les cordons non branch&eacute;s aux deux extr&eacute;mit&eacute;s. Un cordon qui pend, connect&eacute; &agrave; une de ses extr&eacute;mit&eacute;s &agrave; un montage de mesure se comporte de la m&ecirc;me mani&egrave;re qu'une antenne d'autoradio, et va capter tous les champs parasites qui tra&icirc;nent, les transformer en courant et les injecter par conduction dans le montage.<P>D&egrave;s qu'on a des signaux bruit&eacute;s lors d'une mesure, la premi&egrave;re chose &agrave; faire avant d'investiguer plus loin est de rationaliser le c&acirc;blage, mettre les c&acirc;bles les plus courts possibles, et &eacute;viter les fils inutiles qui tra&icirc;nent.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P42">&Eacute;viter les sources de perturbation.</A></FONT></H5><P>Il n'est &eacute;videmment pas question de saboter les &eacute;metteurs de radiodiffusion pour faire une manip tranquille, mais bien d'&eacute;viter, &agrave; l'int&eacute;rieur du labo toutes les sources rayonnantes qu'on ma&icirc;trise et dont on peut se passer.<P>Exemples&nbsp;:<P> - une lampe halog&egrave;ne munie de son variateur &agrave; triac est &agrave; proscrire.<P> - on &eacute;teindra les &eacute;quipements informatiques inutiles &agrave; la manip.<P> - on &eacute;vitera (si possible) de faire dans un m&ecirc;me labo une manip perturbante (&eacute;lectronique de puissance, convertisseur &agrave; d&eacute;coupage de gros calibre) et une manip sensible.<P> - on blindera (si possible) les &eacute;quipements perturbants, et on &eacute;vitera l&agrave; aussi les fils qui pendent (ils forment de beaux &eacute;metteurs). A titre indicatif, les ordinateurs d'aujourd'hui sont blind&eacute;s, et sont donc moins perturbants qu'&agrave; l'&acirc;ge d'or de l'informatique familiale (1985) o&ugrave; ils &eacute;taient simplement habill&eacute;s de plastique non m&eacute;tallis&eacute;. Il &eacute;tait tout bonnement impossible d'&eacute;couter la radio (m&ecirc;me en FM) &agrave; c&ocirc;t&eacute;.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P43">Blindage des c&acirc;bles.</A></FONT></H5><P>Une des principales parades au couplage champ &agrave; fil consiste &agrave; blinder les fils v&eacute;hiculant des signaux sensibles.<P>C'est pour cette raison que les c&acirc;bles de liaison des appareils de mesure sont blind&eacute;s&nbsp;: le fil &quot;&nbsp;chaud&nbsp;&quot; est gain&eacute; par une tresse de cuivre qui l'enveloppe compl&egrave;tement. Cette tresse est reli&eacute;e &agrave; la masse des appareils, et donc, est (presque&nbsp;!) une &eacute;quipotentielle. Cette tresse reli&eacute;e &agrave; un potentiel fixe sert ainsi d'&eacute;cran &eacute;lectrostatique vis &agrave; vis du fil &quot;&nbsp;chaud&nbsp;&quot;, et emp&ecirc;che les champs &eacute;lectriques rayonn&eacute;s de l'atteindre.</UL></OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="P44">COUPLAGE CHAMP &Agrave; BOUCLE.</A></H3><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="P45">D&Eacute;FINITION.</A></H4><P>Tout champ magn&eacute;tique variable cr&eacute;&eacute; une ddp induite dans une boucle conductrice. Il en r&eacute;sulte un courant parasite circulant dans cette boucle.<P>Les boucles sont nombreuses dans les circuits &eacute;lectroniques. On appelle boucle de masse toute boucle conductrice form&eacute;e par les conducteurs aller et retour d'un signal, &agrave; savoir le fil &quot;&nbsp;chaud&nbsp;&quot; et le fil de masse. La figure 12 repr&eacute;sente par exemple un capteur reli&eacute; &agrave; une carte amplificatrice.<P>La boucle sensible comprendra les c&acirc;bles aller et retour allant du capteur &agrave; la carte, ainsi que les pistes et imp&eacute;dances pr&eacute;sentes sur la carte.<P align=center><IMG SRC="PERTU.FIG/PERTU20.GIF"><P align=center>Fig. 12. Boucle de masse perturb&eacute;e.<P>&nbsp;<LI><H4><A NAME="P46">REM&Egrave;DES.</A></H4><P>Les boucles de masse &eacute;tant par d&eacute;finition in&eacute;vitables, il faudra limiter au maximum les perturbations. On pourra entres autres&nbsp;:<P> - r&eacute;duire le plus possible la surface de ces boucles en faisant en sorte que les fils aller et retour d'une boucle soient c&acirc;bl&eacute;s au plus pr&egrave;s l'un de l'autre.<P> - pour des c&acirc;bles non blind&eacute;s, le torsadage est efficace.</OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="P47">D&Eacute;MODULATION DE COURANTS HF.</A></H3><P>Nous allons terminer ce chapitre sur les perturbations par un ph&eacute;nom&egrave;ne fr&eacute;quemment rencontr&eacute; et d&eacute;nomm&eacute; famili&egrave;rement &quot;&nbsp;ronflette&nbsp;&quot; par les professionnels.<P>Ce ph&eacute;nom&egrave;ne est caract&eacute;ris&eacute; par la pr&eacute;sence d'un signal vaguement sinuso&iuml;dal de fr&eacute;quence 50Hz se superposant aux signaux &agrave; mesurer.<P>Le premier r&eacute;flexe consiste donc &agrave; accuser le secteur. C'est vrai, mais indirectement.<P>Il est en fait issu des couplages pr&eacute;c&eacute;demment cit&eacute;s. Mais, nous avons vu que ces couplages &eacute;taient surtout g&ecirc;nants avec des perturbations HF. Hors, le secteur est &agrave; tr&egrave;s basse fr&eacute;quence, et il est hors de question de penser une seconde qu'il puisse traverser de fa&ccedil;on significative les quelques picofarads d'un isolement galvanique par exemple.<P>En r&eacute;alit&eacute;, les champs &eacute;lectromagn&eacute;tiques cr&eacute;&eacute;s par le secteur modulent les champs HF issus de diverses sources.<P>Ces champs HF polluent facilement le montage &agrave; mesurer (m&ecirc;me basse fr&eacute;quence) par tous les modes de couplage vus pr&eacute;c&eacute;demment.<P>Ils vont alors toujours trouver un d&eacute;modulateur parasite complaisant&nbsp;: il suffit d'une diode (ou la jonction d'un transistor) et d'un condensateur pour d&eacute;moduler les signaux HF et en retirer la composante BF (le secteur) qui les modulait.<P>On se retrouve ainsi indirectement avec des tension parasites &agrave; la fr&eacute;quence secteur dans les montages.<P>Un exemple bien connu est le cas des amplificateurs Hifi qui captent la radio sans tuner&nbsp;! C'est &eacute;conomique, mais g&ecirc;nant quand ces signaux se superposent &agrave; un signal musical diff&eacute;rent.<P>Ce dernier exemple montre que m&ecirc;me avec des montages &quot;&nbsp;normalement&nbsp;&quot; BF, on peut avoir des probl&egrave;mes secondaires induits par des composantes HF&nbsp;!<P>M&ecirc;me pour ces montages, on prendra donc des pr&eacute;cautions pour limiter l'influence des courants et tension HF, et restreindre au maximum tous les modes de couplage.</OL></BODY></HTML>