<HTML><HEAD><TITLE>Convertisseurs A/N et N/A</TITLE></HEAD><BODY><CENTER><IMG SRC="../BASE/ICONES/NAV.GIF"></CENTER><P align=center>Si votre &eacute;cran ne se pr&eacute;sente pas comme ceci, <A HREF=CONV.HTM target="_top"> cliquez l&agrave; </A><OL TYPE=I><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="C01">INTRODUCTION.</A></H3><P>L'&eacute;lectronique est divis&eacute;e en deux domaines distincts&nbsp;:<P>- le <STRONG>domaine analogique</STRONG>, o&ugrave; les variables peuvent prendre une infinit&eacute; de valeurs diff&eacute;rentes&nbsp;; les signaux varient contin&ucirc;ment. Tous les signaux issus des capteurs sont analogiques, et traduisent des ph&eacute;nom&egrave;nes physiques qui varient contin&ucirc;ment. <P>- le <STRONG>domaine num&eacute;rique</STRONG>, o&ugrave; les variables prennent uniquement deux &eacute;tats, un &eacute;tat haut et un &eacute;tat bas.<P>Le domaine num&eacute;rique est maintenant pr&eacute;dominant. Il s'est beaucoup d&eacute;velopp&eacute; gr&acirc;ce aux progr&egrave;s faits par les microprocesseurs. Beaucoup de signaux nagu&egrave;re trait&eacute;s de fa&ccedil;on analogiques le sont aujourd'hui par programmation de microprocesseurs.<P>Le gros avantage apport&eacute; par la num&eacute;risation des signaux est la possibilit&eacute; de stockage, de transformation et de restitution des donn&eacute;es sans qu'elles ne soient alt&eacute;r&eacute;es. On peut par exemple faire transiter un signal sonore de qualit&eacute; HI-FI par une ligne t&eacute;l&eacute;phonique sans que la bande passante r&eacute;duite ni le bruit de cette ligne ne soient g&ecirc;nants, ce qui aurait &eacute;t&eacute; impensable avec le signal analogique de d&eacute;part&nbsp;!<P>Le traitement des donn&eacute;es par programmation introduit aussi une souplesse dans la conception de produits &agrave; base d'&eacute;lectronique&nbsp;: un m&ecirc;me circuit &eacute;lectronique &agrave; base de  P pourra traiter des signaux diff&eacute;rents&nbsp;; seul le programme va changer. Cela permet de r&eacute;duire les co&ucirc;ts par standardisation, la m&ecirc;me carte &eacute;tant utilis&eacute;e pour plusieurs fonctions diff&eacute;rentes. L'&eacute;lectronique analogique n&eacute;cessitait au mieux un changement des composants, au pire, la conception d'une nouvelle carte.<P>Mais, &agrave; la base, les signaux ont toujours une nature analogique&nbsp;! Il faut donc les amplifier et &eacute;ventuellement les extraire de signaux parasites (<A HREF="../AINST/COURS.HTM#AI03" target=_blank">tension de mode commun</A> par exemple). Le domaine analogique va donc toujours exister au moins en amont de toute cha&icirc;ne de traitement. Parfois, on a aussi besoin d'un signal analogique en sortie de cette cha&icirc;ne de traitement&nbsp;: il faudra alors reconvertir les donn&eacute;es num&eacute;riques en signal analogique.<P>Le passage d'un type de donn&eacute;e &agrave; l'autre se fera par des convertisseurs, composants "&nbsp;mixtes&nbsp;" qui vont manipuler des tensions analogiques en entr&eacute;e et des signaux logiques en sortie ou vice versa.<P>Il existe deux cat&eacute;gories de convertisseurs&nbsp;:<P>- les <B>Convertisseurs Analogique Num&eacute;rique</B> (CAN, ADC en anglais, pour analog to digital converter), qui vont transformer les tensions analogiques en signaux logiques aptes &agrave; &ecirc;tre trait&eacute;s par microprocesseur (num&eacute;risation des signaux).<P>- les <B>Convertisseurs Num&eacute;rique Analogique</B> (CNA, DAC en anglais, pour digital to analog converter) qui vont convertir les signaux logiques en tension analogique.<P>Plusieurs types de convertisseurs sont disponibles dans chaque cat&eacute;gorie, qui se diff&eacute;rencient par leur pr&eacute;cision, leur vitesse de traitement de l'information, leur prix...<P>Il n'y a pas "&nbsp;le&nbsp;" convertisseur &agrave; tout faire qui soit bon partout&nbsp;: on devra faire un choix en fonction de ses besoins.<UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C02">Exemple de cha&icirc;ne de traitement.</A></FONT></H5><P>Un exemple tr&egrave;s r&eacute;pandu  de conversion et traitement de donn&eacute;es est la cha&icirc;ne de transformation du son, de l'enregistrement de la musique &agrave; sa restitution par les enceintes acoustiques.<P>Le son est capt&eacute; par des micros, dont la tr&egrave;s faible tension de sortie est amplifi&eacute;e. Le signal peut &ecirc;tre num&eacute;ris&eacute; directement &agrave; ce niveau, et sera alors trait&eacute; de fa&ccedil;on enti&egrave;rement num&eacute;rique (mixage...). Il peut aussi &ecirc;tre stock&eacute; de fa&ccedil;on analogique sur bande magn&eacute;tique, mix&eacute;, et ensuite num&eacute;ris&eacute;. L'avantage du traitement num&eacute;rique r&eacute;side dans le fait que les donn&eacute;es sont inalt&eacute;rables, contrairement aux donn&eacute;es analogiques stock&eacute;es sur bande magn&eacute;tique&nbsp;: celle-ci se d&eacute;grade lors des passages r&eacute;p&eacute;t&eacute;s sur les t&ecirc;tes de lecture.<P>Le stockage est maintenant presque toujours num&eacute;rique (compact disc). Le lecteur de CD contient des convertisseurs num&eacute;rique analogique qui vont retransformer les informations num&eacute;riques en signal analogique qui sera amplifi&eacute; avant d'&ecirc;tre envoy&eacute; aux enceintes.</UL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="C03">NOTIONS G&Eacute;N&Eacute;RALES.</A></H3><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="C04">CONVERSION ANALOGIQUE/NUM&Eacute;RIQUE.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C05">Principe de fonctionnement.</A></FONT></H5><P>On a vu dans l'introduction que les signaux num&eacute;riques ne varient pas de fa&ccedil;on continue. En fait, quand on voudra num&eacute;riser un signal analogique (donc continu), il va falloir le discr&eacute;tiser sur deux dimensions&nbsp;: le temps et l'amplitude.<P>Il est impensable de d&eacute;crire un signal avec une infinit&eacute; de valeurs&nbsp;; on va le mesurer &agrave; des instants bien d&eacute;termin&eacute;s&nbsp;: c'est ce qu'on appelle l'<STRONG>&eacute;chantillonnage</STRONG>.<P>Pour ce qui est de l'amplitude, &agrave; un intervalle de tension du signal d'entr&eacute;e on fera correspondre une valeur unique&nbsp;: c'est la <STRONG>quantification </STRONG>(voir figure 1). Cette valeur sera ensuite cod&eacute;e (binaire, binaire sign&eacute;...) et restitu&eacute;e sous forme binaire en sortie du convertisseur pour &ecirc;tre trait&eacute;e par de l'&eacute;lectronique num&eacute;rique.<P align=center><IMG SRC="CONV.FIG/CONV01.GIF"><P align=center>Fig. 1. Fonction de transfert d'un CAN.<P>La figure 1 repr&eacute;sente la fonction de transfert d'un CAN, &agrave; savoir le code num&eacute;rique de sortie en fonction de la tension d'entr&eacute;e. On y voit clairement les plages de tension associ&eacute;es &agrave; un &eacute;tat num&eacute;rique de sortie&nbsp;:<P> - V<SUB>log</SUB> = 0 pour  0 <IMG SRC="../BASE/ICONES/LE.GIF" align=bottom> V<SUB>e</SUB> &lt; 0,1V<P> - V <SUB>log</SUB> = 1 pour  0,1 <IMG SRC="../BASE/ICONES/LE.GIF" align=bottom> V<SUB>e</SUB> &lt; 0,2V<P> - V <SUB>log</SUB> = 6 pour  0,6 <IMG SRC="../BASE/ICONES/LE.GIF" align=bottom> V<SUB>e</SUB> &lt; 0,7V&nbsp;...<P>L'&eacute;tape de quantification de la conversion analogique num&eacute;rique entra&icirc;ne une perte d'information.<P>Un r&eacute;sum&eacute; graphique de tout ceci est exprim&eacute; sur la figure&nbsp;2&nbsp;: on y voit un signal analogique en entr&eacute;e (une sinuso&iuml;de), et les &eacute;chantillons issus de la conversion analogique num&eacute;rique, avec la double discr&eacute;tisation mentionn&eacute;e.<P align=center><IMG SRC="CONV.FIG/CONV02.GIF"><P align=center>Fig. 2. Signal analogique et num&eacute;ris&eacute;<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C06">D&eacute;finitions.</A></FONT></H5><P>Nous allons donner ci-dessous plusieurs d&eacute;finitions th&eacute;oriques&nbsp;; afin de bien comprendre &agrave; quoi elles correspondent dans la r&eacute;alit&eacute;, un exemple de convertisseur 3 bits est <A HREF="#C11">expos&eacute; plus loin</A>. Le lecteur est invit&eacute; &agrave; consulter les deux paragraphes en parall&egrave;le.<P>Toutes ces d&eacute;finitions sont donn&eacute;es pour des convertisseurs parfaits&nbsp;; en pratique, on est loin du compte, car ces composants int&egrave;grent des comparateurs diff&eacute;rentiels, amplificateurs op&eacute;rationnels et autres r&eacute;seaux de r&eacute;sistances qui sont imparfaits. Nous allons lister <A HREF="#C21">ensuite</A> les principaux d&eacute;fauts des convertisseurs.<UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C07">Plage de conversion.</A></FONT></H5><P>Le convertisseur d&eacute;livrera en sortie un nombre fini de codes num&eacute;riques, correspondant &agrave; une gamme de tension analogique d'entr&eacute;e born&eacute;e&nbsp;: c'est la <STRONG>plage de conversion</STRONG> (ou tension de pleine &eacute;chelle) du convertisseur. Cette plage de conversion sera couramment de 0-5V, 0-10V, ou encore &#177;5V ou &#177;10V. Il existe aussi d'autres plages de conversion moins usit&eacute;es.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C08">R&eacute;solution.</A></FONT></H5><P>Le signal num&eacute;ris&eacute; sera d'autant plus riche en information que l'intervalle de tension qui sera cod&eacute; par le m&ecirc;me nombre binaire sera petit, et ceci &agrave; plage de conversion donn&eacute;e.<P>La <STRONG>r&eacute;solution</STRONG> du CAN sera l'intervalle de tension d'entr&eacute;e &agrave; laquelle correspondra un m&ecirc;me nombre binaire.<P>En th&eacute;orie, cet intervalle de tension est le m&ecirc;me pour tous les codes binaires&nbsp;; en pratique, &ccedil;a ne sera pas toujours le cas (voir les <A HREF="#C24">erreurs de conversion</A>). La r&eacute;solution correspondra &agrave; la valeur th&eacute;orique.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C09">Dynamique.</A></FONT></H5><P>La <STRONG>dynamique</STRONG> d'un signal est le rapport entre la tension maxi et la tension mini que pourra prendre ce signal.<P>Pour un CAN, ce sera le nombre binaire le plus &eacute;lev&eacute; divis&eacute; par le plus faible qui est 1 (et pas 0 qui correspond &agrave; un signal nul), donc, le nombre de codes binaires diff&eacute;rents que peut fournir le convertisseur moins un (le z&eacute;ro&nbsp;!).<P>Si on prend l'exemple d'un convertisseur 8 bits, la dynamique vaut en toute rigueur 2<SUP>8</SUP> - 1 = 255.<P>En pratique, on arrondira ce nombre &agrave; une puissance de 2, qui sera le nombre de bits du convertisseur. Notre convertisseur aura donc une dynamique de 256, qu'on exprimera plut&ocirc;t sous la forme "&nbsp;8 bits&nbsp;", ou encore 48db&nbsp;=&nbsp;20log(256).<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C10">Mise en relation.</A></FONT></H5><P>Il est possible de relier la dynamique, la r&eacute;solution et la plage de conversion d'un convertisseur.<P>La r&eacute;solution correspond &agrave; la variation d'une unit&eacute; du code binaire&nbsp;; cette unit&eacute; est &eacute;gale &agrave; la variation du bit de poids le plus faible (LSB&nbsp;= least significant bit en Anglais). Si on d&eacute;signe par <IMG SRC="../BASE/ICONES/DELTA.GIF" align=bottom>V<SUB>MAX</SUB> la plage de conversion et N le nombre de bits du convertisseur, on a la relation&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV03.GIF"><P>L'exemple suivant clarifiera cette relation.</UL><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C11">Exemple&nbsp;: CAN 3 bits</A></FONT></H5><P align=center><IMG SRC="CONV.FIG/CONV04.GIF"><P align=center>Fig. 3. Fonction de transfert d'un CAN 3 bits<P>Sur la figure 3, on a repr&eacute;sent&eacute; la fonction de transfert d'un CAN &agrave; 3 bits ayant une plage de conversion de 8V. Il y a 8 &eacute;tats logiques, la plage de conversion est donc partag&eacute;e en 8 portions &eacute;gales correspondant chacune &agrave; un &eacute;tat logique de sortie.<P>On remarquera que la derni&egrave;re transition du CAN se fait pour une tension d'entr&eacute;e de 7V, correspondant au dernier &eacute;tat logique de sortie (&eacute;gal &agrave; 7).<P>Pass&eacute;e cette valeur de 7V, le convertisseur ne changera donc plus d'&eacute;tat. Toutefois, on consid&egrave;re que la plage de conversion s'&eacute;tend jusqu'&agrave; 8V, la derni&egrave;re portion, de 7 &agrave; 8V correspondant &agrave; l'&eacute;tat logique "&nbsp;7&nbsp;".<P>Dans ces conditions, la plage de conversion est de 8V, divis&eacute;e en 2<SUP>3</SUP>&nbsp;=&nbsp;8 portions correspondant chacune &agrave; un LSB valant 8V/8=1V. On retrouve le r&eacute;sultat de l'&eacute;quation <A HREF="#C10">[1]</A>.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C12">Erreur de quantification. Am&eacute;lioration.</A></FONT></H5><P>On a d&eacute;j&agrave; dit que la double quantification, dans le temps et en amplitude consistait en une perte d'information du signal. Ceci nous conduit &agrave; la notion d'erreur de quantification, qui est inh&eacute;rente &agrave; la conversion analogique/num&eacute;rique (et inverse), et sera pr&eacute;sente m&ecirc;me si les convertisseurs sont consid&eacute;r&eacute;s comme parfaits. Cette erreur syst&eacute;matique s'ajoute donc aux <A HREF="#C21">erreurs d&eacute;crites plus loin</A>.<P>Si on num&eacute;rise une rampe de tension, l'erreur entre la tension d'entr&eacute;e et la tension de sortie "&nbsp;reconstitu&eacute;e&nbsp;" (reconvertie en analogique par passage dans un CNA) aura la forme suivante&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV05.GIF"><P align=center>Fig. 4. Erreur de quantification d'un CAN.<P> L'erreur est toujours n&eacute;gative (valeur par d&eacute;faut), et oscille entre 0 et -1 LSB (0 &agrave; -1V ici).<P>Il serait souhaitable d'avoir plut&ocirc;t une erreur centr&eacute;e autour de 0, de mani&egrave;re &agrave; quantifier tant&ocirc;t par exc&egrave;s, tant&ocirc;t par d&eacute;faut&nbsp;; en effet, en quantifiant syst&eacute;matiquement par d&eacute;faut, on introduit un offset dans le signal num&eacute;ris&eacute;.<P>Pour pallier cet inconv&eacute;nient, on introduit un d&eacute;calage au niveau du premier LSB du convertisseur, comme indiqu&eacute; sur la figure 5&nbsp;: la premi&egrave;re transition n'a pas lieu pour 1 LSB, mais pour 1/2 LSB seulement, ce qui fait que jusqu'&agrave; une valeur d'entr&eacute;e inf&eacute;rieure &agrave; 1/2 LSB, on quantifie par d&eacute;faut, et entre 1/2 et 1 LSB, on quantifie par exc&egrave;s.<P align=center><IMG SRC="CONV.FIG/CONV06.GIF"><P align=center> Fig. 5. Fonction de transfert d'un CAN 3 bits corrig&eacute;.<P>L'erreur obtenue devient celle de la figure 6&nbsp;: elle est sym&eacute;trique par rapport &agrave; 0 et &eacute;gale &agrave; &#177;1/2 LSB.<P align=center><IMG SRC="CONV.FIG/CONV07.GIF"><P align=center> Fig. 6. Erreur de quantification sym&eacute;trique<P>Il y a juste une exception&nbsp;: le 1/2 LSB tronqu&eacute; au d&eacute;but va se retrouver en bout d'&eacute;chelle (voir figure 5)&nbsp;: le dernier &eacute;tat num&eacute;rique correspondra &agrave; une plage d'entr&eacute;e analogique valant 1 1/2 LSB. L'erreur de quantification sera plus grande sur cette plage, ce qui n'est d'ailleurs pas tr&egrave;s grave&nbsp;!<P>En pratique, la majorit&eacute; des CAN ont une fonction de transfert d&eacute;cal&eacute;e pour assurer une erreur de quantification sym&eacute;trique. Il faudra toutefois s'en assurer en lisant la sp&eacute;cification du constructeur.<P>Ce d&eacute;tail pourra &ecirc;tre important si on fait de la mesure pr&eacute;cise avec une carte d'acquisition de donn&eacute;e (comprenant un CAN). Pour r&eacute;gler le gain et l'offset de la cha&icirc;ne de conversion, il faudra observer la premi&egrave;re et la derni&egrave;re transition, et la calibration sera diff&eacute;rente si le convertisseur est d&eacute;cal&eacute; ou pas&nbsp;; un biais d'1/2 LSB pourra fausser les mesures si on se trompe&nbsp;!</OL><P>&nbsp;<LI><H4><A NAME="C13">CONVERSION NUM&Eacute;RIQUE/ANALOGIQUE.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C14">Principe de fonctionnement.</A></FONT></H5><P>Si on fait l'op&eacute;ration inverse (conversion num&eacute;rique analogique), &agrave; chaque valeur num&eacute;rique, on fera correspondre une valeur analogique (et une seule)&nbsp;; la tension analogique de sortie variera par "&nbsp;bonds&nbsp;", et non plus contin&ucirc;ment comme dans le signal d'origine. La fonction de transfert sera la m&ecirc;me que celle de la figure 1 mais invers&eacute;e. La tension de sortie aura une forme d'escalier. En pratique, on va filtrer cette tension pour lisser ces discontinuit&eacute;s et essayer de se rapprocher au mieux du signal d'origine (Figure 7).<P align=center><IMG SRC="CONV.FIG/CONV08.GIF"><P align=center>Fig. 7. Conversion num&eacute;rique analogique.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C15">D&eacute;finitions.</A></FONT></H5><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C16">R&eacute;solution.</A></FONT></H5><P>La <STRONG>r&eacute;solution</STRONG> du CNA sera la variation de tension de sortie correspondant &agrave; la variation d'une unit&eacute; du nombre binaire en entr&eacute;e. La d&eacute;finition est &eacute;quivalente &agrave; celle du CAN.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C17">Plage de conversion.</A></FONT></H5><P>Il y a ici une petite diff&eacute;rence avec le CAN (voir <A HREF="#C20">figure 8</A>)&nbsp;: la plage de conversion num&eacute;rique va de 0 &agrave; 2<SUP>N</SUP>-1, N &eacute;tant le nombre de bits du convertisseur, et &agrave; chaque valeur num&eacute;rique correspond une valeur analogique de sortie et une seule.  Par rapport &agrave; celle du CAN, la plage de conversion s'arr&ecirc;tera donc un LSB plus t&ocirc;t (sur l'&eacute;chelle analogique du CAN, ceci correspond  &agrave; la derni&egrave;re transition num&eacute;rique).<P>Nous sommes ramen&eacute;s ici au vieux probl&egrave;me des poteaux et des intervalles&nbsp;!<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C18">Dynamique.</A></FONT></H5><P>La d&eacute;finition est &eacute;quivalente &agrave; celle du CAN.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C19">Mise en relation.</A></FONT></H5><P>Vu ce qui a &eacute;t&eacute; dit sur la plage de conversion, la relation entre le pas de quantification (1 LSB), la plage de conversion <IMG SRC="../BASE/ICONES/DELTA.GIF" align=bottom>V<SUB>MAX</SUB> , et le nombre de bits du convertisseur sera l&eacute;g&egrave;rement diff&eacute;rente de l'&eacute;quation <A HREF="#C10">[1]</A>. La <A HREF="#C20">figure 8</A> du paragraphe suivant va &eacute;clairer cette &eacute;quation&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV09.GIF"><P>En pratique, pour un nombre de bits sup&eacute;rieur &agrave; 8, l'&eacute;cart entre les deux formules reste tr&egrave;s faible&nbsp;!<P>Il n'emp&ecirc;che que dans le cas de mesures pr&eacute;cises, ce genre de d&eacute;tail a son importance pour expliquer un biais inattendu.</UL><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C20">Exemple&nbsp;: CNA 3 bits.</A></FONT></H5><P align=center><IMG SRC="CONV.FIG/CONV10.GIF"><P align=center> Fig. 8. Fonction de transfert d'un CNA 3 bits.<P>La figure 8 montre la fonction de transfert d'un CNA 3 bits ayant une r&eacute;solution de 1V, comme l'exemple de <A HREF="#C11">CAN donn&eacute; pr&eacute;c&eacute;demment</A>.<P>On voit clairement ici ce qui a &eacute;t&eacute; dit pour la plage de conversion&nbsp;: la plage s'&eacute;tend de 0 &agrave; 7V, et non pas 8V comme pour le CAN, car le dernier &eacute;tat num&eacute;rique est "&nbsp;7&nbsp;".</OL><P>&nbsp;<LI><H4><A NAME="C21">ERREURS DE CONVERSION.</A></H4><P>Les erreurs d&eacute;crites dans les paragraphes 1 &agrave; 3 sont valables pour les CAN comme pour les CNA. Les illustrations sont faites pour ces derniers, mais sont facilement transposables.<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C22">Erreur de gain.</A></FONT></H5><P>La tension de pleine &eacute;chelle est toujours l&eacute;g&egrave;rement diff&eacute;rente de ce qui est pr&eacute;vu en th&eacute;orie. L'&eacute;cart entre les valeurs th&eacute;orique et pratique est l'<STRONG>erreur de gain</STRONG> (figure 9).<P>Pratiquement, le fabricant de convertisseurs Analog Devices d&eacute;finit cette erreur ainsi&nbsp;: c'est l'&eacute;cart entre la valeur th&eacute;orique et la valeur r&eacute;elle mesur&eacute;e sur la derni&egrave;re transition du convertisseur et exprim&eacute; en LSB. Cette mesure suppose que l'ajustage du z&eacute;ro soit parfait.<P align=center><IMG SRC="CONV.FIG/CONV11.GIF"><P align=center>Fig. 9. Erreur de gain.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C23">Erreur d'offset.</A></FONT></H5><P>De m&ecirc;me, le code binaire 0 ne correspond pas forc&eacute;ment &agrave; une tension rigoureusement nulle en sortie. Cette tension est la <STRONG>tension de d&eacute;calage, ou d'offset</STRONG>.<P align=center><IMG SRC="CONV.FIG/CONV12.GIF"><P align=center> Fig. 10. Erreur d'offset.<P>En pratique, Analog Devices d&eacute;finit cette erreur comme &eacute;tant l'&eacute;cart entre la valeur th&eacute;orique et la valeur r&eacute;elle mesur&eacute;e sur la premi&egrave;re transition du convertisseur et exprim&eacute; en LSB. En pratique, pour ajuster un convertisseur, on r&eacute;glera d'abord l'offset, et ensuite le gain.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C24">Erreurs de lin&eacute;arit&eacute;.</A></FONT></H5><P>L'erreur de lin&eacute;arit&eacute; est due au fait que la r&eacute;solution des convertisseurs n'est pas constante.<P>On distingue deux formes de non lin&eacute;arit&eacute;&nbsp;:<P>- la non lin&eacute;arit&eacute; int&eacute;grale<P>- la non lin&eacute;arit&eacute; diff&eacute;rentielle<P>la <STRONG>non lin&eacute;arit&eacute; int&eacute;grale</STRONG>, exprim&eacute;e en LSB, est la diff&eacute;rence maximum constat&eacute;e sur toute la plage de conversion entre les valeurs th&eacute;oriques et les valeurs mesur&eacute;es.<P>Cette mesure n'a &eacute;videmment de sens que si le z&eacute;ro et le gain sont correctement r&eacute;gl&eacute;s.<P>La fonction de transfert est repr&eacute;sent&eacute;e figure 11.<P align=center><IMG SRC="CONV.FIG/CONV13.GIF"><P align=center> Fig. 11. Erreur de lin&eacute;arit&eacute; int&eacute;grale.<P>La <STRONG>non lin&eacute;arit&eacute; diff&eacute;rentielle</STRONG> concerne la diff&eacute;rence de tension obtenue lors du passage au code num&eacute;rique imm&eacute;diatement sup&eacute;rieur ou inf&eacute;rieur&nbsp;; th&eacute;oriquement, cette valeur vaut 1 LSB. La non lin&eacute;arit&eacute; diff&eacute;rentielle sera la diff&eacute;rence entre l'&eacute;cart mesur&eacute; et le LSB th&eacute;orique. L'illustration est donn&eacute;e en figure 12.<P align=center><IMG SRC="CONV.FIG/CONV14.GIF"><P align=center> Fig. 12. Erreur de lin&eacute;arit&eacute; diff&eacute;rentielle.<P>La valeur donn&eacute;e dans les sp&eacute;cifications des constructeurs est la plus grande valeur constat&eacute;e sur toute la plage de conversion.<P>La non lin&eacute;arit&eacute; diff&eacute;rentielle est plus g&ecirc;nante que la non lin&eacute;arit&eacute; int&eacute;grale, surtout dans le cas de mesures comparatives effectu&eacute;es sur une faible partie de la plage de conversion.<P>En g&eacute;n&eacute;ral, et pour des <A HREF="#C34">causes technologiques bien identifi&eacute;es</A>, le maximum de non lin&eacute;arit&eacute; diff&eacute;rentielle se trouve &agrave; la moiti&eacute; de la pleine &eacute;chelle (passage du MSB de 0 &agrave; 1), et ensuite &agrave; moindre degr&eacute; &agrave; 1/4 et 3/4 de la pleine &eacute;chelle.<P>On sera donc vigilant quand on fera des mesures comparatives dans ces zones l&agrave;.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C25">Monotonicit&eacute; (CNA).</A></FONT></H5><P>Ce ph&eacute;nom&egrave;ne est le m&ecirc;me que le pr&eacute;c&eacute;dent, mais pouss&eacute; &agrave; l'extr&ecirc;me&nbsp;: il peut arriver que la pente de la courbe de conversion change de signe. Pour une tension analogique de sortie, il ne sera pas possible d'attribuer un nombre binaire correspondant&nbsp;: il y aura plusieurs solutions possibles.<P align=center><IMG SRC="CONV.FIG/CONV15.GIF"><P align=center>Fig. 13. Monotonicit&eacute;.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C26">Codes manquants (CAN).</A></FONT></H5><P>Cette erreur pour le CAN est le pendant de la monotonicit&eacute; pour le CNA.<P align=center><IMG SRC="CONV.FIG/CONV16.GIF"> <P align=center>Fig. 14. Codes manquants<P>Lors de la conversion, la courbe donn&eacute;e binaire = f(tension analogique) n'&eacute;tant pas une fonction (plusieurs codes binaires possibles pour une m&ecirc;me tension d'entr&eacute;e), le convertisseur choisira la plus faible valeur binaire parmi celles possibles. Les autres ne seront jamais utilis&eacute;es, et formeront des "&nbsp;trous&nbsp;" dans le code binaire&nbsp;: ce sont les codes manquants.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C27">Temps d'&eacute;tablissement (CNA).</A></FONT></H5><P>Les &eacute;tages de sortie des CNA sont g&eacute;n&eacute;ralement des amplificateurs op&eacute;rationnels. On a vu que la tension de sortie va varier "&nbsp;par bonds&nbsp;" quand le code binaire d'entr&eacute;e va changer. De ce fait, l'ampli de sortie va fonctionner en mode impulsionnel. La stabilisation de la tension de sortie n'est pas imm&eacute;diate&nbsp;: elle peut &ecirc;tre du type <A HREF="../AOP/COURS.HTM#AO65" target=_blank>premier ordre ou oscillatoire amortie (deuxi&egrave;me ordre et plus</A>).<P>On appellera <STRONG>temps d'&eacute;tablissement</STRONG> (settling time en Anglais) le temps mis par la sortie pour atteindre un certain pourcentage de la tension finale stabilis&eacute;e lorsque l'entr&eacute;e va varier.<P align=center><IMG SRC="CONV.FIG/CONV17.GIF"><P align=center>Fig. 15. Temps d'&eacute;tablissement.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C28">Temps de conversion (CAN).</A></FONT></H5><P>Lorsqu'on num&eacute;rise un signal, on envoie au CAN un ordre de conversion, et on r&eacute;cup&egrave;re la valeur binaire en sortie au terme d'un d&eacute;lai appel&eacute; <STRONG>temps de conversion</STRONG>.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C29">Pr&eacute;cision du convertisseur.</A></FONT></H5><P>Pour obtenir la pr&eacute;cision globale du convertisseur, on cumulera toutes les erreurs pr&eacute;c&eacute;demment cit&eacute;es.<P>En g&eacute;n&eacute;ral, ces erreurs sont donn&eacute;es soit en % de la pleine &eacute;chelle (% FS pour full scale), soit en fraction de quantum (&#177;&nbsp;1/2 LSB par exemple).</OL></OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="C30">CONVERSION NUM&Eacute;RIQUE / ANALOGIQUE.</A></H3><P>Il existe principalement deux types de convertisseurs num&eacute;rique / analogique sur le march&eacute;&nbsp;: les convertisseurs &agrave; r&eacute;sistances pond&eacute;r&eacute;es, et les convertisseurs &agrave; r&eacute;seau R/2R. Ces derniers sont pr&eacute;dominants.<P>Il existe aussi des convertisseurs &agrave; r&eacute;seaux de condensateurs fonctionnant sur le m&ecirc;me principe de base que les r&eacute;seaux &agrave; r&eacute;sistances.<P>Nous n'exposerons pas ici les <A HREF="http://ourworld.compuserve.com/homepages/pierrecorrieu/plc_ag_sig.html" target=_blank>convertisseurs </A><IMG SRC="../BASE/ICONES/SIGMA1.GIF" align=bottom>/<IMG SRC="../BASE/ICONES/DELTA.GIF" align=bottom>, qui traitent non plus le code binaire absolu, mais la diff&eacute;rence avec l'&eacute;chantillon pr&eacute;c&eacute;dent. Ces convertisseurs sont tr&egrave;s r&eacute;pandus dans l'audio-num&eacute;rique (lecteurs de disques compacts), car ils sont pr&eacute;cis et meilleur march&eacute; que les convertisseurs traditionnels. Pour l'instant, ils sont peu utilis&eacute;s en mesure.<OL TYPE=A><P>&nbsp;<LI><H4><A NAME="C31">ARCHITECTURE G&Eacute;N&Eacute;RIQUE.</A></H4><P>Quel que soit le type de convertisseur &eacute;tudi&eacute;, on retrouvera toujours peu ou prou la m&ecirc;me structure, constitu&eacute;e des m&ecirc;me &eacute;l&eacute;ments de base&nbsp;; seule la r&eacute;alisation technologique  des blocs de base diff&eacute;rera d'un convertisseur &agrave; l'autre et en fera sa sp&eacute;cificit&eacute;.<P>Il est donc int&eacute;ressant d'&eacute;tudier l'architecture g&eacute;n&eacute;rique mettant en &eacute;vidence les points communs &agrave; tous les convertisseurs.<P align=center><IMG SRC="CONV.FIG/CONV18.GIF"><P align=center> Fig. 16. Architecture des CNA.<P>Sur la figure 16, on distingue 5 blocs&nbsp;:<P>- un buffer num&eacute;rique d'entr&eacute;e&nbsp;: celui-ci est charg&eacute; de garder en m&eacute;moire la donn&eacute;e num&eacute;rique pendant le temps de conversion&nbsp;; il sert aussi d'interface entre les parties num&eacute;rique et analogique du convertisseur.<P>- une r&eacute;f&eacute;rence de tension&nbsp;: son importance est capitale pour la pr&eacute;cision de l'ensemble&nbsp;; c'est elle qui donne le signal de r&eacute;f&eacute;rence servant &agrave; la d&eacute;termination des tensions de sortie.<P>- l'arbre de commutation (switching tree en anglais)&nbsp;: il est command&eacute; par le buffer d'entr&eacute;e et va d&eacute;terminer les r&eacute;sistances qui seront aliment&eacute;es par la r&eacute;f&eacute;rence de tension.<P>- le r&eacute;seau de r&eacute;sistances&nbsp;: c'est un ensemble de r&eacute;sistances, qui, aliment&eacute;es par la r&eacute;f&eacute;rence de tension via l'arbre de commutation vont g&eacute;n&eacute;rer des courants tr&egrave;s pr&eacute;cis fonction du code binaire d'entr&eacute;e.<P>- le convertisseur courant/tension est un ampli servant &agrave; transformer les courants g&eacute;n&eacute;r&eacute;s par le r&eacute;seau de r&eacute;sistances en tension de sortie. Il est optionnel, certains CNA ne l'incluent pas, d'autres l'incluent, mais laissent le choix de l'utiliser ou non.<P>On retrouvera donc toujours ces &eacute;l&eacute;ments de base, la distinction entre les convertisseurs se faisant g&eacute;n&eacute;ralement dans le r&eacute;seau de r&eacute;sistances (et par voie de cons&eacute;quences dans l'arbre de commutation).<P>&nbsp;<LI><H4><A NAME="C32">CNA &Agrave; R&Eacute;SISTANCES POND&Eacute;R&Eacute;ES.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C33">Principe.</A></FONT></H5><P>Le principe de fonctionnement de ce montage est extr&ecirc;mement simple&nbsp;: il est bas&eacute; sur un amplificateur op&eacute;rationnel mont&eacute; en sommateur inverseur.<P align=center><IMG SRC="CONV.FIG/CONV19.GIF"><P align=center> Fig. 17. Sch&eacute;ma de principe d'un CNA &agrave; r&eacute;sistances pond&eacute;r&eacute;es (4 bits).<P>Les principaux constituants sont&nbsp;:<P>- un amplificateur op&eacute;rationnel.<P>- une r&eacute;f&eacute;rence de tension qui va d&eacute;finir la pleine &eacute;chelle du convertisseur.<P>- une s&eacute;rie de r&eacute;sistances dans un rapport des puissances successives de 2 (1, 2, 4, 8, 16...).<P>- une s&eacute;rie de registres num&eacute;riques contenant le code binaire d'entr&eacute;e.<P>- des commutateurs analogiques (interrupteurs command&eacute;s &eacute;lectriquement par les signaux logiques) reliant les r&eacute;sistances &agrave; la r&eacute;f&eacute;rence de tension.<P>Le sch&eacute;ma de la figure 17 montre un CNA 4 bits. Par extension, on peut construire un CNA ayant un nombre de bits quelconque en augmentant les entr&eacute;es logiques et en y affectant des r&eacute;sistances de valeur convenable (toujours dans le rapport des puissances de deux).<P>On remarque que le LSB est affect&eacute; &agrave; la r&eacute;sistance de plus grande valeur, et le MSB &agrave; celle de plus faible valeur.<P>Nous appellerons a<SUB>0</SUB> le MSB, a<SUB>1</SUB> le bit suivant, ..., et a<SUB>N-1</SUB> le LSB d'un convertisseur &agrave; N bits.<P>Si on applique le r&eacute;sultat de l'ampli sommateur inverseur &agrave; ce montage, on trouve&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV20.GIF"><P>soit&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV21.GIF"><P>Dans le cas de notre convertisseur 4 bits, la solution est&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV22.GIF"><P>Le MSB est affect&eacute; du coefficient le plus fort, et les bits successifs voient leur coefficient divis&eacute; par deux par rapport au bit pr&eacute;c&eacute;dent.<P>On peut calculer la r&eacute;solution (LSB) de ce convertisseur&nbsp;: c'est la variation de la tension de sortie lorsque l'entr&eacute;e num&eacute;rique varie d'une unit&eacute;, soit&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV23.GIF"><P>Dans le cas g&eacute;n&eacute;ral d'un convertisseur &agrave; N bits, on aurait&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV24.GIF"><P>L'&eacute;quation <A HREF="#C19">[2]</A> va nous permettre de calculer la plage de conversion. Si on injecte le r&eacute;sultat de [7] dans l'&eacute;quation [2], on obtient&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV25.GIF"><P>o&ugrave; <IMG SRC="../BASE/ICONES/DELTA.GIF" align=bottom>V<SUB>MAX</SUB> repr&eacute;sente la plage de conversion, ou pleine &eacute;chelle du convertisseur. Pour notre convertisseur 4 bits, cette pleine &eacute;chelle vaut donc 15/8<SUP>&egrave;me</SUP> de E<SUB>ref</SUB>. Ceci est d&ucirc; au fait que le convertisseur de N bits comporte 2<SUP>N</SUP> &eacute;tats diff&eacute;rents, dont <STRONG>z&eacute;ro</STRONG>, ce qui fait que le dernier &eacute;tat est &eacute;gal &agrave; 2<SUP>N</SUP>-1, et pas 2<SUP>N</SUP>.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C34">Pr&eacute;cision.</A></FONT></H5><P>Le sch&eacute;ma de ce convertisseur nous permet de mieux comprendre les erreurs cit&eacute;es au paragraphe pr&eacute;c&eacute;dent&nbsp;:<P>- L'erreur de gain sera directement proportionnelle &agrave; l'impr&eacute;cision de la r&eacute;f&eacute;rence de tension et de la r&eacute;sistance de contre-r&eacute;action.<P>- L'erreur d'offset sera due &agrave; l'offset de l'amplificateur.<P>- L'erreur de lin&eacute;arit&eacute; et la monotonicit&eacute; seront dues au mauvais appairage des r&eacute;sistances dans le rapport des puissances de 2.<P>- Le temps d'&eacute;tablissement sera donn&eacute; par la r&eacute;ponse de l'amplificateur &agrave; un &eacute;chelon de tension.<P>Pour revenir aux erreurs de lin&eacute;arit&eacute;, il faut noter que la pr&eacute;cision relative sur chaque r&eacute;sistance aura un impact sur le r&eacute;sultat global qui va doubler tous les bits en allant du LSB vers le MSB.<P>En effet, une erreur de 10% de la r&eacute;sistance du LSB ne va fausser le r&eacute;sultat que de 1,1 fois le LSB.<P>Par contre, 10% d'erreur sur la r&eacute;sistance du MSB va induire une erreur &eacute;gale &agrave; 1,1 fois le MSB, soit 2<SUP>(N-1)</SUP> fois plus que celle faite sur le LSB dans les m&ecirc;mes conditions... Cette erreur peut facilement &ecirc;tre sup&eacute;rieure au LSB et entra&icirc;ner des non monotonicit&eacute;s dans la r&eacute;ponse (voir <A HREF="ANNEXE/PREC_CNA.GIF" target=_blank>annexe</A>).<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C35">Avantages / inconv&eacute;nients.</A></FONT></H5><P>L'avantage d'un tel montage est la simplicit&eacute;. C'est un bon outil p&eacute;dagogique.<P>Malheureusement, la r&eacute;alisation pratique est difficile du fait de la dynamique des r&eacute;sistances utilis&eacute;es (2<SUP>N</SUP> pour un convertisseur &agrave; N bits), et, on l'a vu, une tol&eacute;rance n&eacute;cessaire sur les r&eacute;sistance divis&eacute;e par 2 &agrave; chaque bit suppl&eacute;mentaire. Pour un convertisseur &agrave; 8 bits, la pr&eacute;cision de la r&eacute;sistance du MSB devra &ecirc;tre meilleure que 1% pour &ecirc;tre en limite de non monotonicit&eacute;, et en pratique, on prendra une r&eacute;sistance &agrave; 2&#137; au minimum.<P>Le principal probl&egrave;me provient de l'int&eacute;gration de ces r&eacute;sistances&nbsp;: dans les circuits int&eacute;gr&eacute;s, on sait tenir une telle pr&eacute;cision, mais la proportionnalit&eacute; des r&eacute;sistances est obtenues en leur donnant des dimensions proportionnelles &agrave; leur valeur. La dynamique &eacute;lev&eacute;e requise ici est vite prohibitive.<P>Ces d&eacute;fauts font que ce convertisseur n'est pas viable &eacute;conomiquement, surtout si on le compare au CNA &agrave; r&eacute;seau R/2R, plus facile &agrave; int&eacute;grer.</OL><P>&nbsp;<LI><H4><A NAME="C36">CNA &Agrave; R&Eacute;SEAU R/2R.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C37">Principe</A></FONT></H5><P>Ce type de convertisseur prend en compte les d&eacute;fauts du pr&eacute;c&eacute;dent&nbsp;: il est b&acirc;ti autour d'un r&eacute;seau de r&eacute;sistances compos&eacute; de seulement deux valeurs, R et 2R. Il n'y a donc plus le d&eacute;faut inh&eacute;rent &agrave; la grande dynamique de valeurs des r&eacute;sistances.<P align=center><IMG SRC="CONV.FIG/CONV26.GIF"><P align=center> Fig. 18. Sch&eacute;ma de principe d'un CNA &agrave; r&eacute;seau R/2R (4 bits).<P>Les composants sont sensiblement les m&ecirc;mes que pour le CNA &agrave; r&eacute;sistances pond&eacute;r&eacute;es&nbsp;:<P>- un amplificateur op&eacute;rationnel.<P>- une r&eacute;f&eacute;rence de tension qui va d&eacute;finir la pleine &eacute;chelle du convertisseur.<P>- un r&eacute;seau de r&eacute;sistances R/2R.<P>- une s&eacute;rie de registres num&eacute;riques contenant le code binaire d'entr&eacute;e.<P>- des commutateurs analogiques (interrupteurs command&eacute;s &eacute;lectriquement par les signaux logiques) reliant les r&eacute;sistances soit &agrave; la masse, soit &agrave; l'entr&eacute;e - de l'ampli.<P>L'amplificateur va fonctionner ici en convertisseur courant/tension&nbsp;: en fonction du positionnement des commutateurs, le courant total I<SUB>T</SUB> sera plus ou moins &eacute;lev&eacute;, et sera transform&eacute; en tension par l'ampli et la r&eacute;sistance de contre-r&eacute;action. Certains CNA offrent d'ailleurs simplement une sortie en courant, et c'est &agrave; l'utilisateur de l'utiliser tel quel, ou de le convertir en tension.<P>Avant d'attaquer la mise en &eacute;quation, nous allons faire un constat, et partant de l&agrave;, &eacute;tudier certaines propri&eacute;t&eacute;s du r&eacute;seau R/2R.<P>L'entr&eacute;e + de l'ampli est &agrave; la masse&nbsp;; si on consid&egrave;re que cet ampli est parfait, l'entr&eacute;e - est au m&ecirc;me potentiel, soit 0 (<A HREF="../AOP/COURS.HTM#AO11" target=_blank>masse virtuelle</A>). La position du commutateur n'influe donc nullement sur le fonctionnement du r&eacute;seau&nbsp;: les courants I<SUB>0</SUB> &agrave; I<SUB>3</SUB> sont dirig&eacute;s soit vers le convertisseur courant/tension, soit d&eacute;riv&eacute;s &agrave; la masse, mais le potentiel &agrave; la borne commune des commutateurs reste le m&ecirc;me, &agrave; savoir 0.<P>Pour simplifier le raisonnement, nous allons donc &eacute;tudier le r&eacute;seau suivant&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV27.GIF"><P align=center> Fig. 19. R&eacute;seau R/2R.<P>Les courants I<SUB>3</SUB> et I<SUB>D</SUB> sont &eacute;gaux (diviseur de courant avec deux r&eacute;sistances &eacute;gales).<P>On a donc&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV28.GIF"><P>Les branches o&ugrave; circulent I<SUB>3</SUB> et I<SUB>D</SUB> sont en fait deux r&eacute;sistances &eacute;gales (2R) en parall&egrave;le, soit l'&eacute;quivalent d'une r&eacute;sistance moiti&eacute;, donc R. Cette r&eacute;sistance &eacute;quivalente est en s&eacute;rie avec celle o&ugrave; circule I<SUB>C</SUB>. Le courant I<SUB>C</SUB> circule donc dans une r&eacute;sistance &eacute;quivalent &agrave; 2R. Le circuit devient&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV29.GIF"><P align=center> Fig. 20. R&eacute;seau r&eacute;duit &eacute;quivalent.<P>On retombe strictement sur le m&ecirc;me type de r&eacute;seau que pr&eacute;c&eacute;demment. On en d&eacute;duit facilement&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV30.GIF"><P>L'&eacute;tape finale du raisonnement donne le r&eacute;seau suivant&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV31.GIF"><P align=center> Fig. 21. R&eacute;seau final.<P>On en d&eacute;duit la valeur des courants&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV32.GIF"><P>Le r&eacute;seau R/2R nous fournit des courant en progression g&eacute;om&eacute;trique de raison 2&nbsp;: on retombe sur la m&ecirc;me chose que le convertisseur &agrave; r&eacute;sistances pond&eacute;r&eacute;es.<P>La tension de sortie V<SUB>s</SUB> du convertisseur sera &eacute;gale &agrave;&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV33.GIF"><P>Le r&eacute;sultat est donc du m&ecirc;me genre que pour le CNA &agrave; r&eacute;sistances pond&eacute;r&eacute;es. On note un facteur 1/4, mais on peut remarquer qu'il suffit de mettre une r&eacute;sistance &eacute;gale &agrave; 4R en contre-r&eacute;action pour retomber sur le m&ecirc;me r&eacute;sultat.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C38">Pr&eacute;cision.</A></FONT></H5><P>Pour ce qui est de la pr&eacute;cision requise sur les r&eacute;sistances, on retrouve les m&ecirc;mes d&eacute;fauts que pour le CNA pr&eacute;c&eacute;dent&nbsp;:<P>- la r&eacute;f&eacute;rence de tension et la r&eacute;sistance de contre-r&eacute;action vont engendrer la m&ecirc;me erreur de pleine &eacute;chelle.<P>- une erreur sur la r&eacute;sistance du MSB aura 2<SUP>(N-1)</SUP> fois plus d'influence que la m&ecirc;me erreur sur le LSB.<P>Par contre, l'int&eacute;gration sera plus ais&eacute;e, et on sera capables de faire des convertisseurs pr&eacute;cis et &agrave; plus grand nombre de bits que le CNA &agrave; r&eacute;sistances pond&eacute;r&eacute;es.<P>En instrumentation, on rencontrera fr&eacute;quemment des CNA &agrave; 12bits de ce type, notamment sur des cartes d'acquisition de donn&eacute;es pour micro-ordinateurs.<P>La structure du r&eacute;seau et des commutateurs autorise une vitesse de conversion assez grande, car lors du basculement du commutateur, les r&eacute;sistances restent au m&ecirc;me potentiel&nbsp;: il n'y a donc pas d'influence des in&eacute;vitables capacit&eacute;s parasites qui mettraient du temps &agrave; se charger et &agrave; se d&eacute;charger &agrave; travers les r&eacute;sistances. Ceci autorise l'utilisation de r&eacute;sistances d'assez grande valeur, ce qui limite  l'erreur due aux r&eacute;sistances &agrave; l'&eacute;tat passant des commutateurs (quelques dizaines &agrave; quelques centaines d'ohms).</OL><P>&nbsp;<LI><H4><A NAME="C39">UTILISATION DES CNA.</A></H4><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C40">Utilisation "&nbsp;classique&nbsp;"</A></FONT></H5><P>Les CNA sont bien entendu utilisables tels quels pour faire de la conversion num&eacute;rique/analogique.<P>On les retrouvera en sortie de cha&icirc;ne de traitement num&eacute;rique lorsqu'un signal analogique est requis (commande d'un transducteur, contr&ocirc;le de processus...<P>Ils seront suivis d'un filtre plus ou moins sophistiqu&eacute; destin&eacute; &agrave; supprimer les "&nbsp;marches d'escalier&nbsp;" inh&eacute;rentes &agrave; la num&eacute;risation. Dans le cas de l'audio num&eacute;rique, le filtrage est d'une importance fondamentale, et c'est lui qui conditionne grandement la qualit&eacute; du son. Cet aspect n'est donc pas &agrave; sous estimer.<P>Il faudra faire attention au filtrage dans le cas o&ugrave; ces convertisseurs sont inclus dans une boucle d'asservissement&nbsp;: les escaliers peuvent &ecirc;tre n&eacute;faste &agrave; la stabilit&eacute; du syst&egrave;me.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C41">Amplificateurs &agrave; gain programmable.</A></FONT></H5><P>Les montages &eacute;tudi&eacute;s peuvent se r&eacute;sumer tous les deux &agrave; une chose&nbsp;: ce sont des amplificateurs d'une tension continue (E<SUB>ref</SUB>) dont le gain est ajustable par une entr&eacute;e num&eacute;rique (les codes binaires).<P>On peut donc penser &agrave; une autre utilisation des CNA&nbsp;: si on remplace E<SUB>ref</SUB> par une tension alternative quelconque, on peut utiliser l'entr&eacute;e num&eacute;rique pour faire varier le gain de l'ampli, et donc le signal en sortie.<P>Cette application ouvre la porte aux VCA (voltage controlled amplifier), att&eacute;nuateurs &agrave; commande num&eacute;rique (donc t&eacute;l&eacute;commandables &agrave; distance)...<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C42">Filtres programmable</A></FONT></H5><P>De la m&ecirc;me mani&egrave;re, on peut int&eacute;grer ces r&eacute;seaux dans certains sch&eacute;mas de filtres, et obtenir ainsi des filtres &agrave; fr&eacute;quence de coupure variable et command&eacute;e par un signal num&eacute;rique.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C43">Multiplieur.</A></FONT></H5><P>Une autre application importante est la multiplication de signaux&nbsp;: l'un sera analogique (en remplacement de E<SUB>ref</SUB>), et l'autre num&eacute;rique. Ce signal num&eacute;rique pourra &ecirc;tre un signal pr&eacute;alablement num&eacute;ris&eacute;. La sortie va donner le produit des deux signaux.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C44">Attention&nbsp;!!!</A></FONT></H5><P>Toutes ces applications "&nbsp;sp&eacute;ciales&nbsp;" ne peuvent marcher que s'il est possible d'appliquer des tensions bipolaires sur l'entr&eacute;e E<SUB>ref</SUB>. Il faut donc pouvoir alimenter sym&eacute;triquement le montage, et les commutateurs analogiques doivent &ecirc;tre bidirectionnels, ce qui n'est pas toujours le cas. On peut toujours polariser le signal pour qu'il soit globalement unipolaire, mais ces applications perdent de leur int&eacute;r&ecirc;t&nbsp;: la tension de polarisation &eacute;tant trait&eacute;e comme le signal, il sera difficile de l'extraire en sortie du convertisseur.<P>Les fabricants de convertisseurs indiquent si leurs produits sont con&ccedil;us pour fonctionner dans ces applications "&nbsp;d&eacute;riv&eacute;es&nbsp;". Il faudra donc se reporter &agrave; leur documentation.</UL></OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="C45">CONVERSION ANALOGIQUE / NUM&Eacute;RIQUE.</A></H3><P>Parmi les principes de conversion analogique / num&eacute;rique disponibles, nous en avons choisis trois particuli&egrave;rement repr&eacute;sentatifs, et qui se diff&eacute;rencient tr&egrave;s nettement en terme de <A HREF="ANNEXE/COMP_CAN.GIF" target=_blank>compromis vitesse / pr&eacute;cision</A>&nbsp;:<P>- les <STRONG>convertisseurs parall&egrave;les</STRONG> (ou flash en Anglais), tr&egrave;s rapides, mais limit&eacute;s en pr&eacute;cision. Leur rapidit&eacute; les destine en particulier aux oscilloscopes num&eacute;riques, qui se contentent de convertisseurs &agrave; 6 ou 8 bits.<P>- les <STRONG>convertisseurs &agrave; approximations successives</STRONG>, moins rapides que les pr&eacute;c&eacute;dents, mais avec des possibilit&eacute;s en r&eacute;solution bien sup&eacute;rieures (8 &agrave; 16 bits). Ils couvrent un vaste champ d'applications en mesure, de la carte d'acquisition de donn&eacute;es pour micro ordinateur aux CAN int&eacute;gr&eacute;s dans des micro contr&ocirc;leurs qui servent &agrave; piloter les applications les plus vari&eacute;es...<P>- les <STRONG>convertisseurs &agrave; comptage d'impulsion</STRONG> sont tr&egrave;s pr&eacute;cis, et par construction, sont aptes &agrave; filtrer des bruits importants. En contrepartie, ils sont tr&egrave;s lents, donc destin&eacute;s &agrave; faire des mesures de signaux stabilis&eacute;s.<OL TYPE=A><P>&nbsp;<LI><H4><A NAME="C46">ARCHITECTURE G&Eacute;N&Eacute;RIQUE.</A></H4><P>Comme pour le CNA, il peut &ecirc;tre int&eacute;ressant de voir les points communs aux CAN de technologies diff&eacute;rentes (hors convertisseurs &agrave; rampe).<P align=center><IMG SRC="CONV.FIG/CONV34.GIF"><P align=center> Fig. 22. Architecture d'un CAN<P>La pi&egrave;ce centrale du sch&eacute;ma de la figure 22 est... un CNA&nbsp;!<P>En pratique, un s&eacute;quenceur logique va balayer les codes binaires (de fa&ccedil;on plus ou moins astucieuse), ces codes vont &ecirc;tre convertis en une tension analogique par le CNA, tension qui va &ecirc;tre compar&eacute;e &agrave; celle d'entr&eacute;e. Le basculement du comparateur arr&ecirc;te le processus, et la donn&eacute;e est bascul&eacute;e et m&eacute;moris&eacute;e dans le buffer de sortie.<P>Il ne faut pas oublier ce que cache ce sch&eacute;ma, &agrave; savoir la composition du CNA, et en particulier la r&eacute;f&eacute;rence de tension. Cette r&eacute;f&eacute;rence peut d'ailleurs &ecirc;tre int&eacute;gr&eacute;e ou non dans le CAN&nbsp;; dans ce dernier cas, il faudra en mettre une &agrave; l'ext&eacute;rieur (la remarque est valable pour les CNA).<P>&nbsp;<LI><H4><A NAME="C47">CAN PARALL&Egrave;LE.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C48">Principe.</A></FONT></H5><P>La tension &agrave; mesurer est compar&eacute;e simultan&eacute;ment &agrave; 2<SUP>N</SUP>-1 tensions de r&eacute;f&eacute;rence, N &eacute;tant le nombre de bits du convertisseur. Le nombre 2<SUP>N</SUP>-1 s'explique par la notion de pleine &eacute;chelle vue <A HREF="#C07">pr&eacute;c&eacute;demment</A>&nbsp;: 0 est l'&eacute;tat logique suppl&eacute;mentaire qui fait 2<SUP>N</SUP> &eacute;tats au total pour un convertisseur &agrave; N bits.<P>Ce convertisseur est compos&eacute; des &eacute;l&eacute;ments suivants&nbsp;:<P>- une tension de r&eacute;f&eacute;rence E<SUB>ref</SUB>.<P>- un r&eacute;seau de 2<SUP>N</SUP> r&eacute;sistances mont&eacute;es en s&eacute;rie. Elles ont la m&ecirc;me valeur R &agrave; l'exception notable de la premi&egrave;re et de la derni&egrave;re qui ont la valeur 3R/2 et R/2&nbsp;: c'est l'astuce qui permet de faire basculer le premier comparateur non pas lorsque la tension d'entr&eacute;e est &eacute;gale &agrave; 1 LSB, mais 1/2 LSB. Au lieu d'avoir une erreur maxi de 1LSB (toujours par d&eacute;faut), on aura une erreur de &#177;1/2&nbsp;LSB (par exc&egrave;s ou par d&eacute;faut)&nbsp;: voir <A HREF="#C12">plus haut</A>. La derni&egrave;re r&eacute;sistance vaut 3R/2 pour &eacute;quilibrer le r&eacute;seau, et pour que le LSB soit conforme &agrave; sa valeur donn&eacute;e dans l'&eacute;quation <A HREF="#C10">[1]</A>.<P>- 2<SUP>N</SUP>-1 comparateurs comparent en permanence la tension &agrave; mesurer &agrave; une des tensions de r&eacute;f&eacute;rence d&eacute;livr&eacute;e par le pont de r&eacute;sistances.<P>- un d&eacute;codeur logique permet de traduire l'&eacute;tat des comparateurs en code binaire de sortie.<P align=center><A NAME="CF23"><IMG SRC="CONV.FIG/CONV35.GIF"></A><P align=center>Fig. 23. CAN parall&egrave;le &agrave; 3 bits.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C49">Pr&eacute;cision.</A></FONT></H5><P>Dans le principe, ce CAN pourrait &ecirc;tre relativement pr&eacute;cis. En pratique, on butte sur un inconv&eacute;nient de taille&nbsp;: il faut 2<SUP>N</SUP>-1 comparateurs pour un convertisseur &agrave; N bits, soit 63 comparateurs pour un 6 bits et 255 pour un 8 bits&nbsp;! Le proc&eacute;d&eacute; devient donc vite limitatif.<P>La principale source d'erreur provient de l'offset des comparateurs qui va introduire de la non lin&eacute;arit&eacute; diff&eacute;rentielle.<P>La rapidit&eacute; va &ecirc;tre conditionn&eacute;e par la vitesse des comparateurs et du d&eacute;codeur logique. La cadence de conversion est nettement sup&eacute;rieure au MHz, et peut atteindre des centaines de MHz pour les oscilloscopes num&eacute;riques.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C50">Utilisation.</A></FONT></H5><P>De par leur principe, ces CAN sont limit&eacute;s &agrave; 6 ou 8 bits, ce qui est insuffisant pour de l'instrumentation.<P>Ce handicap est n&eacute;gligeable en oscilloscopie num&eacute;rique&nbsp;: certains constructeurs utilisent des convertisseurs 6 bits, ce qui est suffisant pour d&eacute;crire l'axe vertical de l'&eacute;cran avec une r&eacute;solution sup&eacute;rieure &agrave; 2%.<P>Pour les applications requ&eacute;rant des vitesses &eacute;lev&eacute;es mais non extr&ecirc;mes, on utilise des convertisseurs semi-parall&egrave;les, qui utilisent beaucoup moins de comparateurs et conservent une vitesse de conversion int&eacute;ressante, ceci avec une r&eacute;solution pouvant atteindre 12 bits.</OL><P>&nbsp;<LI><H4><A NAME="C51">CAN &Agrave; APPROXIMATIONS SUCCESSIVES.</A></H4><P>Ces convertisseurs sont tr&egrave;s r&eacute;pandus car performants et bon march&eacute; (tout est relatif quand m&ecirc;me&nbsp;!).<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C52">Principe.</A></FONT></H5><P>Un sch&eacute;ma de principe est donn&eacute; figure 24. On y trouve principalement une r&eacute;f&eacute;rence de tension, un CNA, un comparateur et un s&eacute;quenceur logique pilot&eacute; par horloge.<P>Le s&eacute;quenceur logique d&eacute;livre un code binaire &agrave; l'entr&eacute;e du CNA. La tension de sortie de ce CNA est compar&eacute;e &agrave; la tension &agrave; mesurer, et en fonction du r&eacute;sultat, le code binaire est modifi&eacute; de mani&egrave;re &agrave; approcher la valeur &agrave; trouver.<P>L'exemple le plus simple de s&eacute;quenceur logique est un compteur binaire qui s'incr&eacute;mente d'une unit&eacute; &agrave; chaque coup d'horloge (montage vu en TP). Tous les codes binaires sont successivement compar&eacute;s &agrave; la tension d'entr&eacute;e. Quand le signal de sortie du comparateur s'inverse, la tension de r&eacute;f&eacute;rence vient juste de d&eacute;passer la valeur &agrave; mesurer&nbsp;: la conversion est termin&eacute;e, il ne reste qu'&agrave; lire la valeur binaire (donn&eacute;e ici par exc&egrave;s).<P align=center><IMG SRC="CONV.FIG/CONV36.GIF"><P align=center> Fig. 24. CAN &agrave; approximations successives.<P>Ce s&eacute;quenceur ne pr&eacute;sente en pratique aucun int&eacute;r&ecirc;t, si ce n'est l'aspect p&eacute;dagogique. Pour un convertisseur 12bits, il faudrait entre 0 et 4095 coups d'horloge&nbsp;: le temps de conversion ne serait pas constant, et surtout, serait beaucoup trop long pour les fortes valeurs de tension d'entr&eacute;e.<P>Les d&eacute;codeurs fonctionnent en fait sur le principe de la dichotomie (figure 25)&nbsp;:<P>- on compare d'abord la tension &agrave; mesurer E<SUB>x</SUB> &agrave; une tension de r&eacute;f&eacute;rence correspondant &agrave; tous les bits &agrave; 0 sauf le MSB &agrave; 1 (&eacute;tape 1). Si cette tension de r&eacute;f&eacute;rence est inf&eacute;rieure &agrave; E<SUB>x</SUB>, on laisse le MSB &agrave; 1, sinon, on le positionne &agrave; 0.<P>- tout en laissant le MSB dans l'&eacute;tat d&eacute;termin&eacute; pr&eacute;c&eacute;demment, on fixe le bit suivant &agrave; 1 et on applique le mode op&eacute;ratoire pr&eacute;c&eacute;dent (&eacute;tape 2).<P>- on proc&egrave;de ainsi de bit en bit, N fois pour un convertisseur &agrave; N bits<P>La conversion est faite rapidement, et le temps de conversion est le m&ecirc;me quelle que soit la tension d'entr&eacute;e.<P align=center><IMG SRC="CONV.FIG/CONV37.GIF"><P align=center> Fig. 25. Approximations par dichotomie.<P>Un exemple plus concret est donn&eacute; &agrave; la figure 26 (principe de base r&eacute;duit &agrave; 3 bits des ADC&nbsp;800 et d&eacute;riv&eacute;s de chez National Semi-conducteurs).<P align=center><IMG SRC="CONV.FIG/CONV38.GIF"><P align=center> Fig. 26. Exemple de CAN &agrave; approximations successives.<P>On retrouve le r&eacute;seau de r&eacute;sistances du convertisseur parall&egrave;le de la <A HREF="#CF23">figure 23</A>, mais chaque n&#156;ud de ce r&eacute;seau est connect&eacute; non pas &agrave; un comparateur, mais &agrave; un r&eacute;seau de commutateurs de connection (switching tree) dont le point final est reli&eacute; &agrave; l'entr&eacute;e d'un comparateur&nbsp;; l'autre entr&eacute;e de ce comparateur est reli&eacute;e &agrave; la tension &agrave; mesurer E<SUB>x</SUB>.<P>Chaque sortie logique du s&eacute;quenceur actionne <STRONG>simultan&eacute;ment</STRONG> tous les commutateurs de m&ecirc;me niveau (situ&eacute;s sur la m&ecirc;me verticale sur le sch&eacute;ma).<P>Sur le sch&eacute;ma, a<SUB>2</SUB>a<SUB>1</SUB>a<SUB>0</SUB> est &eacute;gal &agrave; la valeur binaire 101, soit 5. Si on suit le chemin des commutateurs ferm&eacute;s, on tombe bien sur la r&eacute;f&eacute;rence de tension correspondant &agrave; la valeur logique 5, soit 101 en binaire.<P>En appliquant la r&egrave;gle de s&eacute;quencement pr&eacute;c&eacute;dente, on trouve le code logique en 3 approximations (CAN &agrave; 3 bits).<P>N.B&nbsp;: l'ensemble compos&eacute; du r&eacute;seau de r&eacute;sistances et des commutateurs est bien un CNA&nbsp;: il suffit de relier le point de sortie du r&eacute;seau de connexion &agrave; un ampli suiveur pour avoir un type de CNA non &eacute;tudi&eacute; dans le paragraphe pr&eacute;c&eacute;dent mais parfaitement viable&nbsp;! Il est seulement co&ucirc;teux en r&eacute;sistances et en commutateurs si on le compare aux CNA &agrave; r&eacute;seau R/2R ou &agrave; r&eacute;sistances pond&eacute;r&eacute;es.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C53">Pr&eacute;cision.</A></FONT></H5><P>Ces convertisseurs sont pr&eacute;cis&nbsp;: il suffit d'un bon comparateur associ&eacute; &agrave; un CNA de la r&eacute;solution voulue pour obtenir la pr&eacute;cision d&eacute;sir&eacute;e.<P>La rapidit&eacute; sera limit&eacute;e par le temps d'&eacute;tablissement du CNA, la vitesse de r&eacute;action du comparateur, et la complexit&eacute; de la logique.<P>Les convertisseurs 12 bits courants (qui sont beaucoup utilis&eacute;s en instrumentation) ont un temps de conversion de l'ordre de 10 &agrave; 200&#181;s, ce qui fait des cadences d'&eacute;chantillonnage comprises entre 5 et 100kHz environ.<P><STRONG>Important</STRONG>&nbsp;: la conversion prend un certain temps&nbsp;; de plus, vu le principe utilis&eacute;, la comparaison ne se fait pas avec des codes binaires successifs. Il est <STRONG>imp&eacute;ratif</STRONG> dans ce cas de <STRONG>figer la tension d'entr&eacute;e pendant la conversion</STRONG>.<P>Cette fonction va &ecirc;tre r&eacute;alis&eacute;e par un <STRONG>&eacute;chantillonneur / bloqueur (E/B)</STRONG>&nbsp;: lorsque l'ordre de conversion est donn&eacute; par le s&eacute;quenceur logique, la sortie de l'E/B prend la valeur courante du signal et se fige &agrave; cette valeur (effet m&eacute;moire).<P>L'E/B est n&eacute;cessaire pour &eacute;viter des codes manquants et/ou des erreurs de conversion. Il est parfois int&eacute;gr&eacute; dans le CAN. Si ce n'est pas le cas, on le placera entre le signal &agrave; mesurer et le CAN.<P>Il faudra veiller &agrave; ce que sa pr&eacute;cision (offset, erreur de gain) soit compatible avec le CAN plac&eacute; en aval&nbsp;: inutile de mettre un CAN 16 bits ultra pr&eacute;cis derri&egrave;re un E/B de deuxi&egrave;me cat&eacute;gorie...<P>De m&ecirc;me, on fera attention au temps d'&eacute;tablissement de ce composant.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C54">Utilisation.</A></FONT></H5><P>On retrouve ces composants un peu partout, de l'audio num&eacute;rique aux cartes d'acquisition de donn&eacute;es en passant par l'int&eacute;gration dans des micro contr&ocirc;leurs.<P>Comme les <A HREF="#C47">convertisseurs parall&egrave;les</A>, ils mesurent des valeurs instantan&eacute;es d'un signal&nbsp;; il faudra donc s'assurer que celui-ci est exempt de bruit (du moins dans la limite de la r&eacute;solution du CAN).<P>Cette fonction sera assur&eacute;e par un c&acirc;blage correct de la cha&icirc;ne de mesure (revoir les <A HREF="../PERTU/COURS.HTM#P41" target=_blank>deux premiers chapitres</A>), et un filtrage avant acquisition (attention &agrave; la fr&eacute;quence de cassure du filtre qui servira par la m&ecirc;me occasion de filtre anti-repliement --loi de Shannon).</OL><P>&nbsp;<LI><H4><A NAME="C55">CAN &Agrave; COMPTAGE D'IMPULSIONS.</A></H4><P>Cette cat&eacute;gorie de convertisseur est tr&egrave;s r&eacute;pandue&nbsp;: tous les multim&egrave;tres "&nbsp;de poche&nbsp;" fonctionnent sur ce principe. Ils offrent une grande pr&eacute;cision pour un faible co&ucirc;t, mais de par leur principe, ils ne peuvent mesurer que des tensions statiques ou faire des moyennes, contrairement aux convertisseurs pr&eacute;c&eacute;dents qui &eacute;chantillonnent le signal instantan&eacute;.<P>On trouve 4 types de convertisseurs&nbsp;&agrave; rampe (de simple &agrave; quadruple rampe&nbsp;: le principe reste globalement le m&ecirc;me, les rampes suppl&eacute;mentaires venant compenser diverses erreurs), ainsi que des convertisseurs tension-fr&eacute;quence.<P>Tous ces convertisseurs sont bas&eacute;s sur une op&eacute;ration de chronom&eacute;trage (comptage d'impulsions) pendant un temps proportionnel &agrave; la tension d'entr&eacute;e.<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C56">Convertisseur simple rampe.</A></FONT></H5><P align=center><IMG SRC="CONV.FIG/CONV39.GIF"><P align=center> Fig. 27. Convertisseur simple rampe.<P>Le sch&eacute;ma de principe d'un tel convertisseur est donn&eacute; figure 27. Les principaux &eacute;l&eacute;ments le constituant sont&nbsp;:<P>- un g&eacute;n&eacute;rateur de rampe (int&eacute;gration d'une tension de r&eacute;f&eacute;rence).<P>- deux comparateurs comparant la rampe l'un au z&eacute;ro, l'autre &agrave; la tension &agrave; mesurer.<P>- divers &eacute;l&eacute;ments de logique, dont un g&eacute;n&eacute;rateur de porte, une horloge, un compteur et un syst&egrave;me d'affichage.<P>Lorsque la logique commande le d&eacute;marrage d'une mesure, il y a remise &agrave; z&eacute;ro de l'int&eacute;grateur (rampe) et des compteurs&nbsp;; ensuite, la tension de rampe cro&icirc;t lin&eacute;airement avec le temps (figure 28).<P>Quand le premier comparateur bascule &agrave; t<SUB>0</SUB>, la porte autorise le comptage des impulsions d&eacute;livr&eacute;es par l'horloge.<P>Quand le deuxi&egrave;me comparateur bascule, il ferme cette porte, et la valeur contenue dans les compteurs est verrouill&eacute;e et transmise aux afficheurs.<P align=center><IMG SRC="CONV.FIG/CONV40.GIF"><P align=center> Fig. 28. Tension en sortie d'int&eacute;grateur et porte.<P>On a donc fait un chronom&eacute;trage des impulsions de l'horloge pendant un temps proportionnel &agrave; la tension &agrave; mesurer.<P>Cette tension est &eacute;gale &agrave;&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV41.GIF"><P>Si N est le nombre d'impulsions compt&eacute;es et F la fr&eacute;quence de l'horloge, on a&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV42.GIF"><P>La pleine &eacute;chelle sera donn&eacute;e en nombre de points N<SUB>max</SUB>, c'est &agrave; dire le comptage maximum autoris&eacute; par la dynamique des compteurs. Dans ce cas, la r&eacute;solution sera l'inverse de N<SUB>max</SUB>, et elle sera d'autant meilleure que N<SUB>max</SUB> sera grand.<P>Le r&eacute;sultat montre qu'on aura int&eacute;r&ecirc;t &agrave; avoir une fr&eacute;quence d'horloge &eacute;lev&eacute;e &agrave; rampe donn&eacute;e pour avoir une bonne r&eacute;solution.<P>Il indique aussi le plus gros d&eacute;faut de ce convertisseur&nbsp;: la mesure d&eacute;pend de la fr&eacute;quence d'horloge, de la tension de r&eacute;f&eacute;rence, et des composants R et C de l'int&eacute;grateur.<P>Si on sait faire des horloges &agrave; quartz stables et des r&eacute;f&eacute;rences de tension de pr&eacute;cision, il en est tout autrement avec les capacit&eacute;s servant dans l'int&eacute;grateur&nbsp;: la pr&eacute;cision initiale est moyenne (sauf tri), et les d&eacute;rives (vieillissement, temp&eacute;rature...) difficiles &agrave; ma&icirc;triser.<P>L'autre gros d&eacute;faut est une grande sensibilit&eacute; au bruit&nbsp;: si la tension d'entr&eacute;e varie sous l'effet d'une perturbation quelconque, le deuxi&egrave;me comparateur peut fermer la porte et arr&ecirc;ter le processus de comptage&nbsp;: la valeur lue sera fausse.<P>Il faut noter ici que la tension d'entr&eacute;e doit imp&eacute;rativement &ecirc;tre <STRONG>fixe</STRONG>, sinon, on mesure n'importe quoi&nbsp;!<P>Comme le comptage dure un certain temps, on voit que toutes ces conditions sont difficiles &agrave; r&eacute;unir.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C57">Convertisseur double rampe.</A></FONT></H5><P>Ce type de convertisseur va pallier les d&eacute;fauts du simple rampe. Le sch&eacute;ma de principe est le suivant&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV43.GIF"><P align=center>Fig. 29. Sch&eacute;ma de principe du convertisseur double rampe.<P align=center><IMG SRC="CONV.FIG/CONV44.GIF"><P align=center> Fig. 30. Tension en sortie d'int&eacute;grateur.<P>La mesure se fait en deux temps&nbsp;:<P>- l'int&eacute;grateur ayant &eacute;t&eacute; remis &agrave; z&eacute;ro, on commute son entr&eacute;e sur la tension &agrave; mesurer. Le comptage d&eacute;marre.<P>- quand il atteint un nombre N<SUB>1</SUB> d&eacute;termin&eacute;, on commute l'entr&eacute;e de l'int&eacute;grateur sur une tension de r&eacute;f&eacute;rence E<SUB>ref</SUB> de polarit&eacute; oppos&eacute;e &agrave; E<SUB>x</SUB>. On compte les impulsions d'horloge jusqu'&agrave; ce que la tension de sortie de l'int&eacute;grateur s'annule, soit N<SUB>2</SUB>.<P>Si F est la fr&eacute;quence de l'horloge, on peut &eacute;crire&nbsp;:<P align=center><IMG SRC="CONV.FIG/CONV45.GIF"><P align=center><IMG SRC="CONV.FIG/CONV46.GIF"><P>La valeur affich&eacute;e est directement proportionnelle au comptage, et elle est ind&eacute;pendante des composants R et C, et aussi de la fr&eacute;quence de l'horloge. On pourrait comparer cette m&eacute;thode &agrave; la double pes&eacute;e avec une balance...<P>L'autre gros avantage du montage double rampe est son immunit&eacute; au bruit&nbsp;: le signal &eacute;tant int&eacute;gr&eacute;, seule la valeur moyenne du bruit sera prise en compte, soit une valeur nulle dans la plupart des cas. Si un parasite perturbe le signal lors de la mesure, seule son int&eacute;grale sera prise en compte&nbsp;; s'il est bref, elle sera n&eacute;gligeable, et le r&eacute;sultat tr&egrave;s peu modifi&eacute;.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C58">R&eacute;solution. Pr&eacute;cision.</A></FONT></H5><P>Pour ce type de convertisseurs, la dynamique n'est plus exprim&eacute;e en bits, mais en points, qui correspondent &agrave; la capacit&eacute; maximum du compteur.<P>Les multim&egrave;tres de poche font 2000 ou 3000 points, les plus &eacute;volu&eacute;s en font 20&nbsp;000 ou 30&nbsp;000, et les multim&egrave;tres de laboratoire d&eacute;passent all&eacute;grement les 100&nbsp;000 points.<P>Il ne faut toutefois pas se leurrer quand &agrave; leur pr&eacute;cision r&eacute;elle, qui est souvent bien en de&ccedil;&agrave; de la r&eacute;solution.<P>Par exemple, un multim&egrave;tre 2000 points (11 bits &eacute;quivalent &agrave; 2048 points) ne d&eacute;passe gu&egrave;re une pr&eacute;cision de 0,5% de pleine &eacute;chelle, soit l'&eacute;quivalent de 8bits&nbsp;! Et encore, ceci est valable pour des mesures de tensions continues&nbsp;; pour les mesures de courant ou de r&eacute;sistances, la pr&eacute;cision peut tomber &agrave; 1 ou 2%. En fait, ce sont les composants externes au convertisseur (ampli, att&eacute;nuateur) qui d&eacute;terminent la pr&eacute;cision.<P>Il faudra donc bien se garder de prendre pour argent comptant la valeur de l'affichage, et se rappeler que (au moins) le digit le moins significatif est faux. Dans tous les cas, il faut consulter la sp&eacute;cification de l'appareil pour conna&icirc;tre sa pr&eacute;cision r&eacute;elle, et ne pas se laisser impressionner par l'affichage...</OL></OL></OL></BODY></HTML>