<HTML><HEAD>   <TITLE>Alimentation</TITLE></HEAD><BODY BGCOLOR="#FFFFFF"><H2><CENTER>Alimentation</CENTER></H2><P><HR><H3>Sch&eacute;ma</H3><P><CENTER><IMG SRC="TMIX.FIG/ALIM.GIF" WIDTH=423 HEIGHT=169ALIGN=bottom></CENTER><P>Cette alimentation est du type alimentation doublesym&eacute;trique. Elles est tr&egrave;s classique, et ne pose pas deprobl&egrave;mes particuliers.<P>Nous n'allons pas calculer ici tous les composants end&eacute;tail&nbsp;: ceci sera fait ult&eacute;rieurement dans unerubrique "montages de base". En attendant, il sera faitr&eacute;f&eacute;rence au cours sur les diodes, qui contientd&eacute;j&agrave; pas mal d'&eacute;l&eacute;ments de calcul.<P>Le parti pris ici sera de faire des calculs "sur un coin detable", &agrave; savoir quelques calculs tr&egrave;ssimplifi&eacute;s faits de t&ecirc;te. J'ai un coll&egrave;gue(Jeannot) qui est un sp&eacute;cialiste de ce genre de calculs&nbsp;:il donne en g&eacute;n&eacute;ral un r&eacute;sultat &agrave; mieuxque 20%, en un temps record, alors que souvent, un calcul pluscompliqu&eacute; prend un temps fou et n'avance pas &agrave; grandchose de plus&nbsp;! Un exemple &agrave; m&eacute;diter...<P>&nbsp;<H3>Description du montage</H3><P>La table est aliment&eacute;e par le secteur 220V qui estabaiss&eacute; par un transformateur 220/2x12V.<P>Ces tension sont des tensions efficaces, et le 12V est la valeurobtenue quand le transformateur est charg&eacute; : &agrave; vide, ilfera plus (attention &agrave; la tension de service des condensateursde filtrage !)<P>Le secondaire du transformateur est double &agrave; pointmilieu&nbsp;: cette<A HREF="../../DIODE/COURS.HTM#D33" TARGET="_blank">configuration</A> est obligatoirepour obtenir deux alimentations (positive et n&eacute;gative) parrapport &agrave; la masse.<P>Ensuite, on a un <A HREF="../../DIODE/COURS.HTM#D27"TARGET="_blank">pont de Graetz</A> constitu&eacute; de 4 diodes 1N4001(1A/100V). On pourra remplacer ces diodes par un pontint&eacute;gr&eacute; 1A/100V.<P>La tension ainsi redress&eacute;e est filtr&eacute;e par deux groscondensateurs de 1000&#181;F. Pour calculer l'ondulation sur cecondensateur, il faut faire un bilan de la consommation du montage(voir ci-apr&egrave;s).<P>Ensuite, on trouve des r&eacute;gulateurs &agrave; tension desortie fixe, d&eacute;livrant +12 et -12V. Des condensateurs de100&#181;F filtrent d'&eacute;ventuelles ondulations. On prendragarde de ne pas trop augmenter la valeur de ces condensateurs, cesr&eacute;gulateurs sont asservis et donc susceptibles d'osciller surcharge capacitive. NS recommande des valeurs de 100nF dans sesdatabooks...<P>Un diode Led aliment&eacute;e par une r&eacute;sistance de 1k<IMGSRC="../../BASE/ICONES/OHM.GIF" WIDTH=8 HEIGHT=8 ALIGN=bottom>indique la mise sous tension. Vu que le r&eacute;gulateur positif estbeaucoup plus charg&eacute; que le n&eacute;gatif, on peut envisagerde mettre cette Led sur la sortie n&eacute;gative (attention &agrave;la polarit&eacute;&nbsp;!)<P>&nbsp;<H3>Quelques petits calculs</H3><BLOCKQUOTE><H5>* Calcul du courant consomm&eacute;</H5></BLOCKQUOTE><P>la puissance requise par la table de mixage est assezfaible&nbsp;: il n'y a que le courant de polarisation d'unepoign&eacute;e d'ampli-ops (15mA au total), la sortie casque(comptons 35mA en moyenne), plus 9 diodes Led sur l'alim +, dont 5actives en moyenne, soit 50mA, pour un total &eacute;gal &agrave;environ 100mA.<P>Cette estimation rapide donne le courant moyen qui serad&eacute;bit&eacute;&nbsp;; lors de pics de tension de modulation,les 8 Leds pourront &ecirc;tre allum&eacute;es et la prise casqueconsommer plus, mais les condensateurs de 1000&#181;F servent der&eacute;servoir pour ces cr&ecirc;tes.<BLOCKQUOTE><H5>* Calcul de l'ondulation</H5></BLOCKQUOTE><P>L'ondulation est li&eacute;e au condensateur de filtrage et aucourant consomm&eacute; par la relation(<A HREF="../../DIODE/COURS.HTM#D31" TARGET="_blank">voir cours</A>) :<P><CENTER><IMG SRC="../../DIODE/DIODE.FIG/DIODE26.GIF" WIDTH=151HEIGHT=44 ALIGN=bottom></CENTER><P>o&ugrave; F est la fr&eacute;quence du secteur, soit 50Hz. Pour uncondensateur de 1000&#181;F et un I<SUB>max</SUB> de 100mA, on end&eacute;duit une ondulation de 1V. Quand il n'y a pas de modulation(Leds &eacute;teintes et prise casque ne consommant rien), avec uncourant divis&eacute; par 6, on aura moins de 200mV d'ondulation.<P>Le condensateur de 1000&#181;F est donc largement suffisant, et ily a de la r&eacute;serve pour les pointes de courant&nbsp;!<BLOCKQUOTE><H5>* Tension de service des condensateurs de filtrage</H5></BLOCKQUOTE><P>Le transfo est donn&eacute; pour 12V efficaces. Quand il n'y a pasde modulation sur les entr&eacute;es de la table, le courantconsomm&eacute; est faible, et la tension sera un peu plus&eacute;lev&eacute;e&nbsp;: il n'est pas rare de constater 14V,surtout pour les transfos de faible puissance. Ca fait une tensioncr&ecirc;te de 14*<IMG SRC="../../BASE/ICONES/RACINE.GIF" WIDTH=9HEIGHT=11 ALIGN=bottom>2 = 19,8V. On a deux chutes de tension dediodes, soit 1,2V environ : il restera 18,6V sur les condensateurs.Une tension de service de 16V sera insuffisante, on choisira descondensateurs supportant 25V.<BLOCKQUOTE><H5>* Calcul de la puissance du transfo</H5></BLOCKQUOTE><P>Le transfo va d&eacute;biter 100mA en moyenne sur la sortie+12V&nbsp;; mais le il devra fournir la tension cr&ecirc;te avant ler&eacute;gulateur, soit 18,6V cr&ecirc;te, moins la moiti&eacute; dela tension d'ondulation, ce qui fait environ 18V (la prise en comptedes diodes est complexe et ne modifie pas trop ce calcul tr&egrave;sapproch&eacute;).<P>Pour la sortie +12V, le transfo devra donc fournirP=UI=18*0,1=1,8W.<P>Pour la sortie -12V, m&ecirc;me raisonnement, mais avec un courantde 50mA&nbsp;: on aura la moiti&eacute; de la puissancepr&eacute;c&eacute;dente, soit 0,9W.<P>Au total, le transfo devra fournir environ 2,7W. Le mod&egrave;lechoisi, un 3,6VA sera bon, mais juste limite&nbsp;: si on doitrajouter des &eacute;l&eacute;ments &agrave; cette table de mixage,il faudra "gonfler" un peu l'alimentation&nbsp;!<BLOCKQUOTE><H5>* Calcul de la puissance dissip&eacute;e par lesr&eacute;gulateurs</H5></BLOCKQUOTE><P>On a vu qu'on avait une tension de 18V moyens sur lecondensateur&nbsp;; le r&eacute;gulateur d&eacute;livre une tensionr&eacute;gul&eacute;e &agrave; 12V. Il devra donc supporter ladiff&eacute;rence, soit 6V. La puissance qu'il va dissiper sera de6*0,1=0,6W pour le r&eacute;gulateur +12V, et 6*0,05=0,3W pour ler&eacute;gulateur n&eacute;gatif. Pas de quoi fouetter un chat, mais&ccedil;a n&eacute;cessite un petit radiateur. On se reportera au<A HREF="../../PUISS/PUISS.HTM" TARGET="_blank">cours sur lespuissances et dissipations</A> pour faire le calcul (en attendant unexercice plus d&eacute;taill&eacute;&nbsp;!)<P>&nbsp;</BODY></HTML>