<HTML><HEAD>   <TITLE>MD05S</TITLE></HEAD><BODY BGCOLOR="#FFFFFF"><H2><CENTER>Table de mixage 5 voies MD05S</CENTER></H2><P><HR><P ALIGN=RIGHT><A HREF="../../BASE/EXOS.HTM"><IMG SRC="../../BASE/ICONES/NICHE.GIF"WIDTH=102 HEIGHT=81 ALIGN=bottom></A><P>&nbsp;<H3>Qu'es-ce que c'est ?</H3><P>Tout le monde sait ce qu'est une table de mixage&nbsp;! Celle quenous vous proposons ici a &eacute;t&eacute; con&ccedil;ue par <B>YvesCaroff</B>, un internaute passionn&eacute; d'&eacute;lectronique, etplus particuli&egrave;rement d'audio, qui comme vous s'est perdu unjour sur ce site et avec qui j'ai sympathis&eacute;.<P>Yves a construit 4 exemplaires de cette table&nbsp;: elle marche,donc !<P>Cette table est relativement simple, elle comporte 5entr&eacute;es :<BLOCKQUOTE><P>- une entr&eacute;e micro<P>- deux entr&eacute;e phono<P>- deux entr&eacute;es ligne</BLOCKQUOTE><P>Toutes ces entr&eacute;es rentrent dans un m&eacute;langeurpermettant des fondus-encha&icirc;n&eacute;s.<P>En sortie, on a :<BLOCKQUOTE><P>- une sortie pour l'amplificateur<P>- une prise casque qui permet de monitorer toutes les voiesind&eacute;pendamment de la sortie principale<P>- deux sorties pour enregistrement<P>- un vu-m&egrave;tre simplifi&eacute; &agrave; 4 leds</BLOCKQUOTE><P>Cette table est bien &eacute;videmment st&eacute;r&eacute;o. Danstoutes les explications qui suivent, on ne traitera qu'une seulevoie, mais le sch&eacute;ma est double partout.<P>Pour faciliter la compr&eacute;hension, chaque module est priss&eacute;par&eacute;ment et expliqu&eacute;, le cas&eacute;ch&eacute;ant accompagn&eacute; de simulations faites avec lelogiciel de calcul vectoriel Mathpad.<P><B><FONT SIZE="+1">Attention</FONT></B> !!! Cette table estrelativement simple du point de vue fonctionnalit&eacute;, mais ellereste tout de m&ecirc;me un montage assez complexe&nbsp;: lesd&eacute;butants devront le cas &eacute;ch&eacute;ant se faire aiderpar des gens plus chevronn&eacute;s. De toutes mani&egrave;res, lesch&eacute;ma n'est pas accompagn&eacute; des circuitsimprim&eacute;s et autres plans d'implantation&nbsp;: chacun le fera&agrave; son go&ucirc;t et aussi en fonction des composants dont ildispose. Vu la modularit&eacute; de la structure, les gens qui led&eacute;sirent pourront utiliser certains modules et pas d'autres,les modifier, les am&eacute;liorer... Les explications fournies sont(enfin, je pense&nbsp;!!!) suffisantes pour que tout un chacun puisseadapter le montage &agrave; ses besoins.<P>Si ce montage ne vous convient pas, je vous invite &agrave; faireun tour sur le <A HREF="http://hydris.free.fr" TARGET="_blank">site deLaurent Vittecoq</A>&nbsp;: il y d&eacute;crit un autre type detable, plus adapt&eacute;e &agrave; une utilisation personnelle.Allez-y dans tous les cas, c'est joli et bien fait, et en prime, il ya les typons (ce n'est pas le cas ici...).<P>Rien ne vous interdit de mixer les deux sch&eacute;ma,d'ailleurs...<P>Pour la correction de tonalit&eacute;, vous avez le choix entre un<A HREF="../MODTMIX/BAXAN.HTM" TARGET="_blank">baxandall</A>, un<A HREF="../MODTMIX/CP.HTM" TARGET="_blank">correcteur param&eacute;trique2 voies</A> et un <A HREF="../MODTMIX/EQU.HTM" TARGET="_blank">correcteurgraphique &agrave; 6 voies</A>. Allez y jeter un oeil&nbsp;!<P>&nbsp;<H3>El&eacute;ments communs aux modules. Remarques.</H3><P><B>Tous les modules sont st&eacute;r&eacute;o</B> &agrave;l'exception de l'entr&eacute;e micro (dont la sortie va sur les deuxentr&eacute;es du m&eacute;langeur, pour sonoriser les deux enceintesaccoustiques).<P><B>La sortie de chaque module est double</B> :<BR>* une sortie attaque le m&eacute;langeur via un potentiom&egrave;tre,et se retrouve en sortie de la table de mixage (signal qui attaquel'ampli de puissance)<BR>* l'autre sortie est directe et attaque une sortie casque via uns&eacute;lecteur de voie. Elle ne passe pas par lepotentiom&egrave;tre&nbsp;: on peut ainsi &eacute;couter une platinephono au casque, potentiom&egrave;tre &agrave; z&eacute;ro (doncinaudible sur la sortie principale) tout en ayant sur la sortieprincipale une source branch&eacute;e sur une entr&eacute;e "line".Ceci permet de pr&eacute;s&eacute;lectionner une source en toutediscr&eacute;tion.<P><B>Les</B> <B>potentiom&egrave;tres de volume</B> sont de type "A"(lin&eacute;aires). En g&eacute;n&eacute;ral, on met despotentiom&egrave;tres "B" (logarithmiques), dont la r&eacute;ponseest plus "lin&eacute;aire" &agrave; l'oreille. Mais, certainssonorisateurs pr&eacute;f&egrave;rent des potentiom&egrave;treslin&eacute;aires pour avoir plus de pr&eacute;cision der&eacute;glage vers les hauts niveaux de sortie.<P>Mon avis perso&nbsp;: la sono, c'est comme la moto, "on/off"(saturax est de retour&nbsp;!). Donc, personnellement, jeremplacerais ces potars chers, encombrants et qui crachouillent toutle temps par des interrupteurs. Mais bon, ce n'est que mon avis...<P><B>Les alimentations des amplis-op</B> ne sont pasd&eacute;coupl&eacute;es. Si les modules ne sont pas situ&eacute;strop loin de l'alimentation, il n'y a pas de probl&egrave;mes, lesamplis utilis&eacute;s (TL072 en majorit&eacute;) sont peu critiquesde ce point de vue.<BR>Les personnes qui voudraient mettre des amplis plus performants(NE5532 par exemple) devront faire attention&nbsp;: certains amplisne sont utilisables qu'avec des alimentations biend&eacute;coupl&eacute;es (47 ou 100nF c&eacute;ramique au pluspr&egrave;s des broches d'alimentation des amplis).<P><B>Historiquement</B> parlant, cette table a &eacute;t&eacute; lapremi&egrave;re &agrave; &ecirc;tre pr&eacute;sent&eacute;e sur cesite ; d'autres ont depuis vu le jour. Si leur architecture estdiff&eacute;rente, les modules sont quasiment identiques, &agrave;quelques d&eacute;tails de nomenclature pr&egrave;s. Les modules ont&eacute;t&eacute; d&eacute;crit pour cette table, mais lesexplications sont valables pour les autres tables : on ferasimplement attention aux valeurs utilis&eacute;es pour lescomposants.<P>&nbsp;<H3>Le sch&eacute;ma</H3><P>Le dessin ci-dessous donne l'aper&ccedil;u du montageglobal&nbsp;: en cliquant sur le bloc d&eacute;sir&eacute;, on seretrouve dans la page relative au module correspondant. Lesch&eacute;ma complet lisible est accessible<A HREF="TMIX.FIG/MD05S.GIF" TARGET="_blank">en cliquantl&agrave;</A>.<P><CENTER>&nbsp;</CENTER><P><CENTER><TABLE BORDER=1>   <TR>      <TD ROWSPAN=7 WIDTH=435 HEIGHT="98%">         <P><CENTER><MAP NAME="map1">            <AREA SHAPE=RECT COORDS="149,4,327,159" HREF="VU.HTM" TARGET="_blank">            <AREA SHAPE=RECT COORDS="211,360,405,437" HREF="ALIM.HTM" TARGET="_blank">            <AREA SHAPE=RECT COORDS="126,264,255,366" HREF="CASC.HTM" TARGET="_blank">            <AREA SHAPE=RECT COORDS="134,157,262,265" HREF="MEL.HTM" TARGET="_blank">            <AREA SHAPE=RECT COORDS="1,322,127,433" HREF="LINE.HTM" TARGET="_blank">            <AREA SHAPE=RECT COORDS="2,55,122,318" HREF="RIAA.HTM" TARGET="_blank">            <AREA SHAPE=RECT COORDS="2,2,134,54" HREF="MICRO.HTM" TARGET="_blank">         </MAP><IMG USEMAP="#map1" SRC="TMIX.FIG/MD05S_R.GIF"         WIDTH=410 HEIGHT=440 ALIGN=bottom></CENTER>      </TD><TD HEIGHT="14%">         <P><CENTER><FONT COLOR="#AF0000">1 : entr&eacute;e         micro</FONT></CENTER>      </TD></TR>   <TR><TD HEIGHT="14%">         <P><CENTER><FONT COLOR="#AF0000">2 : entr&eacute;es         phono</FONT></CENTER>      </TD></TR>   <TR><TD HEIGHT="14%">         <P><CENTER><FONT COLOR="#AF0000">3 : entr&eacute;es         ligne</FONT></CENTER>      </TD></TR>   <TR><TD HEIGHT="14%">         <P><CENTER><FONT COLOR="#AF0000">4 : m&eacute;langeurs et         sorties</FONT></CENTER>      </TD></TR>   <TR><TD HEIGHT="14%">         <P><CENTER><FONT COLOR="#AF0000">5 : sortie casque</FONT>         </CENTER>      </TD></TR>   <TR><TD HEIGHT="14%">         <P><CENTER><FONT COLOR="#AF0000">6 : vu-m&egrave;tre</FONT>         </CENTER>      </TD></TR>   <TR><TD HEIGHT="14%">         <P><CENTER><FONT COLOR="#AF0000">7 : alimentation</FONT>         </CENTER>                  <P>&nbsp;      </TD></TR></TABLE></CENTER></BODY></HTML>