<HTML><HEAD>   <TITLE>Entr&eacute;e micro</TITLE></HEAD><BODY BGCOLOR="#FFFFFF"><H2><CENTER>Entr&eacute;e micro</CENTER></H2><P>&nbsp;<P><A HREF="../../TELECH/EXOS/MICRO.ZIP">T&eacute;l&eacute;chargez</A> les fichiersMathPad<H3>Sch&eacute;ma</H3><P>L'entr&eacute;e micro est tr&egrave;s simple&nbsp;: c'est un<A HREF="../../AOP/COURS.HTM#AO11" TARGET="_blank">amplificateurinverseur</A> avec juste un petit condensateur en contrer&eacute;action pour &eacute;liminer les hautes fr&eacute;quences. Lesch&eacute;ma est le suivant&nbsp;:<P><CENTER><IMG SRC="TMIX.FIG/MICRO.GIF" WIDTH=359 HEIGHT=149ALIGN=bottom></CENTER><H3>Description du montage</H3><P>Comme pour les autres entr&eacute;es, on rentre sur uncondensateur charg&eacute; de bloquer les tensions continues (desdeux c&ocirc;t&eacute;s d'ailleurs&nbsp;! Si l'ampli venait &agrave;claquer, C<SUB>2</SUB> &eacute;vite qu'un courant continu n'endommagele micro...), et la sortie principale se fait sur unpotentiom&egrave;tre de r&eacute;glage de niveau via un autre<A HREF="../../OUTILS/COURS.HTM#O52" TARGET="_blank">condensateur de liaison</A>.<BR>La sortie est double, comme pour les autres modules&nbsp;: ladeuxi&egrave;me sortie (directe) va vers l'ampli casque.<P>La diff&eacute;rence par rapport aux autres entr&eacute;es, c'estque le micro est mono, on a donc un seul montage, et lepotentiom&egrave;tre est reli&eacute; simultan&eacute;ment auxentr&eacute;es droite et gauche du m&eacute;langeur.<P>Le gain &agrave; moyenne fr&eacute;quence d'un tel montage estA<SUB>v</SUB>=<A HREF="../../AOP/COURS.HTM#AO12" TARGET="_blank">-R2/R1</A>.<P>En pratique, l'imp&eacute;dance d'entr&eacute;e de l'&eacute;tageest R<SUB>1</SUB> (soit 1k), et le r&eacute;seau R<SUB>1</SUB> /C<SUB>2</SUB> va limiter la r&eacute;ponse aux bassesfr&eacute;quences, et C<SUB>1</SUB> / R<SUB>2</SUB> va la limiter auxhautes fr&eacute;quences.<P>On peut bien entendu calculer la fonction de transfert &agrave; lamain et faire un trac&eacute; asymptotique. C'est mieux de faire lecalcul avec MathPad (<A HREF="../../TELECH/EXOS/MICRO.TXT" TARGET="_blank">voir lefichier</A>)&nbsp;! Le r&eacute;sultat de la r&eacute;ponse (en dB)de l'&eacute;tage en fr&eacute;quence est le suivant&nbsp;:<P><CENTER><IMG SRC="TMIX.FIG/MI_BODE1.GIF" WIDTH=455 HEIGHT=255ALIGN=bottom></CENTER><P>On voit que la bande passante est un peu r&eacute;duite. C'estvoulu&nbsp;: aux basses fr&eacute;quences, &ccedil;a permetd'&eacute;liminer le souffle d&ucirc; &agrave; la parole del'annonceur, et &agrave; haute fr&eacute;quence, &ccedil;a limite lesouffle &eacute;lectronique.<P>Le gain &agrave; moyenne fr&eacute;quence vautA<SUB>v</SUB>=-R<SUB>2</SUB>/R<SUB>1</SUB>=150, soit 43,5dB<P>La fr&eacute;quence de cassure basse &agrave; -3dB vaut1/2/pi/R<SUB>1</SUB>/C<SUB>2</SUB>= 16Hz<P>La fr&eacute;quence de cassure haute th&eacute;orique &agrave;-3dB vaut 1/2/pi/R<SUB>2</SUB>/C<SUB>1</SUB>=32,1kHz.<BR>En pratique, elle est d'environ 20kHz&nbsp;! La diff&eacute;rencevient des caract&eacute;ristiques de l'ampli op, qui a un<A HREF="../../AOP/COURS.HTM#AO73" TARGET="_blank">produit gain-bandepassante</A> de 4MHz (4000kHz). Avec un gain de 150, la bandepassante devient &eacute;gale &agrave; 4000/150=26,7kHz.<BR>La conjonction de ces deux limitations donne une r&eacute;ponseglobale &agrave; environ 15kHz.<P>On note ici l'int&eacute;r&ecirc;t de faire une simulationr&eacute;aliste avec les caract&eacute;ristiques vraies del'ampli&nbsp;: un calcul &agrave; la main (qui ne tient jamais comptede l'ampli car &ccedil;a devient vite lourd...) aurait donn&eacute;une valeur th&eacute;orique fausse&nbsp;!<P>A titre indicatif, voil&agrave; trois simulationssuperpos&eacute;es de r&eacute;ponse en fr&eacute;quence&nbsp;:<BLOCKQUOTE><P>* la verte est la courbe pr&eacute;c&eacute;dente(ampli de produit gain / bande &eacute;gal &agrave; 4MHz)<P>* la rouge est celle obtenue avec un ampli parfait<P>* la bleue est celle obtenue avec un ampli de produit gain / bande1MHz (type 741)</BLOCKQUOTE><P><CENTER><IMG SRC="TMIX.FIG/MI_BODE2.GIF" WIDTH=455 HEIGHT=255ALIGN=bottom></CENTER><P>Moralit&eacute;&nbsp;: l'ampli op est quand m&ecirc;me assez loinde la perfection clam&eacute;e dans les livres d&egrave;s lors qu'onl'utilise &agrave; fort gain et haute fr&eacute;quence. En prime, lechoix des hypoth&egrave;ses de calcul doit se faire convenablementsous peine de graves d&eacute;convenues (m&ecirc;me pour un montage&agrave; priori tr&egrave;s simple) !</BODY></HTML>