<HTML><HEAD>   <TITLE>Entr&eacute;e phono (correcteur RIAA)</TITLE></HEAD><BODY BGCOLOR="#FFFFFF"><H2><CENTER>Entr&eacute;e phono (correcteur RIAA)</CENTER></H2><P><HR><P><B><A HREF="../../TELECH/EXOS/RIAA.ZIP">T&eacute;l&eacute;chargement</A></B> desfichiers de calcul MathPad (format ZIP).<P>&nbsp;<H3>Sch&eacute;ma</H3><P><CENTER><IMG SRC="TMIX.FIG/RIAA.GIF" WIDTH=389 HEIGHT=182ALIGN=bottom></CENTER><P>Cet &eacute;tage est b&acirc;ti autour d'un ampli op faible bruit(TL072, qui est un ampli double&nbsp;: n'oublions pas que le montageest st&eacute;r&eacute;o, donc qu'il y a deux &eacute;tagesidentiques) et quelques composants en contre-r&eacute;action.<P>D'apr&egrave;s l'auteur, les composants choisis donnent toutesatisfaction ; d'autres combinaisons ont &eacute;t&eacute;exp&eacute;riment&eacute;es mais ont fourni un son moins bon. Il estdonc conseill&eacute; d'utiliser les composants indiqu&eacute;s surle <A HREF="TMIX.FIG/MD05S.GIF" TARGET="_blank">sch&eacute;maprincipal</A>.<BR>Le TL072 peut &ecirc;tre remplac&eacute; par des amplis-op plusr&eacute;cents, plus performants mais aussi plus chers&nbsp;: un desbuts principaux lors de la cr&eacute;ation de cette table de mixage&eacute;tait la simplicit&eacute; associ&eacute;e &agrave; un faiblec&ocirc;ut.<P>Les curieux qui tenteraient d'autres combinaisons avecsucc&egrave;s peuvent donner leur avis et le r&eacute;sultat de leursexp&eacute;riences&nbsp;!<P>&nbsp;<H3>RIAA : qu'est-ce que c'est ?</H3><P>Ces correcteurs sp&eacute;cifiques s'appliquent aux lecteurs dedisques vinyles. Afin que la gravure de ces disques reste correcte,les ing&eacute;nieurs de l'&eacute;poque ont &eacute;t&eacute;amen&eacute;s &agrave; att&eacute;nuer les basses et amplifier lesaigus avant de graver les disques pour obtenir un son correct et unmeilleur <A HREF="../../OUTILS/COURS.HTM#O77" TARGET="_blank">rapportsignal sur bruit</A>.<P>Par contre, quand on lit le disque, il faut fairel'op&eacute;ration inverse : globalement, il faut amplifier fortementle signal issu des cellules magn&eacute;tiques qui ned&eacute;livrent que quelques mV, mais on va amplifier plus fortementles basses et moins les aigus.<P>Ces op&eacute;rations d'amplification/att&eacute;nuation ont&eacute;t&eacute; normalis&eacute;es par le RIAA (Radio IndustryAssociation of America) selon une courbe biend&eacute;termin&eacute;e&nbsp;: elle correspond &agrave; lar&eacute;ponse en fr&eacute;quence de deux<A HREF="../../AOP/COURS.HTM#AO76" TARGET="_blank">r&eacute;seaux&agrave; retard de phase</A> mis en cascade, le tout &eacute;tantamplifi&eacute; d'un facteur 10(20<A HREF="../../OUTILS/COURS.HTM#O72" TARGET="_blank">dB</A>).<BR>Les fr&eacute;quences de cassure sont 50 et 500Hz pour le premierr&eacute;seau et 2100 et 20000Hz pour le second. Cette configurationgarantit un gain de 0dB &agrave; 1kHz, fr&eacute;quence pivot de lacourbe.<BR>Le graphique ci-dessous (<A HREF="../../TELECH/EXOS/RIAA_TH.TXT" TARGET="_blank">voirfichier MathPad</A> associ&eacute;) donne la r&eacute;ponse enfr&eacute;quence r&eacute;elle et asymptotique de la correctionth&eacute;orique (gains en dB en ordonn&eacute;e)&nbsp;:<P><CENTER><IMG SRC="TMIX.FIG/RI_BODE1.GIF" WIDTH=510 HEIGHT=307ALIGN=bottom></CENTER><P>La correction est effectu&eacute;e dans notre montage en faisantune contre-r&eacute;action s&eacute;lective &agrave; l'aide dur&eacute;seauR<SUB>1</SUB>/C<SUB>1</SUB>/R<SUB>2</SUB>/C<SUB>2</SUB>.<H3>Description du montage</H3><BLOCKQUOTE><H4>* Architechture</H4></BLOCKQUOTE><P>Le sch&eacute;ma g&eacute;n&eacute;ral est simple : la structureest celle d'un <A HREF="../../AOP/COURS.HTM#AO15"TARGET="_blank">ampli non inverseur</A> &agrave;contre-r&eacute;action s&eacute;lective. Par rapport &agrave; l'ampliinverseur simple, on remplace les r&eacute;sistances par desimp&eacute;dances, c'est tout&nbsp;!<BLOCKQUOTE><H4>* Etage d'entr&eacute;e</H4></BLOCKQUOTE><P>Le signal (V<SUB>e</SUB>) rentre sur le condensateur C<SUB>3</SUB>charg&eacute; de bloquer une &eacute;ventuelle tension continue, etformant avec R<SUB>4</SUB> un filtre passe haut du premier ordre. Ens'aidant de l'<A HREF="../../AOP/ANNEXE/ANAOP07.HTM"TARGET="_blank">annexe relative aux trac&eacute;s de Bode</A>, lesplus courageux pourront d&eacute;terminer la fonction de transfert dece filtre. Ceux que l'exercice n'amuse pas se contenteront de voir ler&eacute;sultat donn&eacute; par MathPad :<P><CENTER><IMG SRC="TMIX.FIG/RI_BODE2.GIF" WIDTH=400 HEIGHT=232ALIGN=bottom></CENTER><P>La fr&eacute;quence de cassure est tr&egrave;s basse(1/2/pi/R<SUB>4</SUB>/C<SUB>3</SUB>), soit 7.2Hz. Ce filtre sert&agrave; &eacute;liminer les fr&eacute;quences extra-basses issues dela platine disque (ronflements, chocs...).<P>La r&eacute;sistance d'entr&eacute;e est de 47k<IMGSRC="../../BASE/ICONES/OHM.GIF" WIDTH=8 HEIGHT=8 ALIGN=bottom> (soitR<SUB>4</SUB>), qui est l'imp&eacute;dance normalis&eacute;e requisepar les cellules de lecture des phonos.<BLOCKQUOTE><H4>* Contre r&eacute;action</H4></BLOCKQUOTE><P>Nous allons l'&eacute;tudier sur un montagesimplifi&eacute;&nbsp;: on va retirer les composants del'entr&eacute;e, et le condensateur C<SUB>5</SUB> dans un premiertemps. Le sch&eacute;ma simplifi&eacute; est le suivant&nbsp;:<P><CENTER><IMG SRC="TMIX.FIG/RIAA_S.GIF" WIDTH=413 HEIGHT=179ALIGN=bottom></CENTER><P>Le sch&eacute;ma de gauche montre la similitude avec le montage debase&nbsp;: ampli non inverseur &eacute;quip&eacute; de deuximp&eacute;dances Z<SUB>1</SUB> et Z<SUB>2</SUB> en contrer&eacute;action.<P>Le gain d'un tel &eacute;tage est &eacute;gal &agrave;1+Z<SUB>2</SUB>/Z<SUB>1</SUB>.<P>L'imp&eacute;dance Z<SUB>2</SUB> est ais&eacute;mentsimul&eacute;e dans MathPad (<A HREF="../../TELECH/EXOS/RIAA_Z.TXT" TARGET="_blank">voirfichier</A> associ&eacute;)&nbsp;:<P><CENTER><IMG SRC="TMIX.FIG/RI_BODE3.GIF" WIDTH=408 HEIGHT=249ALIGN=bottom></CENTER><P>On notera que l'axe des y (module des imp&eacute;dances complexes)est logarithmique. On a deux r&eacute;seau R/C enparall&egrave;le&nbsp;: aux basses fr&eacute;quences, chaquer&eacute;seau a une imp&eacute;dance &eacute;gale &agrave; lar&eacute;sistance, et aux hautes fr&eacute;quences, c'estl'imp&eacute;dance du condensateur qui pr&eacute;domine. Enchoisissant astucieusement les r&eacute;seaux, on arrive &agrave; lacourbe globale (en rouge) qui est la somme des deux imp&eacute;dancesdes r&eacute;seaux R<SUB>1</SUB>/C<SUB>1</SUB> etR<SUB>2</SUB>/C<SUB>2</SUB> en s&eacute;rie.<P>Au final, la courbe de r&eacute;ponse en fr&eacute;quence aura laforme de la courbe globale d'imp&eacute;dance, soit &agrave;tr&egrave;s peu de choses pr&egrave;s la m&ecirc;me chose que lacourbe RIAA normalis&eacute;e pr&eacute;c&eacute;dente.<P>La seule diff&eacute;rence viendra du gain&nbsp;: &agrave; 1kHz,on aura un gain de 35dB, de mani&egrave;re &agrave; amplifier lesignal phono pour qu'il ait une amplitude suffisante pour attaquerl'amplificateur<BLOCKQUOTE><H4>* Utilit&eacute; du condensateur C<SUB>5</SUB></H4></BLOCKQUOTE><P>Nous avons vu que le gain &agrave; 1kHz sera de 35dB&nbsp;;&agrave; 50Hz, il sera donc de 35+20=55dB, soit environ 500. Ce gainsera le m&ecirc;me pour les fr&eacute;quences nulles, soit lacomposante continue. En pratique, comme on l'a &eacute;limin&eacute;e&agrave; l'entr&eacute;e, elle ne pourra venir que d'une seulesource&nbsp;: l'<A HREF="../../AOP/COURS.HTM#AO43"TARGET="_blank">offset de l'ampli</A>. Or, pour un TL072, il estcouramment de +/-5mV, et peut atteindre +/-10mV en pire cas. Ca nousferait une tension continue en sortie comprise entre 2,5 et 5V&nbsp;!<P>Pour &eacute;viter ce probl&egrave;me, on met le condensateurC<SUB>5</SUB> en s&eacute;rie avec R<SUB>3</SUB>, de tellemani&egrave;re que l'imp&eacute;dance Z<SUB>1</SUB> deviennetr&egrave;s grande aux basses fr&eacute;quences (l'imp&eacute;danced'un condensateur est th&eacute;oriquement infinie pour lecontinu)&nbsp;: pour le continu, le gain sera ainsi &eacute;gal&agrave; 1, et l'offset de l'ampli ne sera pas amplifi&eacute;.<BLOCKQUOTE><H4>* R&eacute;ponse en fr&eacute;quence del'&eacute;tage global</H4></BLOCKQUOTE><P>Un calcul avec MathPad (<A HREF="../../TELECH/EXOS/RIAA_RE.TXT" TARGET="_blank">voirfichier</A> de calcul) donne la r&eacute;ponse en fr&eacute;quencesuivante&nbsp;:<P><CENTER><IMG SRC="TMIX.FIG/RI_BODE4.GIF" WIDTH=455 HEIGHT=255ALIGN=bottom></CENTER><P>On note la coupure aux basses fr&eacute;quences&nbsp;: elle estdue au filtre d'entr&eacute;e (voir ci-dessus) et aussi &agrave;l'effet du condensateur C<SUB>5</SUB> qui diminue le gain del'&eacute;tage aux basses fr&eacute;quences.<P>On note que la courbe est tr&egrave;s proche de la courbe RIAAnormalis&eacute;e, sauf apr&egrave;s 10kHz, o&ugrave; on a plusd'att&eacute;nuation qu'avec la courbe th&eacute;orique.L'&eacute;cart reste minime et sera pratiquement peu audible&nbsp;!<BLOCKQUOTE><H4>* Sortie</H4></BLOCKQUOTE><P>La sortie V<SUB>s1</SUB> se fait sur un potentiom&egrave;tre der&eacute;glage de volume (en fait un potentiom&egrave;tre double quir&egrave;gle aussi l'autre &eacute;tage RIAA, n'oublions pas last&eacute;r&eacute;o&nbsp;!) via un condensateur sens&eacute; bloquerune &eacute;ventuelle tension continue. Cette sortie principale va aum&eacute;langeur. L'autre sortie (V<SUB>s2</SUB>) va sur les&eacute;lecteur de voie (sortie casque).<BLOCKQUOTE><H4>* Aspect technologique</H4></BLOCKQUOTE><P>On notera que les condensateurs C<SUB>4</SUB> et C<SUB>5</SUB>sont des chimiques polaris&eacute;s&nbsp;; en pratique, ils devrontbloquer des tensions continues &eacute;gales &agrave; l'offset del'ampli, soit +/-10mV maxi. Ces condensateurs verront ainsi destensions soit positives, soit n&eacute;gatives en fonction de l'amplimont&eacute;.<P>Ce n'est pas grave, car les tensions support&eacute;es sonttr&egrave;s faibles, donc n'abimeront pas les condensateurs. Onpourra remplacer ces condensateurs par des chimiques nonpolaris&eacute;s (ce qui est fait dans le mat&eacute;rielprofessionnel), composants plus rares et plus chers.<P>Dernier point&nbsp;: si l'ampli-op grille, on peut retrouver destensions continues importantes sur les condensateurs, lapolarit&eacute; pouvant &ecirc;tre positive ou n&eacute;gative. Dansce cas, le condensateur risque de claquer, et il ne jouera plus sonr&ocirc;le de protection vis &agrave; vis des &eacute;tagessitu&eacute;s en aval. Il faut juste le savoir... (mais les amplis-opsont solides&nbsp;!!!)<P>&nbsp;</BODY></HTML>