<HTML><HEAD>   <TITLE>Vu-m&egrave;tres</TITLE></HEAD><BODY BGCOLOR="#FFFFFF"><H2><CENTER>Vu-m&egrave;tres</CENTER></H2><P><HR><H3>Sch&eacute;ma</H3><P><CENTER><IMG SRC="TMIX.FIG/VU.GIF" WIDTH=270 HEIGHT=348ALIGN=bottom></CENTER><P>Ce sch&eacute;ma est relativement simple&nbsp;; ce"vu-m&egrave;tre" sert juste d'indicateur de signal, en aucun cas iln'est un appareil de mesure.<P>&nbsp;<H3>Description du montage</H3><P>Le signal arrive de la sortie principale et attaque enparall&egrave;le quatre comparateurs (des ampli-ops mont&eacute;s encomparateurs). La diode sert &agrave; ne garder que la partiepositive du signal, et la r&eacute;sistance d'1M<IMGSRC="../../BASE/ICONES/OHM.GIF" WIDTH=8 HEIGHT=8 ALIGN=bottom>emp&ecirc;che que l'entr&eacute;e des amplis ne soit flottante (elleest &agrave; haute imp&eacute;dance). Par contre, cette diode aura und&eacute;sagr&eacute;ment&nbsp;: elle va introduire un seuil (environ0,3V au niveau de courant consid&eacute;r&eacute;) sur le signal.<P>L'entr&eacute;e - des comparateurs est aliment&eacute;e par unebatterie de r&eacute;sistances de 1k<IMGSRC="../../BASE/ICONES/OHM.GIF" WIDTH=8 HEIGHT=8 ALIGN=bottom> quifont pont diviseur avec une r&eacute;sistance de 82k<IMGSRC="../../BASE/ICONES/OHM.GIF" WIDTH=8 HEIGHT=8 ALIGN=bottom>reli&eacute;e au +12V.<P>Les 4 entr&eacute;es - des comparateurs sont ainsipolaris&eacute;es par les potentiels suivants&nbsp;: 0.145V, 0.286V,0.424V et 0.558V (de bas en haut)<P>Les comparateurs vont basculer lorsque le signal issu de lamodulation sera sup&eacute;rieur &agrave; leurs seuils respectifs.<P>La diode va &eacute;lever les seuils de comparaison &agrave;respectivement 0.445V, 0.586V, 0.724V et 0.858V (hypoth&egrave;se de0,3V pour le <A HREF="../../DIODE/COURS.HTM#D13" TARGET="_blank">seuilde la diode</A> avec un courant d'environ 1&#181;A)<P>Ces valeurs sont des valeurs cr&ecirc;tes.<P>Quand un comparateur bascule, il alimente la Led correspondante.<P>&nbsp;<H3>Aspects technologiques</H3><P>Bien que simple, ce montage repose sur plusieurs optionstechnologiques pr&eacute;cises&nbsp;; on ne modifiera donc lesch&eacute;ma ou les composants qu'en connaissance de cause.<BLOCKQUOTE><H5>* choix de l'ampli-op</H5><P>Le choix du LM324 n'est pas anodin. On remarquera tout d'abordqu'il n'est pas aliment&eacute; en +12/-12V, mais en monotension+12/0V. Le signal qui rentre sur l'entr&eacute;e + peut valoir0V&nbsp;; les valeurs de polarisation sont faibles sur lesentr&eacute;es -.<BR>En fait, cet ampli a une <A HREF="../../AOP/COURS.HTM#AO46"TARGET="_blank">plage d'entr&eacute;e de mode commun</A> qui inclus le0V quand il fonctionne en monotension. Ce n'est pas le cas de tousles amplis et comparateurs, et de loin s'en faut&nbsp;! Ici, c'estune caract&eacute;ristique <B>obligatoire</B>&nbsp;!<P>Deuxi&egrave;me point, cet ampli doit &ecirc;tre capable ded&eacute;biter au moins 10mA dans les Leds&nbsp;: le LM324 estsp&eacute;cifi&eacute; &agrave; 20mA, mais l&agrave; encore, beaucoupd'amplis sont limit&eacute;s &agrave; environ 5mA.<P>Enfin, cet ampli est tr&egrave;s bon march&eacute;.<P>Le lecteur d&eacute;sireux d'am&eacute;liorer son montage ferabien attention &agrave; ces points importants&nbsp;!<H5>* Choix de la diode</H5><P>La diode choisie, une diode de signal 1N4148 pr&eacute;sente unseuil assez &eacute;lev&eacute;&nbsp;: on pourra luipr&eacute;f&eacute;rer une diode de signal au germanium, quipr&eacute;sentera un seuil plus faible. Attention &agrave; lar&eacute;sistance de 1M<IMG SRC="../../BASE/ICONES/OHM.GIF" WIDTH=8HEIGHT=8 ALIGN=bottom>&nbsp;: elle pourrait devenir insuffisante vules courants de fuite g&eacute;n&eacute;r&eacute;s par les composantsau germanium. On aura int&eacute;r&ecirc;t &agrave; abaisser savaleur.</BLOCKQUOTE></BODY></HTML>