<HTML><HEAD><TITLE>COURS.HTM</TITLE></HEAD><BODY><CENTER><IMG SRC="../BASE/ICONES/NAV.GIF"></CENTER><P align=center>Si votre &eacute;cran ne se pr&eacute;sente pas comme ceci, <A HREF="TRANS.HTM" target="_top"> cliquez l&agrave; </A><OL TYPE=I><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="T01">PR&Eacute;AMBULE</A></H3>Il existe une cat&eacute;gorie de composants (qu'ils soient &eacute;lectriques, m&eacute;caniques, etc ) tr&egrave;s int&eacute;ressante&nbsp;: c'est celle qui permet d'obtenir en sortie du dispositif une grandeur de m&ecirc;me nature et proportionnelle au stimuli d'entr&eacute;e. Les exemples foisonnent&nbsp;:<P> - le levier, qui permet d'avoir en sortie un effort plus important qu'en entr&eacute;e, ou bien un d&eacute;placement plus important (ou plus faible) que celui appliqu&eacute; &agrave; l'entr&eacute;e.<P> - l'engrenage, qui est la m&ecirc;me chose que le levier pour les mouvements rotatifs&nbsp;: il permet de multiplier ou diviser la vitesse ou bien le couple d'entr&eacute;e.<P> - le transformateur, qui permet de multiplier ou diviser la tension d'entr&eacute;e.<P>Dans chacun de ces cas, la variable de sortie est de m&ecirc;me nature que le stimuli &agrave; l'entr&eacute;e, et il existe un coefficient de proportionnalit&eacute; entre les deux, ind&eacute;pendant du stimuli d'entr&eacute;e, donc intrins&egrave;que au dispositif.<P>Il faut toutefois noter que dans tous les cas cit&eacute;s, il y a <STRONG>conservation de l'&eacute;nergie</STRONG>&nbsp;: l'&eacute;nergie &agrave; la sortie du composant est la m&ecirc;me que celle &agrave; l'entr&eacute;e.<P>Il <STRONG>existe d'autres dispositifs</STRONG> pr&eacute;sentant les m&ecirc;mes caract&eacute;ristiques que ceux pr&eacute;c&eacute;demment cit&eacute;s, et qui en plus, permettent de <STRONG>multiplier l'&eacute;nergie</STRONG>&nbsp;: on trouve en sortie du dispositif une &eacute;nergie sup&eacute;rieure &agrave; celle fournie &agrave; l'entr&eacute;e. Bien entendu, il n'y a pas de g&eacute;n&eacute;ration spontan&eacute;e d'&eacute;nergie, il faudra donc au dispositif une entr&eacute;e suppl&eacute;mentaire par laquelle une source sera susceptible de fournir de l'&eacute;nergie.<P>Dans ce cas, il n'y a pas seulement transformation de la sortie proportionnellement &agrave; l'entr&eacute;e, mais transfert d'&eacute;nergie d'une source ext&eacute;rieure &agrave; la sortie du dispositif, ce transfert &eacute;tant contr&ocirc;l&eacute; par l'entr&eacute;e.<P>Des exemples m&eacute;caniques bien connus sont respectivement les freins et la direction assist&eacute;e.<P>Dans le premier cas, l'effort de freinage est proportionnel &agrave; l'effort exerc&eacute; sur la p&eacute;dale, mais une source d'&eacute;nergie auxiliaire permet d'avoir &agrave; la p&eacute;dale un effort beaucoup plus faible que ce qu'il faudrait sans l'assistance. <P>Dans le deuxi&egrave;me cas, on a la m&ecirc;me chose&nbsp;: les roues tournent proportionnellement &agrave; l'angle de rotation du volant, mais la plus grosse partie de l'effort est prise en charge par un dispositif hydraulique.<P>Dans les deux cas, le dispositif permet d'amplifier l'effort exerc&eacute; tout en le conservant proportionnel au stimuli d'entr&eacute;e, ce qui facilite la commande.<P>Un tel dispositif est en fait un robinet de r&eacute;gulation d'&eacute;nergie&nbsp;: il faut disposer d'un r&eacute;servoir d'&eacute;nergie, on  pose le robinet dessus , et on peut disposer de l'&eacute;nergie proportionnellement &agrave; une commande d'entr&eacute;e.<P>En &eacute;lectronique, un tel composant est int&eacute;ressant, car il va permettre d'<STRONG>amplifier</STRONG> un signal, et de commander des actionneurs requ&eacute;rant de la puissance  (haut parleurs moteurs, etc )  avec des signaux de faible niveau issus de capteurs (microphone, sonde de temp&eacute;rature, de pression, ).<P>Le transistor &agrave; jonction va permettre de remplir (entre autres) cette fonction en &eacute;lectronique. Son domaine d'action est donc particuli&egrave;rement vaste <P>A noter qu'avant le transistor, cette fonction &eacute;tait remplie par des tubes &agrave; vide (triodes entre autres).<P>L'av&egrave;nement du transistor n'a donc pas apport&eacute; la fonction  miracle  en elle m&ecirc;me, mais une commodit&eacute; d'utilisation, l'encombrement r&eacute;duit (les tubes &agrave; vide ont besoin d'un syst&egrave;me d'alimentation complexe avec des tension relativement &eacute;lev&eacute;e, et n&eacute;cessitent une adaptation d'imp&eacute;dance en sortie (transformateur)), et plus tard, la fiabilit&eacute;, le faible co&ucirc;t <P><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="T02">PRINCIPE ET CARACT&Eacute;RISTIQUES.</A></H3><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="T03">INTRODUCTION &Agrave; L'EFFET TRANSISTOR.</A></H4>Nous avons d&eacute;j&agrave; vu &agrave; propos de la diode que si celle-ci est polaris&eacute;e en inverse, les porteurs minoritaires (&eacute;lectrons de la zone P et trous de la zone N, cr&eacute;&eacute;s par l'agitation thermique) traversent sans probl&egrave;mes la jonction et sont acc&eacute;l&eacute;r&eacute;s par le champ ext&eacute;rieur.<P>On a vu aussi que lorsque les porteurs majoritaires d'une zone franchissent la jonction, ils deviennent minoritaires dans l'autre zone, et qu'ils mettent un certain temps &agrave; se recombiner avec les porteurs oppos&eacute;s.<P>Partant des deux remarques pr&eacute;c&eacute;dentes, on peut d&eacute;duire que si on injecte dans la zone N d'une jonction NP polaris&eacute;e en inverse beaucoup de trous (qui seront dans cette zone des porteurs minoritaires) en faisant en sorte qu'ils ne se recombinent pas avec les &eacute;lectrons de la zone N, ils vont traverser la jonction et cr&eacute;er un courant dans le circuit ext&eacute;rieur.<P><CENTER><IMG SRC="TRANS.FIG/TRANS01.GIF"></CENTER><CENTER><P>Fig. 1. Injection de trous dans une zone N.<P></CENTER>La figure 1 illustre ce propos&nbsp;: il y aura des recombinaisons (charges + et - encercl&eacute;es), mais limit&eacute;es, et la plupart des trous iront dans la zone P et formeront le courant I<SUB>2</SUB>. A noter que les recombinaisons correspondent au courant I<SUB>1</SUB>-I<SUB>2</SUB>.<P><P>&nbsp;<LI><H4><A NAME="T04">LE TRANSISTOR R&Eacute;EL.</A></H4>Ce que nous venons de d&eacute;crire n'est ni plus ni moins que l'effet transistor&nbsp;: il ne manque que le moyen d'injecter des trous dans la zone N et de faire en sorte que les recombinaisons soient faibles, pour que la majorit&eacute; des trous passent dans la zone P.<P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T05">Principe de fonctionnement.</A></FONT></H5>Dans le transistor r&eacute;el, on va apporter les trous en cr&eacute;ant une jonction PN, que l'on va polariser en direct. On rajoute pour ce faire une zone P sur la zone N du montage Fig. 1. Cette zone P qui injecte les trous est alors l'<STRONG>&eacute;metteur</STRONG>, et la zone N, faiblement dop&eacute;e est la <STRONG>base</STRONG>. Comme dans le sch&eacute;ma de la Fig. 1., la jonction NP est polaris&eacute;e en inverse. La deuxi&egrave;me zone P est le <STRONG>collecteur</STRONG> (voir Fig. 2.).<P><CENTER><IMG SRC="TRANS.FIG/TRANS02.GIF"></CENTER><CENTER><P>Fig. 2. Sch&eacute;ma de principe d'un transistor.<P></CENTER>Les trous inject&eacute;s dans la base par l'&eacute;metteur ont une faible probabilit&eacute; de se recombiner avec les &eacute;lectrons de la base pour deux raisons&nbsp;:<P> - la base est faiblement dop&eacute;e, donc, les porteurs majoritaires (&eacute;lectrons) seront peu nombreux.<P> - la base  est &eacute;troite, et donc les trous &eacute;mis sont  happ&eacute;s  par le champ &eacute;lectrique collecteur-base avant d'avoir pu se recombiner (la largeur de la base est petite devant la longueur de diffusion des porteurs minoritaires inject&eacute;s par l'&eacute;metteur, qui sont ici les trous).<P>On peut observer le ph&eacute;nom&egrave;ne d'un point de vue diff&eacute;rent&nbsp;: quand on injecte un &eacute;lectron dans la base, l'&eacute;metteur devra envoyer plusieurs trous dans la base pour qu'il y en ait un qui se recombine avec l'&eacute;lectron &eacute;mis. Les autres trous vont passer directement dans le collecteur.<P>En premi&egrave;re approximation, le nombre de trous passant dans le collecteur est proportionnel au nombre d'&eacute;lectrons inject&eacute;s dans la base.<P>Ce rapport de proportionnalit&eacute; est un param&egrave;tre intrins&egrave;que au transistor et s'appelle le <STRONG>gain en courant <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle> </STRONG> .<P>Il ne d&eacute;pend que des caract&eacute;ristiques physiques du transistor&nbsp;: il ne d&eacute;pend ni de la tension inverse collecteur base, ni du courant circulant dans le collecteur. (ceci n'est qu'une approximation, mais dans les hypoth&egrave;ses de petits signaux, c'est assez bien v&eacute;rifi&eacute;.)<P>On a les relations suivantes&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS03.GIF"></CENTER><P><CENTER><IMG SRC="TRANS.FIG/TRANS04.GIF"></CENTER><P><CENTER><IMG SRC="TRANS.FIG/TRANS05.GIF"></CENTER><P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T06">Constitution et caract&eacute;ristiques physiques d'un transistor.</A></FONT></H5>Un transistor bipolaire est donc constitu&eacute; de trois zones de silicium alternativement dop&eacute;es N et P, formant deux jonctions PN.<P>Le transistor d&eacute;crit au paragraphe pr&eacute;c&eacute;dent comporte deux zones P et une zone N. C'est une des deux fa&ccedil;ons d'agencer les jonctions pour fabriquer un transistor&nbsp;:<P> - soit une zone P, une N et une P&nbsp;: le transistor est dit PNP.<P> - soit une zone N, une P et une N&nbsp;: le transistor est dit NPN.<P>Dans les deux cas, la zone centrale (base) est tr&egrave;s &eacute;troite vis &agrave; vis de la longueur de diffusion des porteurs minoritaires issus de la zone adjacente (l'&eacute;metteur).<P> La base poss&egrave;de en outre la caract&eacute;ristique d'&ecirc;tre tr&egrave;s faiblement dop&eacute;e en comparaison de l'&eacute;metteur.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T07">Courants de fuite.</A></FONT></H5>La relation [1] n'est qu'imparfaitement v&eacute;rifi&eacute;e pour une autre raison&nbsp;: si on reprend le sch&eacute;ma Fig. 2. et qu'on coupe la connection de la base (I<SUB>b</SUB> = 0), on s'aper&ccedil;oit que le courant circulant dans le collecteur n'est pas nul, d&ucirc; &agrave; des porteurs minoritaires qui passent de la base dans le collecteur. Ce courant est nomm&eacute; I<SUB>CEO</SUB>. La relation [1] devient donc&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS06.GIF"></CENTER><P>En pratique, aux temp&eacute;ratures ordinaires, ce courant de fuite sera n&eacute;glig&eacute;. On verra par la suite qu'on s'arrangera pour polariser les montages de telle mani&egrave;re que le point de polarisation soit quasiment ind&eacute;pendant du courant de fuite.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T08">Symboles, tensions et courants.</A></FONT></H5>Dans le symbole du transistor (figures 3 et 4), une fl&egrave;che d&eacute;signe l'&eacute;metteur ainsi que le sens de circulation du courant d'&eacute;metteur ; c'est le sens de cette fl&egrave;che qui va rep&eacute;rer le type de transistor&nbsp;: NPN pour un courant d'&eacute;metteur sortant du transistor, et PNP dans le cas inverse.<P>La base est repr&eacute;sent&eacute;e par une barre parall&egrave;le &agrave; l'axe collecteur-&eacute;metteur. D'autres symboles existent, mais celui-ci est le plus usit&eacute;.<P>Les transistors sont des composants polaris&eacute;s&nbsp;: les courants indiqu&eacute;s sont les seuls possibles pour un fonctionnement correct. En cons&eacute;quence, il faudra choisir le type de transistor adapt&eacute; au besoin (NPN ou PNP) et faire attention au sens de branchement.<P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T09">Transistor NPN</A></FONT></H5><CENTER><IMG SRC="TRANS.FIG/TRANS07.GIF"></CENTER><CENTER><P>Fig. 3. Courants et tensions sur un NPN.<P></CENTER>Dans ce type de transistor, les courants de base et de collecteur sont rentrants, et le courant d'&eacute;metteur est sortant. Les tensions V<SUB>BE</SUB> et V<SUB>CE</SUB> sont ici positives.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T10">Transistor PNP</A></FONT></H5>Dans ce type de transistor, les courants de base et de collecteur sont sortants, et le courant d'&eacute;metteur est rentrant. Les tensions V<SUB>BE</SUB> et V<SUB>CE</SUB> sont ici n&eacute;gatives.<P><CENTER><IMG SRC="TRANS.FIG/TRANS08.GIF"></CENTER><CENTER><P>Fig. 4. Courants et tensions sur un PNP.<P></CENTER></UL></OL><P>&nbsp;<LI><H4><A NAME="T11">CARACT&Eacute;RISTIQUES &Eacute;LECTRIQUES.</A></H4>Pour ce paragraphe, nous allons &eacute;tudier les caract&eacute;ristiques des transistors NPN. Celles des transistors PNP sont les m&ecirc;mes aux r&eacute;serves de signes d&eacute;crites au paragraphe pr&eacute;c&eacute;dent.<P>Les transistors NPN sont plus r&eacute;pandus car ils ont de meilleures performances que les PNP (la conductibilit&eacute; du silicium N est meilleure que celle du silicium P, ainsi que la tenue en tension).<P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T12">Montages de base.</A></FONT></H5>Quand on branche un transistor, si on s'arrange pour qu'il y ait une patte commune &agrave; l'entr&eacute;e et &agrave; la sortie du montage, il y a 3 mani&egrave;res fondamentales de proc&eacute;der&nbsp;:<P> - la patte commune est l'&eacute;metteur&nbsp;: on parle de montage<STRONG> &eacute;metteur commun</STRONG>. L'entr&eacute;e est la base et la sortie le collecteur.<P> - La patte commune est la base&nbsp;: on parle de montage <STRONG>base commune</STRONG>. L'entr&eacute;e est l'&eacute;metteur et la sortie le collecteur.<P> - La patte commune est le collecteur&nbsp;: on parle de montage <STRONG>collecteur commun</STRONG>. L'entr&eacute;e est la base et la sortie l'&eacute;metteur.<P>Nous reverrons ces trois montages fondamentaux dans un chapitre sp&eacute;cifique.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T13">Sch&eacute;ma de mesure des caract&eacute;ristiques.</A></FONT></H5>Les <STRONG>caract&eacute;ristiques qui suivent sont donn&eacute;es pour un montage &eacute;metteur commun</STRONG>. Le sch&eacute;ma le plus simple est le suivant&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS09.GIF"></CENTER><CENTER><P>Fig. 5. Montage de base  &eacute;metteur commun .<P></CENTER>Dans ce sch&eacute;ma, la base est polaris&eacute;e en direct par la r&eacute;sistance de base R<SUB>b</SUB>&nbsp;: le potentiel de la base est alors de 0,7V environ, car l'&eacute;metteur est &agrave; la masse et la jonction base &eacute;metteur est l'&eacute;quivalent d'une diode passante.<P>Le collecteur est lui polaris&eacute; par la r&eacute;sistance de collecteur R<SUB>c</SUB> de telle mani&egrave;re que la tension du collecteur soit sup&eacute;rieure &agrave; la tension de la base&nbsp;: la jonction base collecteur est alors polaris&eacute;e en inverse.<P>On polarise donc convenablement le transistor avec une simple alimentation et deux r&eacute;sistances. Dans ce montage, l'entr&eacute;e est la base et la sortie est le collecteur.<P>L'entr&eacute;e est caract&eacute;ris&eacute;e par les deux grandeurs I<SUB>B</SUB> et V<SUB>BE</SUB>, et la sortie par les grandeurs I<SUB>C</SUB> et V<SUB>CE</SUB>, soit 4 variables.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T14">Caract&eacute;ristique d'entr&eacute;e.</A></FONT></H5>La caract&eacute;ristique d'entr&eacute;e du transistor est donn&eacute;e par la relation I<SUB>B</SUB> = f (V<SUB>BE</SUB>) @ V<SUB>CE</SUB> = cte.<P>En fait, le circuit d'entr&eacute;e est la jonction base &eacute;metteur du transistor, soit une jonction diode.<P>Cette caract&eacute;ristique va d&eacute;pendre tr&egrave;s peu de la tension collecteur &eacute;metteur&nbsp;: on la donne en g&eacute;n&eacute;ral pour une seule valeur de V<SUB>CE</SUB>. La courbe est la suivante&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS10.GIF"></CENTER><CENTER><P>Fig. 6. Caract&eacute;ristique d'entr&eacute;e du transistor.<P></CENTER>La tension V<SUB>BE</SUB> est d'environ 0,7V pour une polarisation normale du transistor (courant de base inf&eacute;rieur au mA). Cette valeur est donc l&eacute;g&egrave;rement sup&eacute;rieure &agrave; celle d'une jonction de diode.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T15">Caract&eacute;ristique de transfert.</A></FONT></H5>La caract&eacute;ristique de transfert est d&eacute;finie par la relation I<SUB>C</SUB> = f (I<SUB>B</SUB>) @ V<SUB>CE</SUB> = cte.<P>Nous avons d&eacute;j&agrave; dit que le courant d'&eacute;metteur est proportionnel au courant de base (formule [1]).<P><CENTER><IMG SRC="TRANS.FIG/TRANS11.GIF"></CENTER><CENTER><P>Fig. 7. Caract&eacute;ristique de transfert du transistor.<P></CENTER>La caract&eacute;ristique de transfert est donc une droite ; le transistor est un g&eacute;n&eacute;rateur de courant command&eacute; par un courant.<P>Si on consid&egrave;re le courant de fuite I<SUB>CEO</SUB>, la caract&eacute;ristique ne passe pas par l'origine, car I<SUB>C</SUB> = I<SUB>CEO</SUB> pour I<SUB>B</SUB> = 0.<P>Le <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle> du transistor va varier grandement en fonction du type de transistor&nbsp;: 5 &agrave; 10 pour des transistors de grosse puissance, 30 &agrave; 80 pour des transistors de moyenne puissance, et de 100 &agrave; 500 pour des transistors de signal.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T16">Caract&eacute;ristique de sortie.</A></FONT></H5>La caract&eacute;ristique de sortie du transistor est d&eacute;finie par la relation I<SUB>C</SUB> = f (V<SUB>CE</SUB>) @ I<SUB>B</SUB> = cte. En pratique, on donne un r&eacute;seau de caract&eacute;ristiques pour plusieurs valeurs de I<SUB>B</SUB>.<P><CENTER><IMG SRC="TRANS.FIG/TRANS12.GIF"></CENTER><CENTER><P>Fig. 8. Caract&eacute;ristiques de sortie du transistor.<P></CENTER>Sur ces caract&eacute;ristiques (Fig. 8.), on distingue deux zones&nbsp;:<P> - une zone importante o&ugrave; le courant I<SUB>C</SUB> d&eacute;pend tr&egrave;s peu de V<SUB>CE</SUB> &agrave; I<SUB>B</SUB> donn&eacute;&nbsp;: cette caract&eacute;ristique est celle d'un <A HREF="../OUTILS/COURS.HTM#O26" target=_blank> g&eacute;n&eacute;rateur de courant &agrave; r&eacute;sistance interne utilis&eacute; en r&eacute;cepteur</A>. Dans le cas des transistors petits signaux, cette r&eacute;sistance est tr&egrave;s grande&nbsp;: en premi&egrave;re approche, on consid&eacute;rera que la sortie de ce montage &agrave; transistor est un g&eacute;n&eacute;rateur de courant parfait.<P> - La zone des faibles tensions V<SUB>CE</SUB> (0 &agrave; quelques volts en fonction du transistor) est diff&eacute;rente. C'est la zone de saturation. Quand la tension collecteur-&eacute;metteur diminue pour devenir tr&egrave;s faible, la jonction collecteur-base cesse d'&ecirc;tre polaris&eacute;e en inverse, et l'effet transistor d&eacute;cro&icirc;t alors tr&egrave;s rapidement. A la limite, la jonction collecteur-base devient aussi polaris&eacute;e en direct&nbsp;: on n'a plus un transistor, mais l'&eacute;quivalent de deux diodes en parall&egrave;le. On a une caract&eacute;ristique ohmique d&eacute;termin&eacute;e principalement par la r&eacute;sistivit&eacute; du silicium du collecteur. Les tensions de saturation sont toujours d&eacute;finies &agrave; un courant collecteur donn&eacute;&nbsp;: elles varient de 50mV pour des transistors de signal &agrave; des courants d'environ 10mA, &agrave; 500mV pour les m&ecirc;mes transistors utilis&eacute;s au maximum de leurs possibilit&eacute;s (100 &agrave; 300 mA), et atteignent 1 &agrave; 3V pour des transistors de puissance &agrave; des courants de l'ordre de 10A.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T17">Limites d'utilisation.</A></FONT></H5>Le transistor pourra fonctionner sans casser &agrave; l'int&eacute;rieur d'un domaine d'utilisation bien d&eacute;termin&eacute;.<P>Ce domaine sera limit&eacute; par trois param&egrave;tres&nbsp;:<P> - le courant collecteur maxi I<SUB>CMax</SUB>. Le d&eacute;passement n'est pas imm&eacute;diatement destructif, mais le gain en courant <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle> va chuter fortement, ce qui rend le transistor peu int&eacute;ressant dans cette zone.<P> - la tension de claquage V<SUB>CEMax</SUB>&nbsp;: au del&agrave; de cette tension, le courant de collecteur cro&icirc;t tr&egrave;s rapidement s'il n'est pas limit&eacute; &agrave; l'ext&eacute;rieur du transistor.<P> - la puissance maxi que peut supporter le transistor, et qui va &ecirc;tre repr&eacute;sent&eacute;e par une hyperbole sur le graphique, car on a la relation&nbsp;:<P> <BR><CENTER><IMG SRC="TRANS.FIG/TRANS13.GIF"></CENTER><P><CENTER><IMG SRC="TRANS.FIG/TRANS14.GIF"></CENTER><CENTER><P>Fig. 9. Limites d'utilisation du transistor.<P></CENTER>Toute la zone hachur&eacute;e sur la caract&eacute;ristique de sortie du transistor (Fig. 9.) est donc interdite.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T18">En bref </A></FONT></H5>Ce qu'il faut <STRONG>retenir d'essentiel dans le transistor</STRONG>, c'est que c'est un <STRONG>amplificateur de courant</STRONG> &nbsp;: c'est un <STRONG>g&eacute;n&eacute;rateur de (fort) courant</STRONG> (en sortie) <STRONG>pilot&eacute; par un (faible) courant </STRONG>(en entr&eacute;e).<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T19">Param&egrave;tres essentiels des transistors.</A></FONT></H5>Le choix d'un transistor (au premier ordre) se fera en consid&eacute;rant les param&egrave;tre suivants&nbsp;:<P> - Le V<SUB>CEMax</SUB> que peut supporter le transistor.<P> - Le courant de collecteur maxi I<SUB>CMax</SUB>.<P> - La puissance maxi que le transistor aura &agrave; dissiper (ne pas oublier le <A HREF="../PUISS/COURS.HTM#P21" target=_blank> radiateur</A>&nbsp;!).<P> - Le gain en courant <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle>.<P> - Si on utilise le transistor en commutation, la tension de saturation V<SUB>CEsatmax</SUB> sera un crit&egrave;re de choix essentiel.<P></OL></OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="T20">MONTAGES DE BASE.</A></H3><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="T21">PRELIMINAIRE.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T22">Mise en &#156;uvre du transistor.</A></FONT></H5>On a vu que le transistor &eacute;tait un amplificateur de courant&nbsp;: on va donc l'utiliser pour amplifier des signaux issus de sources diverses.<P>Il va falloir pour cela mettre en &#156;uvre tout un montage autour du transistor pour plusieurs raisons&nbsp;:<P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T23">Alimentation.</A></FONT></H5>Le transistor, tout en &eacute;tant classifi&eacute; dans les composants actifs, ne fournit pas d'&eacute;nergie&nbsp;: il faudra donc que cette &eacute;nergie vienne de quelque part&nbsp;! C'est le r&ocirc;le de l'alimentation qui va servir &agrave; apporter les tensions de polarisation et l'&eacute;nergie que le montage sera susceptible de fournir en sortie.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T24">Polarisation.</A></FONT></H5>Le transistor ne laisse passer le courant que dans un seul sens&nbsp;: il va donc falloir le polariser pour pouvoir y faire passer du courant alternatif, c'est &agrave; dire superposer au courant alternatif un courant continu suffisamment grand pour que le courant total (continu + alternatif) circule toujours dans le m&ecirc;me sens.<P>Il faudra en plus que la composante alternative du courant soit suffisamment petite devant la composante continue pour que la lin&eacute;arisation faite dans le cadre de l'hypoth&egrave;se des petits signaux soit justifi&eacute;e.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T25">Conversion courant/tension.</A></FONT></H5>Le transistor est un g&eacute;n&eacute;rateur de courant. Comme il est  plus commode de manipuler des tensions, il va falloir convertir ces courants en tensions&nbsp;: on va le faire simplement en mettant des r&eacute;sistances dans des endroits judicieusement choisis du montage.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T26">Liaisons.</A></FONT></H5>Une fois le transistor polaris&eacute;, il va falloir pr&eacute;voir le branchement de la source alternative d'entr&eacute;e sur le montage. En r&egrave;gle g&eacute;n&eacute;rale, ceci se fera par l'interm&eacute;diaire d'un condensateur de liaison plac&eacute; entre la source et le point d'entr&eacute;e du montage &agrave; transistor (base pour montages &eacute;metteur et collecteur commun, &eacute;metteur pour montage base commune).<P>De la m&ecirc;me mani&egrave;re, pour &eacute;viter que la charge du montage &agrave; transistor (le dispositif situ&eacute; en aval et qui va utiliser le signal amplifi&eacute;) ne perturbe sa polarisation, on va aussi l'isoler par un condensateur de liaison.<P>Ces condensateurs vont aussi &eacute;viter qu'un courant continu ne circule dans la source et dans la charge, ce qui peut leur &ecirc;tre dommageable. <P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T27">Insensibilit&eacute; du montage aux param&egrave;tres du transistor.</A></FONT></H5>Dans la mesure du possible, la polarisation devra rendre le montage insensible aux d&eacute;rives thermiques du transistor et elle devra &ecirc;tre ind&eacute;pendante de ses caract&eacute;ristiques (notamment le gain), ceci pour que le montage soit  universel , et ne fonctionne pas uniquement avec le transistor dont on dispose pour r&eacute;aliser la maquette. Cela permet aussi de changer le transistor sur le montage sans se poser de questions en cas de panne.<P></UL><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T28">M&eacute;thodologie de calcul.</A></FONT></H5>Nous avons d&eacute;j&agrave; vu lors d'une <A HREF="../OUTILS/COURS.HTM#O60" target=_blank> approche globale de l'&eacute;lectronique</A> qu'il convenait pour des raisons de simplification des calculs de s&eacute;parer l'&eacute;tude de la polarisation de l'&eacute;tude en alternatif petits signaux.<P>La polarisation est calcul&eacute;e dans un premier temps&nbsp;; on fait alors un sch&eacute;ma &eacute;quivalent du montage pour le continu. Le calcul se fait simplement avec la loi d'Ohm et les principaux th&eacute;or&egrave;mes de l'&eacute;lectricit&eacute;.<P>Pour la partie petits signaux alternatifs, on a vu qu'on va devoir lin&eacute;ariser les caract&eacute;ristiques du transistor au point de fonctionnement d&eacute;fini par la polarisation. Il faut donc d&eacute;finir les param&egrave;tres &agrave; lin&eacute;ariser et en d&eacute;duire un sch&eacute;ma &eacute;quivalent du transistor.<P>La solution globale (celle correspondant &agrave; ce qui est physiquement constat&eacute; et mesur&eacute; sur le montage) est la somme des deux solutions continue et alternative d&eacute;finies ci-dessus.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T29">Sch&eacute;ma &eacute;quivalent alternatif petits signaux du transistor. Param&egrave;tres hybrides.</A></FONT></H5>En pratique, pour simplifier l'expos&eacute;, nous allons d'abord donner le sch&eacute;ma &eacute;quivalent et les &eacute;quations qui s'y rapportent, pour ensuite justifier ces &eacute;l&eacute;ments &agrave; l'aide des caract&eacute;ristiques des transistors.<P>Le transistor est consid&eacute;r&eacute; comme un <A HREF="../OUTILS/COURS.HTM#O35" target=_blank>quadrip&ocirc;le</A>&nbsp;; il a deux bornes d'entr&eacute;e et deux bornes de sortie (une patte sera alors commune &agrave; l'entr&eacute;e et &agrave; la sortie) et va &ecirc;tre d&eacute;fini par 4 signaux&nbsp;: courant et tension d'entr&eacute;e, courant et tension de sortie. Ces variables ont <A HREF="#T13">d&eacute;j&agrave; &eacute;t&eacute; d&eacute;finies (Fig.5)</A> pour le montage &eacute;metteur commun&nbsp;: il s'agit du courant I<SUB>B</SUB> et de la tension V<SUB>BE</SUB> pour l'entr&eacute;e, du courant I<SUB>C</SUB> et de la tension V<SUB>CE</SUB> pour la sortie.<P>En fait, ces signaux se d&eacute;composent en deux parties&nbsp;: les tensions et courants continus de polarisation not&eacute;s I<SUB>Bo</SUB>, V<SUB>BEo</SUB>, I<SUB>Co</SUB>, et V<SUB>CEo</SUB>, et les petites variations alternatives autour du point de repos qui sont respectivement i<SUB>b</SUB>, v<SUB>be</SUB>, i<SUB>c</SUB>, et v<SUB>ce</SUB>.<P>Nous avons les &eacute;quations&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS15.GIF"></CENTER><P>Ce sont les petites variations qui vont nous int&eacute;resser pour le sch&eacute;ma &eacute;quivalent alternatif qui est le suivant&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS16.GIF"></CENTER><CENTER><P>Fig. 10. Sch&eacute;ma &eacute;quivalent du transistor NPN.<P></CENTER>Il convient de noter que ce sch&eacute;ma, bien que d&eacute;riv&eacute; du montage &eacute;metteur commun (l'&eacute;metteur est bien ici la borne commune entre l'entr&eacute;e et la sortie) est <STRONG>intrins&egrave;que au transistor</STRONG> et <STRONG>pourra &ecirc;tre utilis&eacute; dans tous les cas de figure</STRONG>&nbsp;: il suffira de l'int&eacute;grer tel quel au sch&eacute;ma &eacute;quivalent du reste du montage en faisant bien attention aux connections des trois pattes du transistor E, B et C.<P>L'appellation  sch&eacute;ma &eacute;quivalent du montage &eacute;metteur commun  provient de la d&eacute;finition des variables d'entr&eacute;e et de sortie qui sont celle de ce type de montage.<P><B>Nota&nbsp;: </B>On peut remarquer ici que les sens des courants sontconventionnels, et non absolus, et ne servent qu'&agrave; effectuerles calculs comme si les sources &eacute;taient continues&nbsp;; uneseule chose est imp&eacute;rative&nbsp;: phaser convenablementi<SUB>b</SUB> et i<SUB>c</SUB>. On peut donc choisir un sensoppos&eacute; pour ces deux courants. En pratique, cela signifie queles transistors PNP auront strictement le m&ecirc;me sch&eacute;maalternatif petits signaux que les NPN.</P><P>Dans ce sch&eacute;ma, nous avons les relations suivantes&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS17.GIF"></CENTER><P>L'indice  e  sur les param&egrave;tres h<SUB>ije</SUB> (qu'on appelle param&egrave;tres de transfert) indique qu'il s'agit des param&egrave;tres &eacute;metteur commun. On peut mettre le syst&egrave;me [10] sous la forme matricielle suivante&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS18.GIF"></CENTER><P>Nous nous contenterons ici de  voir que &ccedil;a existe , et d'ajouter que ce formalisme matriciel permet de simplifier les calculs quand on associe plusieurs quadrip&ocirc;les (en s&eacute;rie, en parall&egrave;le, en cascade ). Nous n'utiliserons pas ces caract&eacute;ristiques dans ce cours.<P>Si on analyse la premi&egrave;re &eacute;quation du syst&egrave;me [10], on y voit l'expression de v<SUB>be</SUB> en fonction de i<SUB>b</SUB> et v<SUB>ce</SUB>. On a&nbsp;:<P> - <STRONG>h<SUB>11e</SUB> = v<SUB>be</SUB>/i<SUB>b</SUB> @ v<SUB>ce</SUB> = 0</STRONG>. Si on se rappelle que v<SUB>be</SUB> et i<SUB>b</SUB> sont des petites variations autour du point de repos (V<SUB>BEo</SUB>,I<SUB>Bo</SUB>) et que la caract&eacute;ristique d'entr&eacute;e du transistor est la courbe I<SUB>B</SUB> = f(V<SUB>BE</SUB>) @ V<SUB>CE</SUB> = cte (donc v<SUB>ce</SUB> = 0), alors, on voit que <STRONG>h<SUB>11e</SUB> est la r&eacute;sistance dynamique de la jonction base-&eacute;metteur</STRONG>.<P> - <STRONG>h<SUB>12e</SUB> = v<SUB>be</SUB>/v<SUB>ce</SUB> @ i<SUB>b</SUB> = 0</STRONG>. Ce param&egrave;tre est en fait la r&eacute;action de la sortie sur l'entr&eacute;e dans la th&eacute;orie des quadrip&ocirc;les. Lors de l'&eacute;tude du principe du transistor, il a &eacute;t&eacute; dit que cette r&eacute;action &eacute;tait <STRONG>n&eacute;gligeable</STRONG>. Dans toute la suite de l'expos&eacute;, il ne sera plus fait mention de ce param&egrave;tre.<P>La deuxi&egrave;me &eacute;quation nous donne&nbsp;:<P> - <STRONG> h<SUB>21e</SUB> = i<SUB>c</SUB>/i<SUB>b</SUB> @ v<SUB>ce</SUB> = 0</STRONG>. Ce param&egrave;tre est le<STRONG> gain en courant en fonctionnement dynamique</STRONG> du transistor. Il peut &ecirc;tre l&eacute;g&egrave;rement diff&eacute;rent du gain en fonctionnement statique <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle> d&eacute;j&agrave; mentionn&eacute;, car il a &eacute;t&eacute; dit que la lin&eacute;arit&eacute; de ce param&egrave;tre n'est pas rigoureusement v&eacute;rifi&eacute;e.<P> - <STRONG> h<SUB>21e</SUB> = i<SUB>c</SUB>/v<SUB>ce</SUB> @ i<SUB>b</SUB> = 0</STRONG>. Ce param&egrave;tre a la dimension d'une admittance&nbsp;: c'est <STRONG>l'inverse de la r&eacute;sistance du <A HREF="#T16"> g&eacute;n&eacute;rateur de courant de sortie du transistor</A></STRONG>. En pratique, sa valeur est faible (donc la r&eacute;sistance est &eacute;lev&eacute;e), et sauf montage un peu  pointu , on le n&eacute;gligera, car son influence sera mod&eacute;r&eacute;e vis &agrave; vis de l'imp&eacute;dance de charge du montage.<P>On voit qu'en fait, les param&egrave;tres de transfert issus de la th&eacute;orie des quadrip&ocirc;les colle bien aux caract&eacute;ristiques physiques du transistor&nbsp;:<P> - une <STRONG>entr&eacute;e r&eacute;sistive</STRONG> (la r&eacute;sistance diff&eacute;rentielle de la jonction base-&eacute;metteur), la r&eacute;action de la sortie sur l'entr&eacute;e &eacute;tant n&eacute;gligeable.<P> - une <STRONG>sortie &eacute;quivalente &agrave; un g&eacute;n&eacute;rateur de courant proportionnel au courant d'entr&eacute;e</STRONG>, ce g&eacute;n&eacute;rateur &eacute;tant imparfait, donc <STRONG>avec une r&eacute;sistance interne</STRONG> non nulle.<P></OL><P>&nbsp;<LI><H4><A NAME="T30">MONTAGE &Eacute;METTEUR COMMUN.</A></H4>Le d&eacute;cor &eacute;tant enti&egrave;rement plant&eacute;, on va pouvoir passer au montage fondamental &agrave; transistor&nbsp;: le montage  &eacute;metteur commun . Il r&eacute;alise la fonction amplification de base de l'&eacute;lectronique.<P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T31">Polarisation. Point de fonctionnement.</A></FONT></H5><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T32">Polarisation par une r&eacute;sistance.</A></FONT></H5>Le montage le plus &eacute;l&eacute;mentaire tout en &eacute;tant fonctionnel est le suivant&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS19.GIF"></CENTER><CENTER><P>Fig. 11. Polarisation par r&eacute;sistance de base.<P></CENTER>Le fonctionnement est simple&nbsp;: le courant de base I<SUB>Bo</SUB> est fix&eacute; par R<SUB>b</SUB>, ce qui entra&icirc;ne un courant de collecteur I<SUB>Co</SUB> &eacute;gal &agrave; <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle>I<SUB>Bo</SUB>. Le courant collecteur &eacute;tant fix&eacute;, la tension aux bornes de R<SUB>c</SUB> va &ecirc;tre &eacute;gale &agrave; R<SUB>c</SUB> I<SUB>Co</SUB>. Le montage est enti&egrave;rement d&eacute;termin&eacute;.<P>Pour calculer les &eacute;l&eacute;ment R<SUB>b</SUB> et R<SUB>c</SUB>, on va proc&eacute;der &agrave; l'envers&nbsp;: on va partir de ce qu'on d&eacute;sire (le courant I<SUB>Co</SUB> et la tension V<SUB>CEo</SUB>), et remonter la cha&icirc;ne&nbsp;:<P> - On se <STRONG>fixe un courant collecteur</STRONG> de repos I<SUB>Co</SUB> (c'est le courant de polarisation). Ce courant sera choisi en fonction de l'application, et variera entre une dizaine de &#181;A (applications tr&egrave;s faible bruit), et une dizaine de mA (meilleures performances en  haute  fr&eacute;quence, soit quelques MHz).<P> - On se <STRONG>fixe une tension de collecteur</STRONG> V<SUB>CEo</SUB>, qu'on prend en g&eacute;n&eacute;ral &eacute;gale &agrave; E/2, pour que la tension du collecteur puisse varier autant vers le haut que vers le bas lorsqu'on appliquera le signal alternatif.<P> - La <STRONG>r&eacute;sistance de collecteur</STRONG> R<SUB>c</SUB>, en plus d'assurer une polarisation correcte de la jonction base-collecteur, convertit le courant collecteur (et ses variations) en tension. Elle est d&eacute;termin&eacute;e par la formule&nbsp;:<P> <BR><CENTER><IMG SRC="TRANS.FIG/TRANS20.GIF"></CENTER><P> - le <STRONG>courant I<SUB>Bo</SUB> est alors impos&eacute;</STRONG> par les caract&eacute;ristiques de gain en courant du transistor (le <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle>). On note ici qu'il est imp&eacute;ratif de le conna&icirc;tre (donc de le mesurer)&nbsp;:<P> <BR><CENTER><IMG SRC="TRANS.FIG/TRANS21.GIF"></CENTER><P> - La <STRONG>r&eacute;sistance de base</STRONG> R<SUB>b</SUB> est alors calcul&eacute;e &agrave; l'aide de la formule&nbsp;:<P> <BR><CENTER><IMG SRC="TRANS.FIG/TRANS22.GIF"></CENTER><P> - Pour ce faire, on prendra V<SUB>BEo</SUB> = 0,7V, car un calcul plus pr&eacute;cis (il faudrait conna&icirc;tre la caract&eacute;ristique  I<SUB>B</SUB> = f (V<SUB>BE</SUB>) pour le faire&nbsp;!) ne servirait &agrave; rien.<P>On peut r&eacute;sumer toute cette &eacute;tape de polarisation sur un seul graphique&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS23.GIF"></CENTER><CENTER><P>Fig. 12. Polarisation du transistor. <P></CENTER>On reconna&icirc;tra ici les trois caract&eacute;ristiques du transistor (entr&eacute;e, transfert, sortie) jointes sur le m&ecirc;me graphique. <STRONG>Attention</STRONG>&nbsp;: il faut bien remarquer que les axes sont diff&eacute;rents de part et d'autre du z&eacute;ro&nbsp;!<P>Ce montage assure les diverses fonction vues <A HREF="#T22">pr&eacute;c&eacute;demment</A>&nbsp;: il est correctement aliment&eacute;, polaris&eacute; (jonction base-&eacute;metteur en direct, jonction base collecteur en inverse, courants dans le bon sens ), et il poss&egrave;de des condensateurs de liaison. Il y a une ombre au tableau&nbsp;: bien que fonctionnel, ce montage ne garantit pas du tout la fonction de robustesse vis &agrave; vis de la d&eacute;rive thermique et des caract&eacute;ristiques du transistor. En effet, on peut remarquer que&nbsp;:<P> - si I<SUB>CEO</SUB> (le courant de fuite) augmente sous l'effet de la temp&eacute;rature, rien ne va venir compenser cette variation&nbsp;: V<SUB>CEo</SUB> va augmenter et le point de polarisation va se d&eacute;placer.<P> - Si on veut changer le transistor par un autre dont le gain soit tr&egrave;s diff&eacute;rent, vu que I<SUB>Bo</SUB> est impos&eacute; par E et R<SUB>b</SUB>, I<SUB>Co</SUB> = <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle> I<SUB>Bo</SUB> n'aura pas la bonne valeur, et V<SUB>CEo</SUB> non plus. Et il ne s'en faut pas de quelques&nbsp;%, car pour une m&ecirc;me r&eacute;f&eacute;rence de transistor, le gain peut varier d'un facteur 1,5 &agrave; 5 ou plus&nbsp;! On peut donc se retrouver avec un montage dont le transistor serait satur&eacute;, donc inutilisable pour l'amplification de petits signaux.<P>Comme il est impensable de mesurer chaque transistor avant de l'utiliser, on ne peut pas en pratique exploiter le montage d&eacute;crit <A HREF="#T32">Fig. 11</A>. Ce montage n'a qu'un int&eacute;r&ecirc;t p&eacute;dagogique, et pour des montages r&eacute;els, on va lui pr&eacute;f&eacute;rer le montage &agrave; polarisation par pont de base.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T33">Polarisation par pont de base.</A></FONT></H5>Ce sch&eacute;ma est un peu plus complexe que le pr&eacute;c&eacute;dent. Nous allons d'abord analyser les diff&eacute;rences, et ensuite, nous suivrons pas &agrave; pas la m&eacute;thode de calcul de la polarisation.<P><CENTER><IMG SRC="TRANS.FIG/TRANS24.GIF"></CENTER><CENTER><P>Fig. 13. Polarisation par pont de base.<P></CENTER>Par rapport au sch&eacute;ma <A HREF="#T32">Fig. 11</A>, on note que la base est polaris&eacute;e &agrave; l'aide d'un pont de r&eacute;sistances R<SUB>b1</SUB> et R<SUB>b2</SUB>. Le r&ocirc;le de ces r&eacute;sistances sera de fixer le potentiel de base. Comme la tension V<SUB>BE</SUB> est voisine de 0,7V, ceci impose de mettre une r&eacute;sistance entre l'&eacute;metteur et la masse. Cette r&eacute;sistance est d&eacute;coupl&eacute;e par le condensateur C<SUB>DE</SUB>, qui va &ecirc;tre l'&eacute;quivalent d'un court-circuit en alternatif.<P>A quoi servent ces &eacute;l&eacute;ments&nbsp;? Pour raisonner, on va faire abstraction du condensateur C<SUB>DE</SUB>, qui est un circuit ouvert pour le r&eacute;gime continu.<P>Les r&eacute;sistances du pont de base vont &ecirc;tre choisies de telle mani&egrave;re que le courant circulant dans ce pont soit tr&egrave;s sup&eacute;rieur au courant rentrant dans la base (au moins 10 fois plus grand), ceci afin que des petites variations du courant de base ne modifient pas le potentiel de la base, qui restera donc fixe.<P>Le potentiel d'&eacute;metteur va &ecirc;tre &eacute;gal au potentiel de base moins environ 0,7V et sera lui aussi fixe, &agrave; courant de base donn&eacute;. Dans ce cas, la tension aux bornes de  R<SUB>E</SUB> est d&eacute;termin&eacute;. Le courant d'&eacute;metteur (donc celui du collecteur, et celui de la base, via le <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle>) sera alors fix&eacute; par la valeur de la r&eacute;sistance R<SUB>E</SUB> et la tension du pont de base.<P>Le courant collecteur &eacute;tant d&eacute;fini, on choisit la r&eacute;sistance de collecteur pour avoir V<SUB>CEo</SUB> au milieu de la plage de tension utilisable.<P>Quel est l'avantage de ce montage&nbsp;? Supposons que le courant I<SUB>CEO</SUB> augmente sous l'effet de la temp&eacute;rature. La tension aux bornes de R<SUB>E</SUB> va alors augmenter. Comme le potentiel de base est fix&eacute; par le pont R<SUB>b1</SUB>/R<SUB>b2</SUB>, la tension V<SUB>BE</SUB> va diminuer. Cette diminution va entra&icirc;ner une baisse du courant de base, donc du courant de collecteur.<P>Cet effet vient donc s'opposer &agrave; l'augmentation du courant collecteur d&ucirc; &agrave; l'augmentation du courant de fuite I<SUB>CEO</SUB>. Le montage s'auto-stabilise.<P>L'autre avantage, c'est que le courant de collecteur est fix&eacute; par le pont de base et par la r&eacute;sistance d'&eacute;metteur. Ces &eacute;l&eacute;ments sont connus &agrave; 5% pr&egrave;s en g&eacute;n&eacute;ral, donc, d'un montage &agrave; un autre, on aura peu de dispersions, et surtout, le courant collecteur sera ind&eacute;pendant du gain du transistor. On a dit &agrave; cet effet que le pont de base est calcul&eacute; de mani&egrave;re &agrave; ce que le potentiel de base soit ind&eacute;pendant du courant de base&nbsp;: ce potentiel ne d&eacute;pendra pas du transistor, et le courant de base s'ajustera automatiquement en fonction du gain du transistor sans perturber le pont de base.<P>On fera les calculs dans l'ordre suivant&nbsp;:<P> - On <STRONG>fixe le courant collecteur de repos I<SUB>Co</SUB></STRONG>. A noter que le courant d'&eacute;metteur sera quasiment le m&ecirc;me car I<SUB>C</SUB> = I<SUB>E</SUB> - I<SUB>B</SUB> # I<SUB>E</SUB>.<P> - On <STRONG>fixe le potentiel d'&eacute;metteur V<SUB>Eo</SUB></STRONG> (au maximum &agrave; E/3, et en pratique, une valeur plus faible&nbsp;: 1 &agrave; 2V est une valeur assurant une assez bonne compensation thermique sans trop diminuer la dynamique de sortie).<P> - On calcule alors la <STRONG>r&eacute;sistance R<SUB>E</SUB></STRONG> par la formule&nbsp;:<P> <BR><CENTER><IMG SRC="TRANS.FIG/TRANS25.GIF"></CENTER><P> - On se <STRONG>fixe la tension collecteur &eacute;metteur V<SUB>CEo</SUB></STRONG>&nbsp;: en g&eacute;n&eacute;ral, on la prendra &eacute;gale &agrave; la moiti&eacute; de la tension disponible qui est &eacute;gale non plus &agrave; E, mais &agrave; E - V<SUB>Eo</SUB>. On en <STRONG>d&eacute;duit la r&eacute;sistance R<SUB>c</SUB></STRONG>&nbsp;:<P> <BR><CENTER><IMG SRC="TRANS.FIG/TRANS26.GIF"></CENTER><P> - On <STRONG>fixe le courant du pont de base</STRONG> (on prendra une valeur moyenne pour le <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle> du transistor, cette valeur n'&eacute;tant pas critique ici)&nbsp;:<P> <BR><CENTER><IMG SRC="TRANS.FIG/TRANS27.GIF"></CENTER><P> - On <STRONG>calcule R<SUB>b2</SUB></STRONG> (en r&egrave;gle g&eacute;n&eacute;rale, on prendra V<SUB>BEo</SUB> &eacute;gal  &agrave; 0,7V)&nbsp;:<P> <BR><CENTER><IMG SRC="TRANS.FIG/TRANS28.GIF"></CENTER><P> - On en <STRONG>d&eacute;duit R<SUB>b1</SUB></STRONG>&nbsp;:<P> <BR><CENTER><IMG SRC="TRANS.FIG/TRANS29.GIF"></CENTER><P>Le point de repos du montage &eacute;tant d&eacute;termin&eacute;, on va passer au comportement en alternatif.<P></UL><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T34">Fonctionnement en petits signaux alternatifs.</A></FONT></H5>Si on applique les r&egrave;gles d&eacute;finies dans le chapitre <A HREF="../OUTILS/COURS.HTM#O60" target=_blank>"Outils pour l'&eacute;lectronique"</A>, on obtient&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS30.GIF"></CENTER><CENTER><P>Fig. 14. Sch&eacute;ma &eacute;quivalent en alternatif.<P></CENTER>On notera que la r&eacute;sistance d'&eacute;metteur a disparu, car elle est shunt&eacute;e par le condensateur de d&eacute;couplage C<SUB>DE</SUB>.<P>En quoi va consister l'&eacute;tude en alternatif&nbsp;?<P>Tout d'abord, on va &eacute;valuer la <STRONG>capacit&eacute; du montage &agrave; amplifier le signal d'entr&eacute;e</STRONG>. La caract&eacute;ristique repr&eacute;sentative de cette fonction est le <STRONG><A HREF="../OUTILS/COURS.HTM#O71" target=_blank>gain en tension A<SUB>v</SUB></A></STRONG>, qui est le rapport entre les tensions de sortie et d'entr&eacute;e.<P>Ensuite, il faut regarder en quoi <STRONG>le montage peut s'interfacer avec la source d'entr&eacute;e sans la perturber</STRONG> ; il doit rester le plus neutre possible vis &agrave; vis de cette source, surtout s'il s'agit d'un capteur de mesure&nbsp;! La grandeur repr&eacute;sentative est l'<STRONG><A HREF="../OUTILS/COURS.HTM#O68" target=_blank>imp&eacute;dance d'entr&eacute;e</A></STRONG>.<P>M&ecirc;me chose vis &agrave; vis de la charge branch&eacute;e en sortie du montage, qui va utiliser le signal amplifi&eacute;&nbsp;: il va falloir regarder dans quelle  mesure <STRONG>l'&eacute;tage &agrave; transistor n'est pas perturb&eacute; par cette charge</STRONG>. La grandeur repr&eacute;sentative est l'<STRONG><A HREF="../OUTILS/COURS.HTM#O75" target=_blank>imp&eacute;dance de sortie</A></STRONG>.<P>Nous allons calculer ces trois param&egrave;tres. On pourrait y rajouter le gain en courant A<SUB>i</SUB> qui est le rapport des courants de sortie et d'entr&eacute;e, et aussi le gain en puissance. En amplification petits signaux, ces param&egrave;tres sont peu utilis&eacute;s, nous n'en parlerons donc pas.<P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T35">Fonctionnement  intuitif .</A></FONT></H5>Avant de faire des calculs compliqu&eacute;s sur un sch&eacute;ma abstrait, il serait bon de voir comment marche le montage de fa&ccedil;on intuitive et qualitative.<P>On consid&egrave;re que le potentiel d'&eacute;metteur est fixe gr&acirc;ce au condensateur de d&eacute;couplage C<SUB>DE</SUB>.<P>Si on augmente l&eacute;g&egrave;rement la tension de base, le courant de base va augmenter. Le courant de collecteur va augmenter proportionnellement au courant de base, et donc, la chute de tension dans la r&eacute;sistance R<SUB>c</SUB> va augmenter. Le potentiel du collecteur va alors baisser.<P>On peut par cons&eacute;quent s'attendre &agrave; un gain en tension n&eacute;gatif (entr&eacute;e et sortie en opposition de phase).<P>On peut aussi voir ce que donnerait le montage sans le condensateur C<SUB>DE</SUB>&nbsp;: si la tension de base augmente, le courant de base, donc de collecteur augmente. La tension aux bornes de la r&eacute;sistance d'&eacute;metteur va augmenter aussi, et donc, le potentiel de l'&eacute;metteur va remonter, ce qui va entra&icirc;ner une diminution de la tension V<SUB>BE</SUB>, donc du courant de base, donc du courant de collecteur&nbsp;: il y a une contre-r&eacute;action qui s'oppose &agrave; l'amplification.<P>Le gain en tension sera plus faible qu'avec le condensateur C<SUB>DE</SUB>. Nous aurons l'occasion de revoir ce montage (dit &agrave; charge r&eacute;partie) dans un chapitre ult&eacute;rieur.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T36">Gain en tension.</A></FONT></H5>Le gain en tension peut &ecirc;tre d&eacute;fini de deux mani&egrave;res&nbsp;:<P> - le gain  &agrave; vide , c'est &agrave; dire sans charge connect&eacute;e en sortie du montage.<P> - le gain  en charge , avec la charge connect&eacute;e.<P>Dans ce paragraphe, nous allons calculer le gain de l'&eacute;tage &agrave; vide. Nous verrons ensuite qu'il est simple de calculer le gain en charge &agrave; post&eacute;riori. <P>On va d'abord proc&eacute;der &agrave; quelques simplifications dans le sch&eacute;ma&nbsp;:<P> - les deux r&eacute;sistances du pont de base sont en parall&egrave;le du point de vue alternatif. Nous allons donc les remplacer par une seule r&eacute;sistance R<SUB>p</SUB> dont la valeur sera &eacute;gale &agrave; R<SUB>b1</SUB> // R<SUB>b2</SUB>.<P> - la r&eacute;sistance de sortie 1/h<SUB>22e</SUB> du transistor est grande (plusieurs dizaines de k<IMG SRC="../BASE/ICONES/OHM.GIF"> ). Pour une alimentation E de 12V, un courant I<SUB>Co</SUB> de 2mA et une tension V<SUB>CEo</SUB> de 5V, on aura R<SUB>c</SUB> = 2500 <IMG SRC="../BASE/ICONES/OHM.GIF">, soit environ le dixi&egrave;me de 1/h<SUB>22e</SUB>. On va donc n&eacute;gliger ce dernier terme. On notera que lorsque la tension d'alimentation est &eacute;lev&eacute;e et que le courant de collecteur est faible, cette simplification est moins justifi&eacute;e.<P> - on supprime la charge R<SUB>u</SUB> (hypoth&egrave;se de calcul).<P>Avec ces hypoth&egrave;ses, le sch&eacute;ma devient&nbsp;:<P><CENTER><A NAME="FIG15"><IMG SRC="TRANS.FIG/TRANS31.GIF"></A></CENTER><CENTER><P>Fig. 15. Sch&eacute;ma &eacute;quivalent simplifi&eacute;.<P></CENTER>On a les &eacute;quations suivantes&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS32.GIF"></CENTER><P><CENTER><IMG SRC="TRANS.FIG/TRANS33.GIF"></CENTER><P>Si on pose h<SUB>21e</SUB> = <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle> (le gain dynamique est &eacute;gal au gain statique), on obtient l'expression du gain en tension&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS34.GIF"></CENTER><P>Cette expression montre que le  gain de l'&eacute;tage d&eacute;pend de deux param&egrave;tres du transistor&nbsp;: le gain en courant <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle> et la r&eacute;sistance dynamique d'entr&eacute;e h<SUB>11e</SUB> .<P>Pour augmenter ce gain, on pourrait se dire qu'il suffit d'augmenter R<SUB>c</SUB> (donc de diminuer le courant I<SUB>Co</SUB> pour garder un V<SUB>CEo</SUB> constant).<P>Ce serait une grave erreur&nbsp;: en effet, si on diminue I<SUB>Co</SUB>, on diminue aussi forc&eacute;ment I<SUB>Bo</SUB>, et en cons&eacute;quence, la r&eacute;sistance diff&eacute;rentielle de la jonction base &eacute;metteur augmente&nbsp;: le gain risque donc de ne pas trop augmenter.<P>Les param&egrave;tres de cette formule sont donc li&eacute;s&nbsp;: ils ne sont pas ind&eacute;pendants, et on ne fait pas ce qu'on veut.<P>Nous allons essayer de trouver une formulation mettant en &#156;uvre des param&egrave;tres ind&eacute;pendants. <P>Nous avons d&eacute;j&agrave; dit que la jonction base-&eacute;metteur &eacute;tait l'&eacute;quivalent d'une diode. Elle satisfait notamment aux m&ecirc;mes formulations math&eacute;matiques. Dans le chapitre relatif &agrave; la diode, <A HREF="../DIODE/COURS.HTM#D15" target=_blank>l'&eacute;quation [2]</A> donnait la r&eacute;sistance diff&eacute;rentielle en fonction du courant dans la diode&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS35.GIF"></CENTER><P>Pour le transistor, on a la m&ecirc;me chose en rempla&ccedil;ant I<SUB>d</SUB> par le courant de base I<SUB>Bo</SUB> et r<SUB>d</SUB> par h<SUB>11e</SUB>.<P>Le terme kT/q est homog&egrave;ne &agrave; une tension et vaut environ 26mV &agrave; temp&eacute;rature ordinaire.<P>La relation simplifi&eacute;e entre h<SUB>11e</SUB> et I<SUB>Bo</SUB> (h<SUB>11e</SUB> est en <IMG SRC="../BASE/ICONES/OHM.GIF"> et I<SUB>Bo</SUB> en A) devient alors&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS36.GIF"></CENTER><P>Si on r&eacute;injecte cette relation dans la formule [24] en tenant compte du fait que I<SUB>Co</SUB> = <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle> I<SUB>Bo</SUB>, on obtient&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS37.GIF"></CENTER><P>Le terme 38,5 I<SUB>Co</SUB> repr&eacute;sente la pente du transistor au point de polarisation I<SUB>Co</SUB>. C'est le rapport  I<SUB>C</SUB> /  V<SUB>BE</SUB> en ce point. Il ne d&eacute;pend pas du transistor&nbsp;: c'est un param&egrave;tre int&eacute;ressant qui permet de calculer le gain d'un &eacute;tage ind&eacute;pendamment du composant choisi pour le r&eacute;aliser.<P>Cette formulation du gain est beaucoup plus satisfaisante que la pr&eacute;c&eacute;dente, car elle ne d&eacute;pend plus des caract&eacute;ristiques du transistor, et notamment de son gain (attention toutefois au facteur 38,5 qui est le terme q/kT&nbsp;: il d&eacute;pend de la temp&eacute;rature&nbsp;!). Elle montre aussi que le gain est relativement fig&eacute; si on garde pour r&egrave;gle une tension de polarisation V<SUB>CEo</SUB> &eacute;gale &agrave; la moiti&eacute; de la tension d'alimentation (moins la tension d'&eacute;metteur). Le seul moyen de l'augmenter est d'accro&icirc;tre la tension d'alimentation ; on pourra alors augmenter le terme R<SUB>c</SUB>I<SUB>Co</SUB> qui est la chute de tension dans la r&eacute;sistance de collecteur.<P>A tire indicatif, pour un montage polaris&eacute; sous 12V avec une tension V<SUB>Eo</SUB> de 2V et V<SUB>CEo</SUB> de 5V, on aura R<SUB>c</SUB> I<SUB>Co</SUB> &eacute;gal &agrave; 5V, et un gain en tension Av &eacute;gal &agrave; 190.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T37">Sch&eacute;ma &eacute;quivalent de l'&eacute;tage amplificateur.</A></FONT></H5>Le sch&eacute;ma &eacute;quivalent du montage amplificateur &eacute;metteur commun peut &ecirc;tre repr&eacute;sent&eacute; sous la forme donn&eacute;e figure 16 <A HREF="../OUTILS/COURS.HTM#O65" target=_blank>(voir chapitre I)</A>.<P>En entr&eacute;e, on y trouve l'imp&eacute;dance Ze (on n&eacute;glige la r&eacute;action de la sortie sur l'entr&eacute;e, donc, il n'y a pas d'autres composants)<P>En sortie, on a un g&eacute;n&eacute;rateur de tension command&eacute; (la tension de sortie est &eacute;gale &agrave; la tension d'entr&eacute;e multipli&eacute;e par le gain Av de l'&eacute;tage &agrave; vide) avec sa r&eacute;sistance interne qui sera la r&eacute;sistance de sortie de l'&eacute;tage.<P>On notera que la repr&eacute;sentation de la sortie est celle du g&eacute;n&eacute;rateur de Th&eacute;venin &eacute;quivalent <P><CENTER><IMG SRC="TRANS.FIG/TRANS38.GIF"></CENTER><CENTER><P>Fig. 16. Sch&eacute;ma &eacute;quivalent de l'&eacute;tage amplificateur.<P></CENTER>On pourra voir ici une contradiction avec notre montage &eacute;metteur commun qui est dot&eacute; en sortie d'un g&eacute;n&eacute;rateur de courant. Cette objection est balay&eacute;e par les deux points suivants&nbsp;:<P> - on veut calculer le<STRONG> gain en tension de l'&eacute;tage</STRONG>&nbsp;! On consid&egrave;re donc notre montage comme un g&eacute;n&eacute;rateur de tension avec sa r&eacute;sistance interne, si grande soit-elle.<P> - la transformation <A HREF="../OUTILS/COURS.HTM#O62" target=_blank>Norton / Th&eacute;venin</A> nous permet de passer d'une repr&eacute;sentation &agrave; l'autre simplement.<P>Ce sch&eacute;ma va nous permettre de d&eacute;finir les imp&eacute;dances d'entr&eacute;e et de sortie de notre &eacute;tage.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T38">Imp&eacute;dance d'entr&eacute;e.</A></FONT></H5>Par d&eacute;finition, et en se r&eacute;f&eacute;rant au sch&eacute;ma Fig. 16., l'imp&eacute;dance d'entr&eacute;e est &eacute;gale &agrave;&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS39.GIF"></CENTER><P>Ici, le sch&eacute;ma est simple, le g&eacute;n&eacute;rateur d'entr&eacute;e d&eacute;bite sur deux r&eacute;sistances en parall&egrave;le. On a donc&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS40.GIF"></CENTER><P>On voit qu'on n'a pas int&eacute;r&ecirc;t &agrave; prendre un pont de base avec des valeurs trop faibles. Il faudra donc faire un compromis avec la condition de polarisation (I<SUB>p</SUB> &gt;&gt; I<SUB>Bo</SUB>). En g&eacute;n&eacute;ral, h<SUB>11e</SUB> sera petit (1k<IMG SRC="../BASE/ICONES/OHM.GIF"> pour I<SUB>Bo</SUB> = 26&#181;A), donc cette imp&eacute;dance sera bien inf&eacute;rieure &agrave; R<SUB>p</SUB>, et tr&egrave;s souvent, elle sera insuffisante pour qu'on puisse interfacer des sources de tension (capteurs notamment) directement sur un &eacute;tage &eacute;metteur commun.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T39">Imp&eacute;dance de sortie.</A></FONT></H5><CENTER><IMG SRC="TRANS.FIG/TRANS41.GIF"></CENTER><CENTER><P>Fig. 17. Transformation Norton / Th&eacute;venin.<P></CENTER>Si on transforme la sortie du montage <A HREF="#FIG15">Fig. 15</A>. en celle du sch&eacute;ma <A HREF="#T37">Fig. 16</A>. (transformation Norton / Th&eacute;venin), on obtient le sch&eacute;ma de la figure 17.<P>la r&eacute;sistance R<SUB>c</SUB> qui &eacute;tait en parall&egrave;le sur le g&eacute;n&eacute;rateur de courant h<SUB>21e</SUB> i<SUB>b</SUB> devient la r&eacute;sistance en s&eacute;rie avec le g&eacute;n&eacute;rateur de tension. L'imp&eacute;dance de sortie est donc ici tr&egrave;s simple &agrave; identifier&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS42.GIF"></CENTER><P>Cette valeur est assez &eacute;lev&eacute;e, et souvent, on ne pourra pas connecter le montage tel quel sur une charge.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T40">Gain de l'&eacute;tage en charge.</A></FONT></H5>Il y a deux mani&egrave;res de voir la chose&nbsp;:<P> - On reprend le sch&eacute;ma &eacute;quivalent de la <A HREF="#FIG15">Fig. 15</A>. et on rajoute R<SUB>ch</SUB> en parall&egrave;le avec R<SUB>c</SUB>. La formule du gain devient alors&nbsp;:<P> <BR><CENTER><IMG SRC="TRANS.FIG/TRANS43.GIF"></CENTER><P> - On conna&icirc;t l'imp&eacute;dance de sortie et la charge. D'apr&egrave;s le sch&eacute;ma <A HREF="#T37">Fig. 16</A>, ces deux r&eacute;sistances forment un pont diviseur qui att&eacute;nue la tension de sortie &agrave; vide. Le gain devient&nbsp;:<P> <BR><CENTER><IMG SRC="TRANS.FIG/TRANS44.GIF"></CENTER><P> - On v&eacute;rifiera que si on d&eacute;veloppe R<SUB>c</SUB> // R<SUB>ch</SUB> dans la formule [31], on tombe bien sur la formule [32].<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T41">Bilan. Utilisation du montage.</A></FONT></H5>Au final, le montage &eacute;metteur commun est un montage ayant&nbsp;:<P> - <STRONG>une bonne amplification en tension</STRONG> (de l'ordre de plusieurs centaines).<P> - <STRONG>une imp&eacute;dance d'entr&eacute;e relativement faible</STRONG> (&eacute;gale &agrave; h<SUB>11e</SUB>, soit de l'ordre de plusieurs k<IMG SRC="../BASE/ICONES/OHM.GIF">), variable en fonction de la polarisation (plus I<SUB>Co</SUB> est faible, plus l'imp&eacute;dance d'entr&eacute;e est &eacute;lev&eacute;e).<P> - <STRONG>une imp&eacute;dance de sortie assez &eacute;lev&eacute;e</STRONG> R<SUB>c</SUB> qui va aussi d&eacute;pendre du courant de polarisation I<SUB>Co</SUB>.<P>Ce montage est l'amplificateur de base &agrave; transistor et sera donc utilis&eacute; comme sous-fonction dans des circuits plus complexes (discrets, ou int&eacute;gr&eacute;s comme dans l'amplificateur op&eacute;rationnel). Par contre, il sera souvent inexploitable seul, et il faudra lui adjoindre des &eacute;tages adaptateurs d'imp&eacute;dance.<P></UL></OL><P>&nbsp;<LI><H4><A NAME="T42">MONTAGE COLLECTEUR COMMUN.</A></H4>Dans ce montage, l'entr&eacute;e est la base et la sortie l'&eacute;metteur. C'est le collecteur qui est le point commun entre l'entr&eacute;e et la sortie. On notera que c'est faux pour la polarisation, car le collecteur est reli&eacute; au +E et l'entr&eacute;e se fait entre base et masse, et la sortie entre &eacute;metteur et masse. En fait, le collecteur est bien commun en alternatif, car le g&eacute;n&eacute;rateur de polarisation +E est un court circuit pour ce r&eacute;gime, et donc, le collecteur va se retrouver &agrave; la masse alternative&nbsp;: ce sera donc bien la patte commune entr&eacute;e sortie.<P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T43">Polarisation. Point de fonctionnement.</A></FONT></H5>Comme pour le montage &eacute;metteur commun, il y a moyen de polariser le transistor avec une seule r&eacute;sistance de base, ce qui entra&icirc;ne exactement les m&ecirc;mes inconv&eacute;nients. Nous passerons donc directement &agrave; la polarisation par pont de base, qui est la plus utilis&eacute;e. Le sch&eacute;ma complet est donn&eacute; sur la figure 18.<P>Par rapport au montage &eacute;metteur commun, on remarque que la r&eacute;sistance de collecteur a disparu. Le condensateur de d&eacute;couplage de R<SUB>E</SUB> aussi, ce qui est normal, car ici, la sortie est l'&eacute;metteur&nbsp;: il n'est donc pas question de mettre la sortie &agrave; la masse en alternatif&nbsp;!<P><CENTER><IMG SRC="TRANS.FIG/TRANS45.GIF"></CENTER><CENTER><P>Fig. 18. Montage collecteur commun.<P></CENTER>Pour la polarisation, on se reportera au paragraphe &eacute;quivalent du montage &eacute;metteur commun, et on prendra en compte les diff&eacute;rences suivantes&nbsp;:<P> - En g&eacute;n&eacute;ral, on fixera le potentiel de repos de l'&eacute;metteur &agrave; E/2 pour avoir la m&ecirc;me dynamique pour les alternances positives et n&eacute;gatives.<P> - On n'a pas &agrave; se pr&eacute;occuper du potentiel de collecteur ni de sa polarisation car cette broche est &agrave; +E.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T44">Fonctionnement en petits signaux alternatifs.</A></FONT></H5>Nous avons ici fait les m&ecirc;mes simplifications de sch&eacute;ma que pour le montage &eacute;metteur commun. On voit bien sur le sch&eacute;ma r&eacute;sultant que le collecteur est le point commun entr&eacute;e / sortie.<P><CENTER><IMG SRC="TRANS.FIG/TRANS46.GIF"></CENTER><CENTER><P>Fig. 19. Sch&eacute;ma &eacute;quivalent collecteur commun.<P></CENTER>On pourra remarquer que (en le r&eacute;arrangeant) le sch&eacute;ma &eacute;quivalent interne du transistor est le m&ecirc;me que pour le montage &eacute;metteur commun.<P>Par rapport &agrave; ce dernier montage, on a rajout&eacute; la r&eacute;sistance interne du g&eacute;n&eacute;rateur d'attaque. En effet, on voit qu'ici, l'entr&eacute;e et la sortie ne sont pas s&eacute;par&eacute;s, et donc, la charge va avoir un impact sur l'imp&eacute;dance d'entr&eacute;e et l'imp&eacute;dance interne du g&eacute;n&eacute;rateur d'attaque influera sur l'imp&eacute;dance de sortie. Il ne faut pas oublier que cette derni&egrave;re est l'imp&eacute;dance vue de la charge, donc englobe l'&eacute;tage &agrave; transistor et le dispositif d'attaque.<P>Le param&egrave;tre h<SUB>21e</SUB> a &eacute;t&eacute; remplac&eacute; par <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle>, les gains statique  et dynamique &eacute;tant sensiblement les m&ecirc;mes.<P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T45">Fonctionnement  intuitif .</A></FONT></H5>Consid&eacute;rons le sch&eacute;ma de la Fig. 18. Si on augmente la tension de base, la tension V<SUB>BE</SUB> va augmenter, ainsi que le courant I<SUB>B</SUB>, donc I<SUB>C</SUB>, ce qui va cr&eacute;er une chute de tension plus grande dans R<SUB>E</SUB>. Le potentiel de l'&eacute;metteur va alors remonter, contrariant l'augmentation de V<SUB>BE</SUB>, donc du courant I<SUB>C</SUB>. Le potentiel de l'&eacute;metteur va ainsi suivre sagement (aux variations <IMG SRC="../BASE/ICONES/DELTA.GIF" align=bottom>V<SUB>BE</SUB> pr&egrave;s, qui sont tr&egrave;s faibles) le potentiel qu'on impose &agrave; la base.<P>Si on regarde bien le montage, on voit en fait que la tension de sortie est toujours inf&eacute;rieure &agrave; la tension d'entr&eacute;e de la valeur V<SUB>BE</SUB>. Quand on va appliquer un signal alternatif sur la base, on va le retrouver sur la r&eacute;sistance d'&eacute;metteur diminu&eacute; de la variation de <IMG SRC="../BASE/ICONES/DELTA.GIF" align=bottom>V<SUB>BE</SUB> qui va &ecirc;tre tr&egrave;s faible.<P>On voit donc qu'intuitivement, ce montage aura un gain positif mais inf&eacute;rieur &agrave; 1.<P>Ce n'est pas un montage amplificateur. On va voir que ses caract&eacute;ristiques d'imp&eacute;dance d'entr&eacute;e et de sortie le destinent &agrave; l'adaptation d'imp&eacute;dance.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T46">Gain en tension.</A></FONT></H5>Si on applique la <A HREF="../OUTILS/COURS.HTM#O57" target=_blank>loi des n&#156;uds</A> au niveau de l'&eacute;metteur (Fig. 19.), on voit que le courant circulant dans R<SUB>E</SUB> est &eacute;gal &agrave; (<IMG SRC="../BASE/ICONES/BETA.GIF" align=middle>+1) i<SUB>b</SUB> et va de l'&eacute;metteur vers le collecteur. On peut alors poser les &eacute;quations suivantes&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS47.GIF"></CENTER><P>On remarquera au passage en analysant l'&eacute;quation [33] que vu de la base, tout se passe comme si la r&eacute;sistance R<SUB>E</SUB> &eacute;tait multipli&eacute;e par  le gain en courant.<P>On d&eacute;duit le gain &agrave; vide des &eacute;quations [33] et [34]&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS48.GIF"></CENTER><P>Ce gain est l&eacute;g&egrave;rement inf&eacute;rieur &agrave; 1, et c'est normal, car la tension de sortie est &eacute;gale &agrave; la tension d'entr&eacute;e multipli&eacute;e par le pont diviseur form&eacute; par h<SUB>11e</SUB> et (<IMG SRC="../BASE/ICONES/BETA.GIF" align=middle>+1)R<SUB>E</SUB>. En g&eacute;n&eacute;ral, R<SUB>E</SUB> est du m&ecirc;me ordre de grandeur que h<SUB>11e</SUB>, ce qui fait que le terme (<IMG SRC="../BASE/ICONES/BETA.GIF" align=middle>+1) R<SUB>E</SUB> est beaucoup plus grand que h<SUB>11e</SUB>. A quelques centi&egrave;mes pr&egrave;s, <STRONG>le gain sera quasiment &eacute;gal &agrave; l'unit&eacute;</STRONG>. Pour cette raison, et aussi pour ce qui a &eacute;t&eacute; dit dans la rubrique  fonctionnement intuitif , on appelle ce montage  <STRONG>&eacute;metteur suiveur</STRONG> , car le potentiel d'&eacute;metteur suit celui impos&eacute; &agrave; la base (aux variations <IMG SRC="../BASE/ICONES/DELTA.GIF" align=bottom>V<SUB>BE</SUB> pr&egrave;s, qui sont tr&egrave;s faibles).<P>Quand l'&eacute;tage est charg&eacute; sur R<SUB>ch</SUB>, il convient de remplacer R<SUB>E</SUB> par R<SUB>E</SUB> // R<SUB>ch</SUB> dans l'&eacute;quation [35], ce qui change tr&egrave;s peu le r&eacute;sultat, m&ecirc;me si R<SUB>ch</SUB> est &eacute;gale ou m&ecirc;me un peu inf&eacute;rieure &agrave; R<SUB>E</SUB> (dans les m&ecirc;mes conditions, le gain de l'&eacute;tage &eacute;metteur commun aurait chut&eacute; d'un facteur sup&eacute;rieur ou &eacute;gal &agrave; 2&nbsp;!).<P>Ceci augure d'une bonne imp&eacute;dance de sortie&nbsp;: il ne faut pas oublier que ce param&egrave;tre mesure l'aptitude d'un montage &agrave;  tenir  la charge.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T47">Imp&eacute;dance d'entr&eacute;e.</A></FONT></H5>Le courant i<SUB>e</SUB> est &eacute;gal &agrave; i<SUB>b</SUB> augment&eacute; du courant circulant dans R<SUB>p</SUB>. <P>L'imp&eacute;dance d'entr&eacute;e va donc &ecirc;tre &eacute;gale &agrave; R<SUB>p</SUB>//(v<SUB>e</SUB>/i<SUB>b</SUB>). On peut tirer cette derni&egrave;re valeur de l'&eacute;quation [33]&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS49.GIF"></CENTER><P>On en d&eacute;duit la valeur de l'imp&eacute;dance d'entr&eacute;e&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS50.GIF"></CENTER><P>On remarque que le premier terme est une valeur tr&egrave;s &eacute;lev&eacute;e (de l'ordre de <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle>R<SUB>E</SUB>, h<SUB>11e</SUB> &eacute;tant n&eacute;gligeable), et que malheureusement, la valeur du pont de base vient diminuer cette imp&eacute;dance d'un facteur 10 environ. C'est donc la valeur de R<SUB>p</SUB> qui va d&eacute;terminer l'imp&eacute;dance d'entr&eacute;e. Cette imp&eacute;dance est quand m&ecirc;me au moins 10 fois sup&eacute;rieure &agrave; celle de l'&eacute;metteur commun.<P>On voit toutefois que l&agrave; encore, la polarisation ne fait pas bon m&eacute;nage avec le r&eacute;gime alternatif&nbsp;: tout sera une affaire de compromis, comme bien souvent en &eacute;lectronique. Il n'y aura jamais <STRONG>la</STRONG> bonne solution, mais une solution interm&eacute;diaire qui sera la mieux adapt&eacute;e au fonctionnement d&eacute;sir&eacute;.<P>Il faut aussi remarquer que vu de la base, les imp&eacute;dances situ&eacute;es dans le circuit d'&eacute;metteur sont multipli&eacute;es par le gain <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle> du transistor. C'est une remarque tr&egrave;s importante qui est toujours vraie.<P>L'imp&eacute;dance d'entr&eacute;e a &eacute;t&eacute; ici calcul&eacute;e pour un montage fonctionnant &agrave; vide. Si on le charge par R<SUB>ch</SUB>, cette r&eacute;sistance vient se mettre en parall&egrave;le sur R<SUB>E</SUB> dans la formule [37]. Dans le cas g&eacute;n&eacute;ral, l'imp&eacute;dance d'entr&eacute;e d&eacute;pend donc de la charge. Cette d&eacute;pendance sera faible tant qu'on aura une polarisation par pont de base, car on a vu que R<SUB>p</SUB> est le terme pr&eacute;pond&eacute;rant. Il existe n&eacute;anmoins des astuces pour &eacute;liminer l'effet du pont de base (montage bootstrap ou couplage direct de deux &eacute;tages &agrave; transistor), et dans ce cas, il faudra tenir compte de la charge.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T48">Imp&eacute;dance de sortie.</A></FONT></H5>Le calcul va &ecirc;tre plus compliqu&eacute; que pour l'&eacute;metteur commun. On remarquera qu'ici la sortie n'est pas s&eacute;par&eacute;e de l'entr&eacute;e, ce qui fait que tout le circuit d'entr&eacute;e va influer sur l'imp&eacute;dance de sortie, y compris la r&eacute;sistance interne du g&eacute;n&eacute;rateur d'attaque R<SUB>g</SUB>. Comme dans le cas g&eacute;n&eacute;ral cette imp&eacute;dance n'est pas nulle, nous l'avons faite figurer sur le sch&eacute;ma <A HREF="#T44">Fig. 19</A>.<P>L&agrave; aussi, il faut calculer les caract&eacute;ristiques du g&eacute;n&eacute;rateur de Th&eacute;venin &eacute;quivalent.<P>On peut &eacute;crire les &eacute;quations suivantes&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS51.GIF"></CENTER><P>Si on consid&egrave;re le g&eacute;n&eacute;rateur de Th&eacute;venin &eacute;quivalent au g&eacute;n&eacute;rateur d'entr&eacute;e plus R<SUB>p</SUB>, on peut &eacute;crire&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS52.GIF"></CENTER><P>Si on pose&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS53.GIF"></CENTER><P>en injectant [40] et [41] dans [39], on obtient&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS54.GIF"></CENTER><P>En rempla&ccedil;ant i<SUB>b</SUB> par cette valeur dans [38], on a&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS55.GIF"></CENTER><P>Apr&egrave;s un d&eacute;veloppement laborieux, on peut mettre Vs sous la forme  A e<SUB>g</SUB> + Z<SUB>s</SUB>i<SUB>s</SUB>&nbsp;: ce sont les caract&eacute;ristiques du g&eacute;n&eacute;rateur de Th&eacute;venin de sortie de l'&eacute;tage. Le terme Z<SUB>s</SUB> est le suivant&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS56.GIF"></CENTER><P>R<SUB>E</SUB> , R<SUB>g</SUB> et h<SUB>11e</SUB> &eacute;tant du m&ecirc;me ordre de grandeur, le terme divis&eacute; par (<IMG SRC="../BASE/ICONES/BETA.GIF" align=middle>+1) va &ecirc;tre le plus petit, et R<SUB>E</SUB> va avoir un effet n&eacute;gligeable. On pourra aussi souvent n&eacute;gliger  R<SUB>p</SUB> par rapport &agrave; R<SUB>g</SUB>. Z<SUB>s</SUB> devient&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS57.GIF"></CENTER><P>Cette imp&eacute;dance de sortie est relativement faible&nbsp;: le montage pourra tenir des charges plus faibles que le montage &eacute;metteur commun.<P>On peut faire une remarque similaire a celle qui a &eacute;t&eacute; dite dans le paragraphe sur l'imp&eacute;dance d'entr&eacute;e&nbsp;: vu de la sortie, l'imp&eacute;dance du montage est &eacute;gale &agrave; tout ce qui est en amont de l'&eacute;metteur divis&eacute; par le gain en courant.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T49">Bilan. Utilisation du montage.</A></FONT></H5>Un montage collecteur commun pr&eacute;sente donc les caract&eacute;ristiques suivantes&nbsp;:<P> - <STRONG>gain en tension quasiment &eacute;gal &agrave; l'unit&eacute;</STRONG>.<P> - <STRONG>imp&eacute;dance d'entr&eacute;e &eacute;lev&eacute;e</STRONG>&nbsp;: environ <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle> fois plus grande que celle de l'&eacute;metteur commun si on ne consid&egrave;re pas le pont de base (on verra qu'on peut l'&eacute;viter). La valeur typique est de <STRONG>plusieurs dizaines &agrave; plusieurs centaines</STRONG> de k<IMG SRC="../BASE/ICONES/OHM.GIF"> en fonction du montage.<P> - <STRONG>imp&eacute;dance de sortie faible</STRONG> (divis&eacute;e par <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle> environ par rapport &agrave; l'&eacute;metteur commun). Sa valeur est de l'ordre de <STRONG>quelques dizaines</STRONG> d'<IMG SRC="../BASE/ICONES/OHM.GIF">.<P>Ce montage ne sera donc pas utilis&eacute; pour amplifier un signal, mais comme adaptateur d'imp&eacute;dance, situ&eacute; en amont ou en aval d'un montage &eacute;metteur commun, qui, nous l'avons vu, n'a pas de bonnes caract&eacute;ristiques d'entr&eacute;e / sortie.<P>On pourra donc intercaler un tel montage entre un capteur &agrave; haute imp&eacute;dance de sortie et un montage &eacute;metteur commun sans que celui-ci ne perturbe le capteur.<P>On pourra aussi le mettre en sortie d'un montage &eacute;metteur commun que l'on doit interfacer avec une faible charge, et ceci, sans &eacute;crouler le gain en tension de l'&eacute;tage.<P></UL></OL><P>&nbsp;<LI><H4><A NAME="T50">MONTAGE BASE COMMUNE.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T51">Polarisation. Point de fonctionnement.</A></FONT></H5><CENTER><IMG SRC="TRANS.FIG/TRANS58.GIF"></CENTER><CENTER><P>Fig. 20. Montage base commune.<P></CENTER>Le montage commence &agrave; nous &ecirc;tre familier&nbsp;: en effet, mis &agrave; part l'emplacement du g&eacute;n&eacute;rateur d'attaque et le condensateur de d&eacute;couplage qui est ici situ&eacute; sur la base, le montage est le m&ecirc;me que celui de l'&eacute;metteur commun.<P>La proc&eacute;dure de calculs des &eacute;l&eacute;ments de polarisation est donc identique, car seuls les &eacute;l&eacute;ments li&eacute;s au r&eacute;gime alternatif changent.<P>La raison en est simple&nbsp;: l'amplification est bas&eacute;e sur une augmentation de I<SUB>C</SUB> due &agrave; une augmentation de V<SUB>BE</SUB>. Pour augmenter V<SUB>BE</SUB>, on a le choix entre deux solutions&nbsp;:<P> - soit on augmente la tension de base &agrave; potentiel d'&eacute;metteur constant&nbsp;: c'est le montage &eacute;metteur commun.<P> - soit on abaisse la tension d'&eacute;metteur &agrave; potentiel de base constant&nbsp;: c'est le montage base commune.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T52">Fonctionnement en petits signaux alternatifs.</A></FONT></H5>On va donc &eacute;tudier ici le montage base commune. On voit tout de suite le d&eacute;faut que va pr&eacute;senter ce montage&nbsp;: vu qu'on attaque c&ocirc;t&eacute; &eacute;metteur, il faudra faire varier un courant important, donc, l'imp&eacute;dance d'entr&eacute;e sera s&ucirc;rement beaucoup plus faible que pour l'&eacute;metteur commun, qui n'&eacute;tait d&eacute;j&agrave; pas brillant sur ce point. En fait, ce montage sera peu utilis&eacute;, sauf dans des applications hautes fr&eacute;quences o&ugrave; il trouvera son seul avantage.<P>Le sch&eacute;ma &eacute;quivalent est le suivant&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS59.GIF"></CENTER><CENTER><P>Fig. 21. Sch&eacute;ma &eacute;quivalent base commune.<P></CENTER>Le pont R<SUB>b1</SUB> / R<SUB>b2</SUB> disparait car il est shunt&eacute; en alternatif par le condensateur de d&eacute;couplage C<SUB>DB</SUB>. La base est bien le potentiel commun entr&eacute;e / sortie, et le sch&eacute;ma du transistor est le m&ecirc;me que pour l'&eacute;metteur commun.<P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T53">Fonctionnement  intuitif .</A></FONT></H5>Le fonctionnement intuitif a d&eacute;j&agrave; &eacute;t&eacute; &eacute;bauch&eacute; dans le paragraphe relatif &agrave; la polarisation&nbsp;: il est rigoureusement le m&ecirc;me que pour l'&eacute;metteur commun sauf qu'on attaque l'&eacute;metteur pour imposer les variation V<SUB>BE</SUB>, avec un potentiel de base fixe.<P>On aura juste une diff&eacute;rence de signe provenant du fait que quand on augmente la tension de base &agrave; potentiel d'&eacute;metteur constant, la tension V<SUB>BE</SUB> augmente, et quand on augmente la tension d'&eacute;metteur &agrave; potentiel de base constant, elle diminue&nbsp;: une tension d'entr&eacute;e positive dans les deux cas aura donc des effets contraires.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T54">Gain en tension.</A></FONT></H5>Du sch&eacute;ma Fig. 21., on tire les &eacute;quations suivantes&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS60.GIF"></CENTER><P>D'o&ugrave; l'expression du gain en tension &agrave; vide&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS61.GIF"></CENTER><P>Ce gain (au signe pr&egrave;s) est le m&ecirc;me que pour l'&eacute;metteur commun, ce qui est normal, vu que le fonctionnement est identique.<P>On peut bien entendu faire les m&ecirc;mes remarques que pour l'&eacute;metteur commun et mettre le gain sous la forme donn&eacute;e dans l'&eacute;quation [27], au signe pr&egrave;s.<P>Pour le gain en charge, rien de diff&eacute;rent non plus, R<SUB>ch</SUB> vient se mettre ne parall&egrave;le sur R<SUB>c</SUB> dans la formule du gain &agrave; vide.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T55">Imp&eacute;dance d'entr&eacute;e.</A></FONT></H5>Du circuit d'entr&eacute;e, on tire l'&eacute;quation suivante&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS62.GIF"></CENTER><P>Si on tire i<SUB>b</SUB> de l'&eacute;quation [47] et qu'on le remplace par sa valeur dans [49], on obtient&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS63.GIF"></CENTER><P>On en tire l'imp&eacute;dance d'entr&eacute;e&nbsp;: <P><CENTER><IMG SRC="TRANS.FIG/TRANS64.GIF"></CENTER><P>R<SUB>E</SUB> &eacute;tant du m&ecirc;me ordre de grandeur que h<SUB>11e</SUB>, le terme pr&eacute;pond&eacute;rant est h<SUB>11e</SUB> / (<IMG SRC="../BASE/ICONES/BETA.GIF" align=middle>+1). Cette imp&eacute;dance d'entr&eacute;e est tr&egrave;s faible, environ <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle> fois plus faible que celle de l'&eacute;metteur commun&nbsp;: ce montage, sauf cas tr&egrave;s sp&eacute;cial, est inexploitable tel quel, il faudra un &eacute;tage adaptateur d'imp&eacute;dance en entr&eacute;e pour l'utiliser.<P>On peut remarquer que cette imp&eacute;dance d'entr&eacute;e est quasiment la m&ecirc;me que l'imp&eacute;dance de sortie du montage collecteur commun&nbsp;: si on se rappelle de ce qui a &eacute;t&eacute; dit &agrave; ce propos, l'imp&eacute;dance vue de l'&eacute;metteur est &eacute;gale &agrave; tout ce qui est en amont divis&eacute; par le gain en courant&nbsp;: c'est exactement le cas ici, et on aurait donc pu pr&eacute;voir facilement la valeur de l'imp&eacute;dance d'entr&eacute;e sans calculs.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T56">Imp&eacute;dance de sortie.</A></FONT></H5>Pour &eacute;viter de longs calculs inutiles, on ne tiendra pas compte de la r&eacute;sistance du g&eacute;n&eacute;rateur d'attaque R<SUB>g</SUB>.<P>Du circuit de sortie, on peut tirer l'&eacute;quation suivante&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS65.GIF"></CENTER><P>L'&eacute;quation [47] nous donne i<SUB>b</SUB> en fonction de Ve ; en le rempla&ccedil;ant par sa valeur dans [52], on obtient&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS66.GIF"></CENTER><P>C'est l'&eacute;quation du g&eacute;n&eacute;rateur de Th&eacute;venin de sortie&nbsp;: on en d&eacute;duit que Z<SUB>s</SUB> = R<SUB>c</SUB>.<P>Si on fait le calcul en tenant compte du g&eacute;n&eacute;rateur d'entr&eacute;e, on d&eacute;montre que le r&eacute;sultat reste le m&ecirc;me, seul le terme multiplicatif de e<SUB>g</SUB> va changer dans l'expression de la tension de sortie du g&eacute;n&eacute;rateur de Th&eacute;venin, et le terme multiplicatif de i<SUB>s</SUB> reste R<SUB>c</SUB>.<P>On a donc&nbsp;:<P><CENTER><IMG SRC="TRANS.FIG/TRANS67.GIF"></CENTER><P>On aurait pu pr&eacute;voir ce r&eacute;sultat, car l'entr&eacute;e est s&eacute;par&eacute;e de la sortie par un g&eacute;n&eacute;rateur de courant qui pr&eacute;sente une imp&eacute;dance infinie (en pratique &eacute;gale &agrave; 1/h<SUB>22e</SUB>, qui est tr&egrave;s grand)&nbsp;: du point de vue des imp&eacute;dances, on se retrouve avec l'entr&eacute;e s&eacute;par&eacute;e de la sortie.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T57">Bilan. Utilisation du montage.</A></FONT></H5>Les caract&eacute;ristiques sont donc les suivantes&nbsp;:<P> - <STRONG>m&ecirc;me gain en tension que pour l'&eacute;metteur commun</STRONG> (plusieurs centaines).<P> - <STRONG>imp&eacute;dance d'entr&eacute;e tr&egrave;s faible</STRONG>&nbsp;: quelques dizaines d'<IMG SRC="../BASE/ICONES/OHM.GIF">.<P> - <STRONG>imp&eacute;dance de sortie moyenne</STRONG>&nbsp;: quelques k<IMG SRC="../BASE/ICONES/OHM.GIF">, la m&ecirc;me que pour l'&eacute;metteur commun.<P>En pratique, ce montage sera tr&egrave;s peu utilis&eacute;, sauf en haute fr&eacute;quence o&ugrave; il va pr&eacute;senter une bande passante sup&eacute;rieure &agrave; celle du montage &eacute;metteur commun.<P></UL></OL><P>&nbsp;<LI><H4><A NAME="T58">REMARQUES FONDAMENTALES.</A></H4>Il faudra garder &agrave; l'esprit ces <STRONG>deux remarques fondamentales</STRONG>, qui permettront d'&eacute;valuer grossi&egrave;rement mais sans calculs les imp&eacute;dances des montages &agrave; transistors&nbsp;:<P> - tout ce qui est <STRONG>vu de la base et situ&eacute; en aval de l'&eacute;metteur est multipli&eacute; par le gain en courant</STRONG>.<P> - tout ce qui est <STRONG>vu de l'&eacute;metteur et situ&eacute; en amont de celui-ci est divis&eacute; par le gain en courant</STRONG>.<P>Ces remarques sont fondamentales par le fait qu'on peut &eacute;valuer tr&egrave;s rapidement les potentialit&eacute;s d'un montage sans faire de calculs sur le sch&eacute;ma alternatif petits signaux, qui, on l'a vu, sont particuli&egrave;rement p&eacute;nibles, et ne donnent pas beaucoup plus de pr&eacute;cision que ce que l'on peut d&eacute;terminer tr&egrave;s simplement.<P>Cette fa&ccedil;on d'appr&eacute;hender les choses permet &agrave; l'&eacute;lectronicien de b&acirc;tir un sch&eacute;ma rapidement sans se noyer dans les calculs, et aussi, permettent de mieux comprendre le fonctionnement d'un &eacute;tage &agrave; transistor, autrement que par le biais d'&eacute;quations.<P><P>&nbsp;<LI><H4><A NAME="T59">FONCTIONNEMENT EN HAUTE FR&Eacute;QUENCE</A></H4>Tout ce qui a &eacute;t&eacute; dit jusqu'&agrave; pr&eacute;sent ne concerne que le fonctionnement &agrave; faible fr&eacute;quence (inf&eacute;rieure &agrave; quelques centaines de kHz). Pour des fr&eacute;quences plus &eacute;lev&eacute;es, on utilise un sch&eacute;ma &eacute;quivalent du transistor diff&eacute;rent, rendant mieux compte de ce qui se passe physiquement.<P>Ce mod&egrave;le introduit des capacit&eacute;s parasites, et donc, les param&egrave;tres du transistor deviennent complexes (au sens math&eacute;matique du terme&nbsp;!).<P>Dans ce cours, on se contentera de pr&eacute;senter le sch&eacute;ma &eacute;quivalent en HF, et on exposera le th&eacute;or&egrave;me de Miller, qui est tr&egrave;s important pour la compr&eacute;hension des limitations du transistor en haute fr&eacute;quence.<P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T60">Sch&eacute;ma &eacute;quivalent de Giacoletto.</A></FONT></H5><CENTER><IMG SRC="TRANS.FIG/TRANS68.GIF"></CENTER><CENTER><P>Fig. 22. Sch&eacute;ma de Giacoletto.<P></CENTER>Le sch&eacute;ma ci-dessus pr&eacute;sente en plus des &eacute;l&eacute;ments du montage  basse fr&eacute;quence &nbsp;:<P> - une base B' virtuelle et interne au transistor. L'&eacute;quivalent de h<SUB>11e</SUB> est r<SUB>BB'</SUB> + r<SUB>B'C</SUB>. r<SUB>BB'</SUB> sera faible (moins de 100<IMG SRC="../BASE/ICONES/OHM.GIF"> en g&eacute;n&eacute;ral), inf&eacute;rieure &agrave; r<SUB>B'E</SUB>.<P> - Une capacit&eacute; base-&eacute;metteur C<SUB>B'E</SUB> qui viendra shunter r<SUB>B'E</SUB> en haute fr&eacute;quence. Pour des petits transistors standards (2N2222 par exemple), elle est de l'ordre de 30pF.<P> - Une r&eacute;sistance r<SUB>B'C</SUB> (tr&egrave;s grande, qui sera souvent n&eacute;glig&eacute;e) en parall&egrave;le avec C<SUB>B'C</SUB> qu'on appelle capacit&eacute; Miller, situ&eacute;es entre l'entr&eacute;e et la sortie (pour un montage &eacute;metteur commun) du montage. L'ordre de grandeur pour C<SUB>B'C</SUB> est de 10pF (2N2222). Elle est pr&eacute;pond&eacute;rante dans la limitation en fr&eacute;quence du fonctionnement du transistor.<P> - la r&eacute;sistance r<SUB>CE</SUB> tient la place de 1/h<SUB>22e</SUB>.<P> - le gain en courant est remplac&eacute; par la pente g<SUB>m</SUB> du transistor&nbsp;: elle est &eacute;quivalente au terme 38,5 I<SUB>Co</SUB> qu'on a d&eacute;fini dans le calcul du gain de l'&eacute;metteur commun.<P>Ce sch&eacute;ma est plus d&eacute;licat &agrave; manipuler que celui utilis&eacute; jusqu'&agrave; pr&eacute;sent dans ce cours, donc, on ne l'utilisera que quand ce sera n&eacute;cessaire, soit pour des fr&eacute;quences sup&eacute;rieures &agrave; 100 kHz.<P>Il permet de d&eacute;montrer notamment la sup&eacute;riorit&eacute; du montage base commune par rapport &agrave; l'&eacute;metteur commun en haute fr&eacute;quence, ce qui &eacute;tait infaisable avec le sch&eacute;ma simplifi&eacute;.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T61">Th&eacute;or&egrave;me de Miller.</A></FONT></H5><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T62">D&eacute;finition.</A></FONT></H5>Si on place une imp&eacute;dance entre l'entr&eacute;e et la sortie d'un amplificateur de gain n&eacute;gatif -Av (inverseur, comme l'&eacute;metteur commun), alors, vue de l'entr&eacute;e, cette imp&eacute;dance est multipli&eacute;e par -(Av + 1).<P><CENTER><IMG SRC="TRANS.FIG/TRANS69.GIF"></CENTER><CENTER><P>Fig. 23. Effet Miller.<P></CENTER><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T63">Application au sch&eacute;ma de Giacoletto.</A></FONT></H5>On voit l'application imm&eacute;diate au sch&eacute;ma de Giacoletto&nbsp;: la capacit&eacute; C<SUB>B'C</SUB> situ&eacute;e entre la base et le collecteur du transistor, donc entre l'entr&eacute;e et la sortie d'un montage &eacute;metteur commun sera multipli&eacute;e par le gain de l'&eacute;tage&nbsp;: vue de l'entr&eacute;e, elle vaudra plus d' 1nF&nbsp;!<P>Elle devient alors pr&eacute;pond&eacute;rante devant C<SUB>B'E</SUB> et c'est elle qui va limiter le fonctionnement en HF.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="T64">Autres applications.</A></FONT></H5>Une autre application importante consiste &agrave; utiliser cette propri&eacute;t&eacute; dans la conception de circuits int&eacute;gr&eacute;s. On fabrique des capacit&eacute;s avec deux surfaces m&eacute;tallis&eacute;es en regard et s&eacute;par&eacute;es par de l'isolant. La capacit&eacute; est proportionnelle &agrave; la surface, et en pratique, elle sera tr&egrave;s petite (imp&eacute;ratifs de co&ucirc;ts du silicium, donc des composants).<P>On peut  multiplier  une capacit&eacute; par effet Miller sur ces circuits, et gagner au choix de la surface de silicium ou augmenter la valeur de la capacit&eacute;.<P></UL></OL></OL></OL></BODY></HTML>