<HTML><HEAD><TITLE>PUISS</TITLE></HEAD><BODY><CENTER><IMG SRC="../BASE/ICONES/NAV.GIF"></CENTER><P align=center>Si votre &eacute;cran ne se pr&eacute;sente pas comme ceci, <A HREF="PUISS.HTM" target="_top"> cliquez l&agrave; </A><OL TYPE=I><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="P01">Pr&eacute;ambule</A></H3><P>Les mesures de puissance dans les montages &eacute;lectroniques laissent souvent les gens perplexes ne serait-ce que par le nombre de d&eacute;finitions qui s'y rapportent. L'objet de la premi&egrave;re partie de ce chapitre est de clarifier les choses en donnant quelques d&eacute;finitions simples.<P>Une deuxi&egrave;me partie fournit des &eacute;l&eacute;ments de calcul des radiateurs qu'il faudra fixer sur les semi-conducteurs d&egrave;s lors que la puissance dissip&eacute;e exc&eacute;dera un watt.<P>Les rappels de mesure de puissance seront ici tr&egrave;s utiles&nbsp;: les calculs de radiateurs n&eacute;cessitent de conna&icirc;tre la puissance dissip&eacute;e par l'&eacute;l&eacute;ment &agrave; refroidir, et en pratique, dans un montage &eacute;lectronique, les signaux de courant et tension seront souvent complexes, et on ne pourra pas, pour calculer la puissance, utiliser les formules vues en &eacute;lectricit&eacute; et applicables seulement dans le cas de signaux sinuso&iuml;daux.<P><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="P02">MESURES DE COURANT, TENSION ET PUISSANCE&nbsp;: D&Eacute;FINITIONS.</A></H3><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="P03">VALEURS INSTANTAN&Eacute;ES.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P04">Courant et tension.</A></FONT></H5><P> La valeur instantan&eacute;e d'un courant ou d'une tension, c'est sa valeur &agrave; un instant donn&eacute;. L'ensemble de ces valeurs donnent les fonctions u(t) et i(t), respectivement tension et courant en fonction du temps. Ce sont les courbes que l'on verra affich&eacute;es sur l'oscilloscope (la tension se mesure directement avec l'oscilloscope&nbsp;; pour le courant, on mesure en fait soit la tension aux bornes d'un shunt, soit la tension de sortie d'une sonde de courant).<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P05">Puissance.</A></FONT></H5><P> C'est <STRONG>la</STRONG> d&eacute;finition de la puissance. Toutes les autres en sont d&eacute;riv&eacute;es. C'est le produit de la tension instantan&eacute;e par le courant instantan&eacute;.<P><CENTER><IMG SRC="PUISS.FIG/PUISS01.GIF"></CENTER><P>Pour  des tensions et courants continus, on retrouve bien entendu P = UI.<P>Il faut noter ici que pour des composants autres que des r&eacute;sistances, cette formule est toujours la seule valable, et que dans les composants &eacute;lectroniques dits  actifs , il n'y a pas que la r&eacute;sistance interne qui dissipe de la puissance.<P>Exemple&nbsp;: une diode z&eacute;ner. La tension dissip&eacute;e dans ce composant est &eacute;gale &agrave; V<SUB>z</SUB> I<SUB>z</SUB>, et le terme V<SUB>z</SUB> comprend aussi bien le g&eacute;n&eacute;rateur de tension V<SUB>zo</SUB> que la chute de tension dans la r&eacute;sistance r<SUB>z</SUB>.</OL><P>&nbsp;<LI><H4><A NAME="P06">VALEURS MOYENNES.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P07">Courant et tension.</A></FONT></H5><P> La valeur moyenne d'un signal de courant ou tension est obtenue en faisant la moyenne de toutes les valeurs instantan&eacute;es sur un intervalle de temps [t<SUB>o</SUB>, t<SUB>1</SUB>], soit en int&eacute;grant le signal de tension ou de courant sur l'intervalle consid&eacute;r&eacute; et en le divisant par l'intervalle de temps&nbsp;:<P><CENTER><IMG SRC="PUISS.FIG/PUISS02.GIF"></CENTER><P>La formule est &eacute;videmment la m&ecirc;me pour le courant.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P08">Puissance.</A></FONT></H5><P> La formule [2] est aussi valable pour la puissance en rempla&ccedil;ant u(t) par p(t). Si dans cette formule on remplace p(t) par sa valeur (formule [1]), on a:<P><CENTER><IMG SRC="PUISS.FIG/PUISS03.GIF"></CENTER><P>On voit ici qu'il est absolument hors de question de dire que la puissance moyenne sur un intervalle de temps donn&eacute; est &eacute;gale au produit de la tension moyenne par le courant moyen&nbsp;! C'est justifi&eacute; du point de vue math&eacute;matique par le fait que l'int&eacute;grale d'un produit de 2 fonctions  n'est absolument pas &eacute;gale au produit des int&eacute;grales de ces fonctions.<P>On peut remarquer autre chose&nbsp;: l'int&eacute;grale de la puissance instantan&eacute;e sur un intervalle [t<SUB>o</SUB>, t<SUB>1</SUB>] est en fait l'&eacute;nergie W fournie ou absorb&eacute;e par un composant pendant cet intervalle de temps. La puissance moyenne est donc l'&eacute;nergie fournie ou absorb&eacute;e par le composant divis&eacute;e par la dur&eacute;e de l'intervalle d'&eacute;tude.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P09">Interpr&egrave;tation graphique.</A></FONT></H5>Les formules des valeurs moyennes sont tr&egrave;s simples &agrave; interpr&eacute;ter graphiquement&nbsp;:<P><CENTER><IMG SRC="PUISS.FIG/PUISS04.GIF"></CENTER><CENTER><P>Fig. 1. Tension moyenne sur un intervalle de temps.<P></CENTER>Sur la fig. 1., le sch&eacute;ma de gauche repr&eacute;sente le signal instantan&eacute; de la tension pendant l'intervalle de temps [t<SUB>o</SUB>,&nbsp;t<SUB>1</SUB>]. La valeur moyenne u<SUB>moy</SUB> repr&eacute;sent&eacute;e sur le sch&eacute;ma de droite est telle que les surfaces hachur&eacute;es S<SUB>o</SUB> et S<SUB>1</SUB> soient les m&ecirc;mes. Ces surfaces correspondent math&eacute;matiquement &agrave; l'int&eacute;grale des fonctions sur l'intervalle [t<SUB>o</SUB>, t<SUB>1</SUB>].</OL><P>&nbsp;<LI><H4><A NAME="P10">VALEURS EFFICACES.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P11">Courant et tension.</A></FONT></H5><P> On a vu que pour d&eacute;terminer la puissance induite par une tension alternative quelconque dans une r&eacute;sistance, il faut int&eacute;grer. On ne peut pas utiliser la valeur moyenne de la tension. Les valeurs efficaces ont &eacute;t&eacute; cr&eacute;&eacute;es pour pallier cet inconv&eacute;nient&nbsp;: le carr&eacute; de la tension efficace est proportionnel &agrave; la puissance que cette tension va fournir &agrave; une r&eacute;sistance. Les valeurs efficaces sont donc par d&eacute;finition li&eacute;es &agrave; la notion de puissance.<P>Ainsi, la tension efficace d'un signal alternatif quelconque sera &eacute;gale &agrave; la tension continue qui induirait les m&ecirc;mes effets d'&eacute;chauffement dans une r&eacute;sistance que ce signal alternatif.<P>Pour  une tension alternative quelconque appliqu&eacute;e &agrave; une charge r&eacute;sistive, on a les &eacute;quations&nbsp;:<P><CENTER><IMG SRC="PUISS.FIG/PUISS05.GIF"></CENTER><P>On en d&eacute;duit&nbsp;:<P><CENTER><IMG SRC="PUISS.FIG/PUISS06.GIF"></CENTER><P>La formule donnant la puissance moyenne dans cette r&eacute;sistance est&nbsp;:<P><CENTER><IMG SRC="PUISS.FIG/PUISS07.GIF"></CENTER><P>La tension continue u<SUB>eff</SUB> qui donnerait la m&ecirc;me puissance dans cette r&eacute;sistance est donc&nbsp;:<P><CENTER><IMG SRC="PUISS.FIG/PUISS08.GIF"></CENTER><P>p<SUB>moy</SUB> est alors simplement &eacute;gal &agrave;&nbsp;:<P><CENTER><IMG SRC="PUISS.FIG/PUISS09.GIF"></CENTER><P>On retrouve la formule applicable en r&eacute;gime continu.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P12">Puissance.</A></FONT></H5><P> En fait, <STRONG>la puissance efficace n'existe pas</STRONG>&nbsp;!!! Et c'est de l&agrave; que viennent malheureusement bien des confusions.<P>Cette confusion est entretenue par le fait que certaines sp&eacute;cifications de produits (notamment amplificateurs HIFI) parlent de puissance efficace.<P>En fait, les valeurs efficaces sont relatives aux courants et tensions, et on a vu que par d&eacute;finition, elles donnent la m&ecirc;me puissance qu'une tension continue &eacute;gale&nbsp;: la puissance calcul&eacute;e &agrave; partir d'une tension ou d'un courant efficace est donc une puissance <STRONG>moyenne</STRONG>&nbsp;!</OL><P>&nbsp;<LI><H4><A NAME="P13">VALEURS CR&Ecirc;TES.</A></H4><P> Les valeurs cr&ecirc;tes sont les extremums des signaux sur un intervalle de temps donn&eacute;. Elles ont un int&eacute;r&ecirc;t en &eacute;lectronique (surtout les tensions) car ce sont ces valeurs qui vont d&eacute;terminer le dimensionnement des semi-conducteurs (diodes, transistors ). On a vu en effet que les ph&eacute;nom&egrave;nes de claquage des jonctions se produisaient &agrave; partir de tensions bien d&eacute;termin&eacute;es, et m&ecirc;me si les d&eacute;passements sont de tr&egrave;s courte dur&eacute;e, il peut y avoir destruction rapide des semi-conducteurs expos&eacute;s &agrave; ces surtensions.<P>Dans tout montage, on surveillera donc les tensions cr&ecirc;tes appliqu&eacute;es aux semi-conducteurs, surtout dans les montages o&ugrave; on commute des &eacute;l&eacute;ments &agrave; composante inductive (relais, selfs, haut-parleurs ).<P>Pour ce qui est des puissances, les valeurs cr&ecirc;tes ont moins d'importance, car le composant a une <A HREF="#P23">inertie thermique</A> qui permet d'absorber ces pointes sans trop de dommages&nbsp;: on pourra ainsi mesurer des puissances cr&ecirc;tes tr&egrave;s &eacute;lev&eacute;es pendant des temps tr&egrave;s courts sans que le composant ne chauffe, car dans ce cas, c'est la puissance moyenne qui compte. Il y a quand m&ecirc;me une limite &agrave; cela, et en g&eacute;n&eacute;ral, pour les composants de puissance (transistors, diodes ), le fabricant fournit des abaques qui donnent la puissance cr&ecirc;te &agrave; ne pas d&eacute;passer en fonction du temps d'application et de la fr&eacute;quence de r&eacute;p&eacute;tition des pulses de puissance.<P>Il convient de noter que les puissances maximums ne seront probablement pas enregistr&eacute;es aux m&ecirc;mes endroits que les courants et / ou tensions maxi&nbsp;: en effet, les cr&ecirc;tes de puissance sont obtenues quand on a simultan&eacute;ment un fort courant <STRONG>et</STRONG> une forte tension, et l'exp&eacute;rience montre que habituellement, les maxis de tension sont observ&eacute;s &agrave; faible courant et vice versa.<P>Il ne suffira donc pas en g&eacute;n&eacute;ral de localiser les pics de courant et de tension pour avoir ceux de puissance.<P>&nbsp;<LI><H4><A NAME="P14">EN PRATIQUE </A></H4><P> Comment mesurer toutes ces grandeurs en pratique dans un laboratoire&nbsp;?<P>La plupart des multim&egrave;tres num&eacute;riques sont dot&eacute;s de convertisseurs qui int&egrave;grent les signaux pendant un temps donn&eacute;&nbsp;: par construction, ils donnent comme indication les valeurs moyennes des tensions et courants mesur&eacute;s. (les galvanom&egrave;tres magn&eacute;to-&eacute;lectriques &agrave; cadre mobile aussi, mais on ne les voit plus beaucoup dans l'industrie )<P>Il faudra se m&eacute;fier de certains multim&egrave;tres  de comp&eacute;tition , tr&egrave;s rapides et destin&eacute;s &agrave; &ecirc;tre branch&eacute;s sur des ordinateurs par liaison IEEE ou GPIB (ou autre ) et qui donnent la valeur instantan&eacute;e du signal (soit la valeur &agrave; l'instant pr&eacute;cis de la mesure). Il faut alors bien ma&icirc;triser le point o&ugrave; se fera la mesure (trigger). Il n'est plus ici question de valeur moyenne.<P>Dans tous les cas, trois r&egrave;gles d'or&nbsp;:<P> -  essayer  la mesure avec un signal connu (g&eacute;n&eacute;rateur basse fr&eacute;quence).<P> -  dans le doute, abstiens toi . Mieux vaut pas de mesure qu'une mesure compl&egrave;tement fausse.<P> - lire la documentation du mat&eacute;riel (eh oui&nbsp;!).<P>On l'a vu, les oscilloscopes donnent les valeurs instantan&eacute;es des courants (via un shunt ou une sonde) et tensions. Pour ce qui est de la puissance, les oscilloscopes num&eacute;riques actuels (except&eacute; les mod&egrave;les d'entr&eacute;e de gamme, mais l'&eacute;volution est rapide dans ce domaine) sont capables de faire le produit des signaux issus de deux voies diff&eacute;rentes&nbsp;: en mettant la tension sur la voie A et le courant sur la voie B, on peut obtenir la puissance instantan&eacute;e en temps r&eacute;el sur l'&eacute;cran de l'oscilloscope.<P>Pour ce qui est des valeurs moyennes, ces oscilloscopes num&eacute;riques disposent en g&eacute;n&eacute;ral de fonctions donnant l'aire d'un signal (l'int&eacute;grale)&nbsp;: on a donc acc&egrave;s aux valeurs moyennes des signaux par ce biais (il faudra faire tr&egrave;s attention au calage du z&eacute;ro des courbes&nbsp;!). La mesure &agrave; l'oscilloscope de valeurs moyennes peut &ecirc;tre rendue obligatoire pour des signaux rapides (les multim&egrave;tre ont des bandes passantes souvent faibles&nbsp;: relire la documentation si ce n'est d&eacute;j&agrave; fait&nbsp;!) ou tr&egrave;s complexes&nbsp;: dans ce cas, il est pr&eacute;f&eacute;rable de  voir  ce qu'on fait. On pourra aussi corr&eacute;ler les mesures oscilloscope et multim&egrave;tre&nbsp;: si elles sont &eacute;gales, on pr&eacute;f&eacute;rera le multim&egrave;tre, plus pr&eacute;cis, tout en surveillant les op&eacute;rations sur l'&eacute;cran de l'oscilloscope.<P>Pour ce qui est des valeurs efficaces, &agrave; de rares exceptions pr&egrave;s, on ne les utilisera pas en &eacute;lectronique. Ces notions sont beaucoup plus utiles en &eacute;lectrotechnique, et encore, car l'av&egrave;nement des composants &eacute;lectroniques de puissance dans ce domaine et leurs applications (hacheurs, onduleurs et convertisseurs divers ) ont fait appara&icirc;tre bien d'autres contraintes dans les mesures (entre autres les ph&eacute;nom&egrave;nes transitoires sur des composants selfiques, o&ugrave; les d&eacute;phasages courant/tension ne sont pas aussi simples qu'en r&eacute;gime &eacute;tabli).<P>On se souviendra seulement que ces valeurs efficaces sont un <STRONG>artifice de mesure donnant simplement la puissance</STRONG> (moyenne&nbsp;!) sans faire de calculs, <STRONG>mais dans des conditions de mesure bien particuli&egrave;res, souvent inapplicables en &eacute;lectronique</STRONG> et qu'elles &eacute;taient initialement li&eacute;es &agrave; du mat&eacute;riel de mesure sp&eacute;cifique (galvanom&egrave;tre ferromagn&eacute;tique).</OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="P15">DISSIPATION THERMIQUE DANS LES COMPOSANTS.</A></H3><P> Dans un transistor, l'essentiel de la chaleur produite l'est dans la jonction collecteur-base. Si cette jonction &eacute;tait isol&eacute;e thermiquement, sa temp&eacute;rature deviendrait vite tr&egrave;s &eacute;lev&eacute;e.<P>La temp&eacute;rature maxi de jonction pour le silicium est d'environ 175&#176;C. Au del&agrave;, le semi-conducteur dop&eacute; retrouve quasiment un comportement de semi-conducteur intrins&egrave;que, car l'&eacute;l&eacute;vation de temp&eacute;rature augmente beaucoup le nombre de porteurs minoritaires (cr&eacute;ation de paires &eacute;lectrons-trous par agitation thermique).<P>On &eacute;vitera de toutes fa&ccedil;ons de travailler &agrave; des temp&eacute;ratures &eacute;lev&eacute;es, car la fiabilit&eacute; d'un composant &eacute;lectronique d&eacute;cro&icirc;t tr&egrave;s vite quand la temp&eacute;rature augmente.<P>On est donc oblig&eacute;s d'&eacute;vacuer les calories produites dans les jonctions des semi-conducteurs, en fixant ceux-ci sur des radiateurs.<P>Cette &eacute;vacuation va se faire par les trois &eacute;changes thermiques fondamentaux&nbsp;:<P> - par <STRONG>conduction</STRONG> d'abord&nbsp;: les calories produites &agrave; la jonction du silicium vont se propager &agrave; la surface ext&eacute;rieure du bo&icirc;tier du composant, puis du radiateur, &eacute;ventuellement au travers d'un &eacute;l&eacute;ment isolant (mica ou isolation du bo&icirc;tier du composant en &eacute;poxy).<P> - par <STRONG>convexion</STRONG> ensuite&nbsp;: l'air chauff&eacute; au contact du radiateur s'&eacute;l&egrave;ve et laisse la place &agrave; de l'air plus frais&nbsp;; il y a une circulation naturelle de l'air autour du radiateur (attention &agrave; ne pas entraver cette libre circulation&nbsp;: les radiateurs doivent &ecirc;tre bien d&eacute;gag&eacute;s pour remplir leur r&ocirc;le efficacement).<P> - et enfin, par <STRONG>rayonnement</STRONG>&nbsp;: l'&eacute;nergie est transmise sous forme d'ondes &eacute;lectromagn&eacute;tiques au milieu ambiant.<OL TYPE=A><P>&nbsp;<LI><H4><A NAME="P16">EN CONTINU&nbsp;: R&Eacute;SISTANCE THERMIQUE.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P17">Loi d'Ohm thermique.</A></FONT></H5><P> L'efficacit&eacute; de ces &eacute;changes thermiques sera fonction du composant, de la fixation composant / radiateur, de la taille du radiateur (la convexion et le rayonnement sont proportionnels &agrave; sa surface), de sa forme et de sa position (convexion plus ou moins efficace), et de sa couleur (le noir mat rayonne plus que toute autre couleur).<P>Il y a n&eacute;anmoins une limite &agrave; la taille du radiateur&nbsp;: au del&agrave; d'une certaine valeur, l'efficacit&eacute; n'augmente plus. C'est d&ucirc; au fait que les calories doivent se propager par conduction sur toute la surface du radiateur, et cette propagation est limit&eacute;e.<P>La dissipation est proportionnelle &agrave; la diff&eacute;rence de temp&eacute;rature qui existe entre le radiateur et le milieu ambiant.<P>On caract&eacute;rise le pouvoir de dissipation d'un montage thermique par l'&eacute;l&eacute;vation de sa temp&eacute;rature par rapport au milieu ambiant et ceci pour une puissance dissip&eacute;e &eacute;gale &agrave; 1W&nbsp;: c'est la r&eacute;sistance thermique de l'&eacute;l&eacute;ment&nbsp;:<P><CENTER><IMG SRC="PUISS.FIG/PUISS10.GIF"></CENTER><P>Cette relation est connue sous le nom de   loi d'Ohm thermique .<P>On consid&egrave;re ici un semi-conducteur mont&eacute; sur un radiateur&nbsp;: ce qui nous int&eacute;resse est l'&eacute;l&eacute;vation de temp&eacute;rature de la jonction par rapport &agrave; la temp&eacute;rature ambiante. Dans la formule [10], on a&nbsp;:<P> - R<SUB>th</SUB> est la r&eacute;sistance thermique jonction-ambiante.<P> - T<SUB>j</SUB> est la temp&eacute;rature de jonction.<P> - T<SUB>a</SUB> est la temp&eacute;rature ambiante.<P> - P est la puissance dissip&eacute;e dans la jonction.<P>L'analogie avec la loi d'Ohm &eacute;lectrique est la suivante&nbsp;: la puissance thermique  circule  comme un courant, et comme le mat&eacute;riau conducteur s'oppose &agrave; cette circulation (r&eacute;sistance thermique, comme la r&eacute;sistance &eacute;lectrique s'oppose au passage du courant), on observe une diff&eacute;rence de temp&eacute;rature entre deux points situ&eacute;s sur le chemin de circulation de la puissance thermique (assimil&eacute; &agrave; la diff&eacute;rence de potentiel &eacute;lectrique).<P>Cette loi est tr&egrave;s utile&nbsp;: quand on connait la <A HREF="#P05">puissance dissip&eacute;e</A> et la r&eacute;sistance thermique totale du montage, de la jonction &agrave; l'air ambiant, on peut calculer l'&eacute;chauffement de la jonction par rapport &agrave; la temp&eacute;rature ambiante, et donc la temp&eacute;rature absolue de la puce. On d&eacute;terminera alors le radiateur pour que celle-ci reste raisonnable de mani&egrave;re &agrave; ne pas d&eacute;truire le composant.<P>On va voir maintenant de quoi est fait l'empilement thermique, et comment d&eacute;terminer pratiquement les valeurs de ses composantes.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P18">Constitution de l'empilement thermique.</A></FONT></H5><P> En pratique, la r&eacute;sistance thermique totale de la jonction &agrave; l'air ambiant comporte plusieurs composantes, d&eacute;taill&eacute;es &agrave; la Fig. 2.<P><CENTER><IMG SRC="PUISS.FIG/PUISS11.GIF"></CENTER><CENTER><P>Fig. 2. Sandwich thermique.<P></CENTER>Le transistor lui m&ecirc;me est constitu&eacute; de&nbsp;:<P> - la puce de silicium.<P> - une plaque de cuivre appel&eacute;e  lead frame  qui supporte la puce, lui garantit une certaine rigidit&eacute; (le silicium est fragile&nbsp;!), et constitue une <A HREF="#P22">capacit&eacute; thermique</A>.<P> - la puce est fix&eacute;e au lead frame qui est reli&eacute; &eacute;lectriquement de ce fait au collecteur.<P> - dans certains cas (et de plus en plus), le lead frame est isol&eacute; de l'ext&eacute;rieur par une couche d'isolant (genre &eacute;poxy) qui enrobe le composant&nbsp;: celui-ci peut &ecirc;tre fix&eacute; directement sur le radiateur sans qu'on ait &agrave; se soucier de l'isolation. Ces composants sont de plus en plus utilis&eacute;s dans l'industrie, car ils &eacute;vitent d'avoir &agrave; rajouter l'isolant dans le processus de fabrication.<P>Quand les composants ne sont pas isol&eacute;s, il faudra intercaler un dispositif d'isolation entre eux et le radiateur, pour des raisons de s&eacute;curit&eacute; d'une part (on ne peut pas laisser un radiateur &agrave; un potentiel de 300V par exemple &agrave; l'air libre&nbsp;!), et de fonctionnement d'autre part&nbsp;: on peut &ecirc;tre amen&eacute;s &agrave; fixer plusieurs transistors non isol&eacute;s sur le m&ecirc;me radiateur&nbsp;; si leurs lead frame (qui sont reli&eacute;s aux collecteurs par construction) sont &agrave; des potentiels diff&eacute;rents, on risque des courts circuits intempestifs, qui seront &eacute;vit&eacute;s par l'isolation.<P>L'isolation classique se fait en intercalant une feuille mince de mica entre le transistor et le radiateur&nbsp;; on compl&egrave;te le montage par un joint de graisse sp&eacute;ciale aux silicones &agrave; bonne conductibilit&eacute; thermique, dans le but d'&eacute;liminer des lamelles d'air (tr&egrave;s mauvais conducteur de chaleur) entre le transistor, le mica et le radiateur.<P>Du point de vue loi d'ohm thermique, ce sandwich est assimilable &agrave; plusieurs r&eacute;sistances mises en s&eacute;rie, comme le montre la Fig. 3.<P><CENTER><IMG SRC="PUISS.FIG/PUISS12.GIF"></CENTER><CENTER><P>Fig. 3. Empilage des r&eacute;sistances thermiques.<P></CENTER>La puce est &agrave; la temp&eacute;rature T<SUB>j</SUB>, et le bo&icirc;tier du transistor &agrave; la temp&eacute;rature T<SUB>b</SUB>. Le transistor a une r&eacute;sistance thermique R<SUB>th</SUB> j-&#62;b qui va d&eacute;terminer son aptitude &agrave; &eacute;vacuer les calories produites dans la jonction. On peut &eacute;crire la loi d'Ohm thermique pour ce composant&nbsp;:<P><CENTER><IMG SRC="PUISS.FIG/PUISS13.GIF"></CENTER><P>Ensuite, on rencontre la fixation / isolation du transistor sur le radiateur&nbsp;: on va la caract&eacute;riser par la r&eacute;sistance thermique bo&icirc;tier / radiateur R<SUB>th</SUB> b-&#62;r&nbsp;:<P><CENTER><IMG SRC="PUISS.FIG/PUISS14.GIF"></CENTER><P>Enfin, il y a la liaison entre le radiateur et l'air ambiant, d&eacute;finie par la r&eacute;sistance thermique du radiateur R<SUB>th</SUB> r-&#62;a&nbsp;:<P><CENTER><IMG SRC="PUISS.FIG/PUISS15.GIF"></CENTER><P>On remarque qu'en additionnant les 3 r&eacute;sistances thermiques, on obtient la r&eacute;sistance thermique totale R<SUB>th</SUB>, et on retombe sur l'&eacute;quation [10].<P>Les fournisseurs de composants d'une part, et de radiateurs d'autre part fournissent des donn&eacute;es permettant de calculer leur r&eacute;sistance thermique.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P19">Caract&eacute;ristiques thermiques des transistors de puissance.</A></FONT></H5><P> En pratique, les constructeurs de transistors (et autre semi-conducteurs de puissance) donnent rarement directement la r&eacute;sistance thermique  des composants.<P>Ils donnent tr&egrave;s souvent la puissance maxi et la temp&eacute;rature de jonction maxi, qu'il faut interpr&eacute;ter en g&eacute;n&eacute;ral comme suit&nbsp;: la puissance maxi est donn&eacute;e pour une temp&eacute;rature de bo&icirc;tier maintenue &agrave; 25&#176;C (radiateur infini, soit avec une r&eacute;sistance thermique R<SUB>th</SUB> r-&#62;a nulle) et une temp&eacute;rature de jonction maximale.<P>Quand on consid&egrave;re l'&eacute;quation [11], on voit que si on augmente la temp&eacute;rature de bo&icirc;tier, pour conserver une temp&eacute;rature de jonction constante, il faut diminuer la puissance dissip&eacute;e par le composant. Cette loi est lin&eacute;aire. On peut alors tracer le graphique de la puissance dissip&eacute;e en fonction de la temp&eacute;rature de bo&icirc;tier, et ceci &agrave; temp&eacute;rature de jonction maxi. On obtient la Fig. 4.<P><CENTER><IMG SRC="PUISS.FIG/PUISS16.GIF"></CENTER><CENTER><P>Fig. 4. Courbe de dissipation maxi du transistor.</CENTER><P>On peut &eacute;crire un cas particulier de l'&eacute;quation [11]&nbsp;:<P><CENTER><IMG SRC="PUISS.FIG/PUISS17.GIF"></CENTER><P>On voit qu'on obtient facilement &agrave; partir des donn&eacute;es du constructeur la r&eacute;sistance thermique du composant.<P>Le graphique Fig. 4. nous enseigne une chose essentielle&nbsp;: <STRONG>plus la temp&eacute;rature du boitier augmente, plus la puissance dissipable par le composant est faible, jusqu'&agrave; devenir nulle quand la temp&eacute;rature du boitier est &eacute;gale &agrave; la temp&eacuterature maxi admissible par la jonction</STRONG>.<P>Une autre chose fondamentale &agrave; se rappeler est que la <STRONG>puissance maxi dissipable l'est pour une temp&eacute;rature de bo&icirc;tier de 25&#176;C</STRONG>, ce qui correspond &agrave; un radiateur infini. <STRONG>Le composant seul, sans radiateur, ne pourra dissiper au mieux que quelques watts</STRONG>&nbsp;!<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P20">&Eacute;l&eacute;ment d'isolation.</A></FONT></H5><P> Si le bo&icirc;tier du transistor est isol&eacute;, il n'y a pas &agrave; s'en pr&eacute;occuper, car c'est pris en compte dans la r&eacute;sistance thermique du composant.<P>Si on met du mica et de la graisse, on prendra R<SUB>th</SUB> b-&#62;r &eacute;gal &agrave; 1&#176;C/W. Il existe des isolants ayant un R<SUB>th</SUB> descendant &agrave; 0,1&#176;C/W&nbsp;: il faudra se reporter &agrave; la notice du fabricant pour v&eacute;rifier cette valeur.<P>Si la plan&eacute;&iuml;t&eacute; du radiateur n'est pas parfaite (t&ocirc;le d'aluminium assez mince par exemple), il faudra tenir compte des &eacute;ventuelles lames d'air, et ne pas prendre un R<SUB>th</SUB> trop faible.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P21">Calcul pratique du radiateur.</A></FONT></H5><P> En pratique, le calcul de la partie thermique d'un montage &eacute;lectronique se fait ainsi&nbsp;:<P> - le composant de puissance est d&eacute;fini par des imp&eacute;ratifs &eacute;lectriques&nbsp;; on d&eacute;termine sa r&eacute;sistance thermique comme indiqu&eacute; au paragraphe pr&eacute;c&eacute;dent en utilisant les donn&eacute;es du fabricant.<P> - on d&eacute;termine la puissance moyenne dissip&eacute;e par le composant de puissance par mesures et calculs.<P> - on fait des hypoth&egrave;ses sur la temp&eacute;rature ambiante maxi o&ugrave; sera situ&eacute; le montage.<P> - on se fixe une temp&eacute;rature de jonction maxi en accord avec les imp&eacute;ratifs de fiabilit&eacute; donn&eacute;s dans le cahier des charges. En pratique, et sauf utilisation extr&ecirc;me de composants sp&eacute;ciaux, cette temp&eacute;rature sera bien en de&ccedil;&agrave; de la temp&eacute;rature maxi de jonction admissible (entre 60 et 100&#176;C environ).<P>Il ne reste donc que la r&eacute;sistance thermique du radiateur &agrave; d&eacute;terminer de mani&egrave;re &agrave; ne pas d&eacute;passer la temp&eacute;rature de jonction maxi qu'on s'est fix&eacute;e.<P>Si on additionne membre &agrave; membre les &eacute;quations [11], [12] et [13], on obtient&nbsp;:<P><CENTER><IMG SRC="PUISS.FIG/PUISS18.GIF"></CENTER><P>On en d&eacute;duit facilement la r&eacute;sistance thermique radiateur / ambiant qui nous permettra de choisir le bon radiateur dans un catalogue&nbsp;:<P><CENTER><IMG SRC="PUISS.FIG/PUISS19.GIF"></CENTER><P>Dans le cas o&ugrave; le radiateur serait trop volumineux, ou pire, que le R<SUB>th</SUB> r-&#62;a obtenu ne corresponde &agrave; aucun radiateur du catalogue, il faut passer &agrave; des solutions plus sophistiqu&eacute;es, &agrave; savoir convexion forc&eacute;e par ventilateur (le R<SUB>th</SUB> r-&#62;a diminue alors consid&eacute;rablement), ou dans les cas extr&ecirc;mes, &agrave; un refroidissement par circulation de liquide dans le support du composant de puissance.</OL><P>&nbsp;<LI><H4><A NAME="P22">EN TRANSITOIRE&nbsp;: CAPACIT&Eacute; THERMIQUE.</A></H4><P> Tous les calculs faits pr&eacute;c&eacute;demment sont relatifs au r&eacute;gime &eacute;tabli, qui correspond en th&eacute;orie &agrave; un temps de stabilisation infini (en pratique, les temps de stabilisation de temp&eacute;rature des radiateurs peuvent &ecirc;tre &eacute;lev&eacute;s (plus d'une heure), surtout si les radiateurs sont gros&nbsp;: il faudra en tenir compte si on est amen&eacute; &agrave; faire des mesures de temp&eacute;rature sur des composants de puissance).<P>En pratique, il est rare qu'un bo&icirc;tier &eacute;lectronique ait &agrave; dissiper en permanence la puissance maxi. Il y aura des pointes de puissance pendant des dur&eacute;es limit&eacute;es suivies de moments de repos relatif, o&ugrave; la puissance dissip&eacute;e sera beaucoup plus faible.<P>Dans ce cas, afin de ne pas surdimensionner les &eacute;l&eacute;ments de refroidissement (qui prennent beaucoup de place en comparaison des circuits &eacute;lectroniques, de plus en plus miniaturis&eacute;s), il faudra tenir compte du fait que les composantes thermiques ne prennent pas instantan&eacute;ment la temp&eacute;rature maxi.<P>Ceci provient du fait que le composant a une capacit&eacute; thermique, qui est en fait sa capacit&eacute; calorifique&nbsp;:<P><CENTER><IMG SRC="PUISS.FIG/PUISS20.GIF"></CENTER><P>m est la masse du composant (ou du radiateur), et C sa chaleur sp&eacute;cifique. Le produit mC repr&eacute;sente la capacit&eacute; calorifique du composant.<P>Cette capacit&eacute; est caract&eacute;ris&eacute;e par l'augmentation de temp&eacute;rature T<SUB>2</SUB> - T<SUB>1</SUB> du composant quand on lui fournit adiabatiquement une quantit&eacute; d'&eacute;nergie Q.<P>Plus la capacit&eacute; thermique (ou calorifique) du composant est &eacute;lev&eacute;e, plus la quantit&eacute; d'&eacute;nergie &agrave; fournir pour augmenter sa temp&eacute;rature est &eacute;lev&eacute;e.<P>On peut remarquer dans l'&eacute;quation [17] le sens du terme  capacit&eacute; , et l'analogie avec la loi d'Ohm thermique. La quantit&eacute; d'&eacute;nergie Q, int&eacute;grale de la puissance dissip&eacute;e est l'&eacute;quivalent thermique d'une quantit&eacute; d'&eacute;lectricit&eacute;, qui est l'int&eacute;grale d'un courant &eacute;lectrique.<P>En &eacute;lectricit&eacute;, on a la relation Q = C (V<SUB>2</SUB> - V<SUB>1</SUB>)&nbsp;: si on remplace la diff&eacute;rence de potentiel par la diff&eacute;rence de temp&eacute;rature, la capacit&eacute; &eacute;lectrique par la capacit&eacute; thermique, et la quantit&eacute; d'&eacute;lectricit&eacute; par la quantit&eacute; d'&eacute;nergie, on retombe sur la formule [17] de la capacit&eacute; thermique. Cette formule d&eacute;di&eacute;e au r&eacute;gime transitoire compl&egrave;te donc la loi d'Ohm thermique classique du r&eacute;gime continu.<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P23">R&ocirc;le du lead frame.</A></FONT></H5><P> En pratique, le lead frame va servir de capacit&eacute; thermique, et va permettre &agrave; la puce d'encaisser des puissances instantan&eacute;es bien sup&eacute;rieures &agrave; ce que le calcul de r&eacute;sistance thermique donnerait.<P>Pour un gros transistor de puissance, on a une capacit&eacute; thermique de l'ordre de 1 &agrave; 3 J/K.<P>Si un tel transistor dissipe 200W pendant 100&#181;s, l'&eacute;nergie qu'il devra absorber sera de seulement 20mJ&nbsp;: l'&eacute;chauffement correspondant sera d&eacute;risoire (0,02&#176;C)&nbsp;!<P>Ce pulse d'&eacute;nergie peut &ecirc;tre support&eacute; par le transistor nu, c'est &agrave; dire non muni de radiateur. Par contre, il est hors de question de faire dissiper en continu une telle puissance &agrave; un transistor qui ne serait pas muni d'un radiateur &agrave; circulation de liquide&nbsp;!<P>On voit tout l'int&eacute;r&ecirc;t de la notion de capacit&eacute; thermique dans le cas o&ugrave; le transistor aurait &agrave; dissiper des fortes puissances pendant des temps tr&egrave;s brefs. Il serait absurde d'utiliser dans ce cas les calculs de r&eacute;sistance thermique.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P24">Puissance maxi.</A></FONT></H5><P> Ce processus a une limite&nbsp;: il ne faut pas perdre de vue que le param&egrave;tre critique est la temp&eacute;rature de jonction, et que la liaison silicium / lead frame (soudure) a une r&eacute;sistance thermique non nulle (environ 0,5&#176;C/W)&nbsp;: il faudra veiller &agrave; ce que le produit de cette r&eacute;sistance thermique par la puissance instantan&eacute;e (&eacute;chauffement) ajout&eacute; &agrave; la temp&eacute;rature du lead frame ne d&eacute;passe pas le maximum de la temp&eacute;rature de puce autoris&eacute; par le constructeur.<P>Pour des pulses d'&eacute;nergie tr&egrave;s courtes, la puce elle m&ecirc;me a une capacit&eacute; thermique non nulle, mais il faut faire attention aux transistors bipolaires&nbsp;: l'application d'une forte puissance instantan&eacute;e cr&eacute;&eacute; des points chauds localis&eacute;s &agrave; la surface de la puce qui vont drainer de plus en plus de courant, ce qui va entra&icirc;ner un effet d'emballement local et aboutir &agrave; la destruction de la puce (ph&eacute;nom&egrave;ne de second claquage).<P>Ce ph&eacute;nom&egrave;ne est complexe, et si on doit utiliser des transistors  &agrave; la limite , on se reportera aux ouvrages ad&eacute;quats avant toute manipulation (qui pourrait dans ce cas co&ucirc;ter fort cher&nbsp;!).<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="P25">G&eacute;n&eacute;ralisation</A></FONT></H5><P> Le processus d&eacute;crit pr&eacute;c&eacute;demment l'a &eacute;t&eacute; pour le transistor seul. On peut g&eacute;n&eacute;raliser &agrave; tout l'empilement thermique. Cet empilement serait alors une succession de r&eacute;sistances et de capacit&eacute;s thermiques&nbsp;:<P><CENTER><IMG SRC="PUISS.FIG/PUISS21.GIF"></CENTER><CENTER><P>Fig. 5. Sch&eacute;ma thermique &eacute;quivalent.<P></CENTER>On parle alors dans ce cas d'imp&eacute;dance thermique, et l'analogie avec l'&eacute;lectricit&eacute; est imm&eacute;diate. La Fig.&nbsp;5. donne tous les &eacute;l&eacute;ments du sch&eacute;ma &eacute;quivalent que l'on traite avec les &eacute;quations et le formalisme de l'&eacute;lectricit&eacute;.<P>On notera les deux composants qui forment le d&eacute;but et la fin du sch&eacute;ma&nbsp;: l'&eacute;nergie &eacute;lectrique est sch&eacute;matis&eacute;e par un g&eacute;n&eacute;rateur de courant, et l'air ambiant comme une source de temp&eacute;rature. Cette derni&egrave;re approximation est fausse si le montage est confin&eacute; dans un bo&icirc;tier mal a&eacute;r&eacute; ou si la convection est forc&eacute;e (ventilateur).<P>Dans tous les cas, une bonne exp&eacute;rimentation est n&eacute;cessaire apr&egrave;s les calculs et simulations pour v&eacute;rifier le bien fond&eacute; des hypoth&egrave;ses et la validit&eacute; du mod&egrave;le.</OL></OL></OL></BODY></HTML>