<HTML><HEAD><TITLE>JACKY PC AVEC MIC502</TITLE></HEAD><BODY BGCOLOR="#FFFFFF"><H2><CENTER><B>Contr&ocirc;le de ventilateur &agrave; MIC 502 etthermistance</B></CENTER></H2><P><CENTER><B><HR></B></CENTER><TABLE width=100% border="0"><TR>  <TD width=50%> <P><H2>Sommaire</H2>  <TD width=50%><P><H2>T&eacute;l&eacute;chargement</H2><TR>  <TD width=50%><P><A HREF="#1">A quoi sert ce montage&nbsp;?</A><P><A HREF="#2">Fonctionnement d'une thermistance</A><P><A HREF="#3">Le MIC 502</A><P><A HREF="#4">Montage &agrave; plage de temp&eacute;rature r&eacute;duite</A><P><A HREF="#5">R&eacute;glages et mise au point</A><P><A HREF="#6">Caract&eacute;risation d'une thermistance</A><P><A HREF="#7">En pratique...</A> </TD> <TD  width=50%> <P><A HREF=../../TELECH/EXOS/MIC_XLS.ZIP>Fichier excel</A> <P><A HREF=../../TELECH/EXOS/TYPON.ZIP>Typon (format TIFF)</A> <P><A HREF=../../TELECH/EXOS/IMPLANT.ZIP>Implantation (format TIFF)</A> <P>&nbsp;<P>&nbsp;<P>&nbsp;<P>&nbsp;  </TD></TR></TABLE><P ALIGN=RIGHT><A HREF="../../BASE/EXOS.HTM"><IMG SRC="../../BASE/ICONES/NICHE.GIF"WIDTH=102 HEIGHT=81 ALIGN=bottom></A><P><CENTER><B><HR></B></CENTER><H2><B>Intro</B></H2><P>Du JackyPC, &agrave; mon &acirc;ge, moi qui d&eacute;teste lePC...<P>En fait, vous devez ce montage &agrave; la t&eacute;nacit&eacute;de Michel Catita, qui a pioch&eacute; sur des sites "concurrents" desmontages sans explications, et qui est venu me demander : "s'il teplait, dessine moi un contr&ocirc;le de ventilateur &agrave; MIC502".Certes, c'est moins po&eacute;tique qu'un mouton, mais bon, on feraavec !!!<P>Finalement, il y a des choses int&eacute;ressantes dans cemontage, notamment la partie thermistance, qui peut int&eacute;resserpas mal de monde faisant des mesures de temp&eacute;rature. La partiepermettant de retrouver l'&eacute;quation de cette thermistance&agrave; l'aide de quelques mesures et une r&eacute;gressionlin&eacute;aire est &agrave; ce titre digne d'int&eacute;r&ecirc;t.<P><B>&nbsp;</B><H2><B><A NAME="1">A quoi sert ce montage&nbsp;?</A></B></H2><P>On se propose de fabriquer un montage b&acirc;ti autour du circuit Micrel MIC502 et destin&eacute; &agrave; r&eacute;guler la vitesse d'un ventilateur de PC en fonction de la temp&eacute;rature de mani&egrave;re &agrave; limiter le bruit de celui-ci lorsque la temp&eacute;rature n'est pas trop &eacute;lev&eacute;e.<P>La spec du MIC502 contient un sch&eacute;ma d'application ainsi que tous les calculs des composants&nbsp;: on s'y reportera avant toute chose (en anglais uniquement&#133;).<P>Toutefois, ce montage est valable pour une plage de temp&eacute;rature de 20 &agrave; 70&#176;C : si on veut r&eacute;duire cette plage et avoir la pleine efficacit&eacute; du ventilateur &agrave; temp&eacute;rature plus basse (40&#176;C par exemple), il faut modifier le montage de base. C'est ce qui est propos&eacute; ici.<P>On va aussi enrichir tout ceci avec les &eacute;quations de base de la thermistance, afin que chacun ait les infos n&eacute;cessaires pour adapter son montage &agrave; ses composants et &agrave; ses besoins.<P><B>&nbsp;</B><H2><B><A NAME="2">Fonctionnement d'une thermistance</A></B></H2><P>Une thermistance CTN est un composant sensible &agrave; la temp&eacute;rature : c'est basiquement une r&eacute;sistance &eacute;lectrique dont la valeur diminue avec la temp&eacute;rature (CTN = Coefficient de Temp&eacute;rature N&eacute;gatif).<P>La valeur de la r&eacute;sistance en fonction de la temp&eacute;rature r&eacute;pond &agrave; l'&eacute;quation suivante&nbsp;:<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC01.GIF"><UL><LI type=disc>t<FONT SIZE=1><SUB>o</SUB></FONT> est la temp&eacute;rature de r&eacute;f&eacute;rence (souvent 25&#176;C) pour laquelle on donne la valeur nominale de la r&eacute;sistance R(t<FONT SIZE=1><SUB>o</SUB></FONT>)<LI type=disc>&laquo;&nbsp;a&nbsp;&raquo; est un coefficient propre &agrave; la CTN (de l'ordre de 4000K). Normalement, &laquo;&nbsp;a&nbsp;&raquo; varie avec la temp&eacute;rature, mais ici, on le consid&egrave;rera constant (l'erreur est minime car la plage de temp&eacute;rature utile est faible).<LI type=disc>&laquo;&nbsp;t&nbsp;&raquo; est la temp&eacute;rature exprim&eacute;e en degr&eacute;s celcius.</UL><P>Si on prend l'exemple d'une thermistance ayant une valeur de 10k<IMG SRC="../../BASE/ICONES/OHM.GIF"> &agrave; 25&#176;C et a=3740, on obtient la courbe de la r&eacute;sistance fonction de la temp&eacute;rature suivante&nbsp;:<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC02.GIF"><P align=center><B>Figure 1</B><P>Pour obtenir une tension sensiblement proportionnelle &agrave; la temp&eacute;rature avec ce composant, on place la thermistance dans un montage &agrave; pont diviseur&nbsp;:<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC03.GIF"><P align=center><B>Figure 2</B><P>La tension V<FONT SIZE=1><SUB>s</SUB></FONT> est de la forme&nbsp;:<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC04.GIF"><P>Si on prend la thermistance pr&eacute;c&eacute;dente et qu'on la monte en pont avec une r&eacute;sistance R<FONT SIZE=1><SUB>1</SUB></FONT> de 3.3k<IMG SRC="../../BASE/ICONES/OHM.GIF"> (soit environ le 1/3 de la valeur nominale &agrave; 25&#176;C de la thermistance), le rapport V<FONT SIZE=1><SUB>s</SUB></FONT>/E en fonction de la temp&eacute;rature est de la forme&nbsp;:<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC05.GIF"><P align=center><B>Figure 3</B><P>La tension est presque proportionnelle &agrave; la temp&eacute;rature, et sur la plage de temp&eacute;rature 20-70&#176;, on voit que le rapport du pont diviseur est compris entre 21% et 63%.<P>On peut aussi mettre une r&eacute;sistance en parall&egrave;le sur la thermistance pour am&eacute;liorer l&eacute;g&egrave;rement la lin&eacute;arit&eacute; et d&eacute;placer les valeurs du rapport vers le haut. C'est le montage utilis&eacute; dans la specification du MIC502.<P><B>&nbsp;</B><H2><B><A NAME="3">Le MIC502</A></B></H2><P>Ce composant fabriqu&eacute; par Micrel (Californie) est destin&eacute; &agrave; &ecirc;tre interfac&eacute; avec une thermistance de mesure de temp&eacute;rature d'une part, et le ventilateur d'un PC d'autre part (via un transistor de puissance).<P>Il contient des fonctions de mise en sommeil, d'alarme de d&eacute;passement de temp&eacute;rature, peut &ecirc;tre pilot&eacute; par deux thermistance&#133; Nous ne nous attarderons pas sur ces fonctions annexes&nbsp;: on va juste voir la fonction de base qui est de transformer la temp&eacute;rature (en fait la tension issue d'une thermistance mont&eacute;e en pont) en tension &agrave; appliquer sur le ventilateur.<P>Le fonctionnement est tr&egrave;s simple : sur l'entr&eacute;e du circuit (broche 1), on applique une tension qui commande le rapport cyclique d'un PWM (modulateur de largeur d'impulsion). En sortie, on obtient alors une tension hach&eacute;e dont la valeur moyenne va &ecirc;tre proportionnelle &agrave; la tension appliqu&eacute;e sur l'entr&eacute;e du circuit.<P>En fait, la valeur moyenne de la tension de sortie va varier de 0 &agrave; 100% de la valeur de l'alimentation du montage pour une tension d'entr&eacute;e variant de 30 &agrave; 70% de la tension d'alimentation.<P>On voit tout de suite le rapprochement de ce fonctionnement avec la tension de sortie du pont diviseur form&eacute; par la thermistance et une r&eacute;sistance (voir figure 2)&nbsp;: en mettant un tel pont sur l'entr&eacute;e du MIC502, on va faire varier sa valeur de 30 &agrave; 70% pour une variation de temp&eacute;rature comprise entre 30 et plus de 80&#176;C, et en sortie, on obtiendra une tension moyenne comprise entre 0 et 100% de la valeur maxi sur le ventilateur. Le probl&egrave;me de ce circuit vient de ces valeurs&nbsp;; la plage de temp&eacute;rature est trop &eacute;tendue. On ne peut pas modifier les choses en rajoutant des potentiom&egrave;tres et r&eacute;sistances partout comme on le voit sur certains sites web. La solution consiste &agrave; amplifier la tension du pont thermistance/r&eacute;sistance avant de l'envoyer sur l'entr&eacute;e du MIC502. On pourra alors choisir une plage de temp&eacute;rature plus r&eacute;duite et mieux adapt&eacute;e &agrave; ses besoins.<P><B>&nbsp;</B><H2><B><A NAME="4">Montage &agrave; plage de temp&eacute;rature r&eacute;duite</A></B></H2><OL><P><B>&nbsp;</B><LI TYPE="1"><B><U>Sch&eacute;ma de la partie thermistance / ampli</U></B><P>Le sch&eacute;ma suivant va &ecirc;tre utilis&eacute;&nbsp;: il est simple &agrave; calculer et &agrave; mettre en &#156;uvre, et convient parfaitement &agrave; la fonction d&eacute;sir&eacute;e.<P>Il s'agit d'un ampli inverseur qui va amplifier la diff&eacute;rence de tension (V<FONT SIZE=1><SUB>e1</SUB></FONT>-V<FONT SIZE=1><SUB>e2</SUB></FONT>) . Le couple de r&eacute;sistances R4 / R5 va fixer le gain (donc la plage de temp&eacute;rature de fonctionnement du ventilateur), et R2 / R3 vont permettre le r&eacute;glage de l'offset (la temp&eacute;rature d'enclenchement du ventilateur).<P>On aurait pu mettre un potentiom&egrave;tre pour le r&eacute;glage de l'offset&nbsp;: afin d'&eacute;viter erreurs et t&acirc;tonnements, ces deux r&eacute;sistances sont fixes et vont &ecirc;tre calcul&eacute;es &agrave; l'aide de la <A HREF="MIC_XLS.ZIP">feuille excel</A> ci-jointe.<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC06.GIF"><P align=center><B>Figure 4</B><P><B>&nbsp;</B><LI TYPE="1"><B><U>Calcul du gain de l'ampli</U></B><P>La figure 3 nous donne la tension (en valeur relative par rapport &agrave; E) de sortie du pont R<FONT SIZE=1><SUB>th</SUB></FONT> / R<FONT SIZE=1><SUB>1</SUB></FONT> en fonction de la temp&eacute;rature.<P>L'&eacute;quation globale du montage amplificateur est&nbsp;:<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC07.GIF"><P>avec&nbsp;:<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC08.GIF"> <P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC09.GIF"><P>On va d&eacute;finir quelques variables cl&eacute;&nbsp;:<UL><LI type=disc>t<FONT SIZE=1><SUB>1</SUB></FONT>&nbsp;: temp&eacute;rature d&eacute;sir&eacute;e d'enclenchement du ventilateur<LI type=disc>t<FONT SIZE=1><SUB>2</SUB></FONT>&nbsp;: temp&eacute;rature &agrave; partir de laquelle le ventilateur est &agrave; fond<LI type=disc>Vp<FONT SIZE=1><SUB>1</SUB></FONT>&nbsp;: tension de pont R<FONT SIZE=1><SUB>th</SUB></FONT> / R<FONT SIZE=1><SUB>1</SUB></FONT> &agrave; t<FONT SIZE=1><SUB>1</SUB></FONT><LI type=disc>Vp<FONT SIZE=1><SUB>2</SUB></FONT>&nbsp;: tension de pont R<FONT SIZE=1><SUB>th</SUB></FONT> / R<FONT SIZE=1><SUB>1</SUB></FONT> &agrave; t<FONT SIZE=1><SUB>2</SUB></FONT><LI type=disc>V<FONT SIZE=1><SUB>mic1</SUB></FONT>&nbsp;: tension de d&eacute;marrage de ventilateur du MIC 502 (normalement 30%)<LI type=disc>V<FONT SIZE=1><SUB>mic2</SUB></FONT>&nbsp;: tension de ventilateur &agrave; fond du MIC 502 (normalement 70%)</UL><P>Le gain de l'ampli est  (1+R<FONT SIZE=1><SUB>5</SUB></FONT>/R<FONT SIZE=1><SUB>4</SUB></FONT>) . On va le d&eacute;terminer en fonction de la plage de temp&eacute;rature (t<FONT SIZE=1><SUB>2-</SUB></FONT>t<FONT SIZE=1><SUB>1</SUB></FONT>) choisie et des seuils du MIC 502 (V<FONT SIZE=1><SUB>mic1 </SUB></FONT>=30&plusmn;3% et V<FONT SIZE=1><SUB>mic2 </SUB></FONT>=70&plusmn;3%).<P>Le gain n&eacute;cessaire est&nbsp;:<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC10.GIF"><P>En pratique, on va fixer R<FONT SIZE=1><SUB>4</SUB></FONT> &agrave; une valeur suffisament &eacute;lev&eacute;e (grande devant R<FONT SIZE=1><SUB>2</SUB></FONT>//R<FONT SIZE=1><SUB>3</SUB></FONT>), car si on veut &ecirc;tre rigoureux, l'imp&eacute;dance R<FONT SIZE=1><SUB>2</SUB></FONT>//R<FONT SIZE=1><SUB>3</SUB></FONT> doit &ecirc;tre rajout&eacute;e &agrave; R<FONT SIZE=1><SUB>4</SUB></FONT> dans la formule du gain. En fixant R<FONT SIZE=1><SUB>4</SUB></FONT> &agrave; quelques centaines de k<IMG SRC="../../BASE/ICONES/OHM.GIF">, on peut simplifier, ce qui est fait dans l'&eacute;quation [3]. (NB&nbsp;: la feuille excel tient compte de R<FONT SIZE=1><SUB>2</SUB></FONT> et R<FONT SIZE=1><SUB>3</SUB></FONT>)<P>On fixe R<FONT SIZE=1><SUB>4</SUB></FONT> et on d&eacute;duit R5&nbsp;:<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC11.GIF"><P> Nota&nbsp;: dans les &eacute;quations [6] et [7], les valeurs de Vp et Vmic utilis&eacute;es peuvent &ecirc;tre absolues ou relatives &agrave; la tension d'alimentation E.<P>Application num&eacute;rique (valeurs relatives)&nbsp;:<UL><LI type=disc>t<FONT SIZE=1><SUB>1</SUB></FONT> = 25&#176;, V<FONT SIZE=1><SUB>p1</SUB></FONT> = 0.25<LI type=disc>t<FONT SIZE=1><SUB>2</SUB></FONT> = 45&#176;, V<FONT SIZE=1><SUB>p2</SUB></FONT> = 0.42<LI type=disc>V<FONT SIZE=1><SUB>mic1</SUB></FONT> = 0.3, V<FONT SIZE=1><SUB>mic2</SUB></FONT> = 0.7<LI type=disc>R<FONT SIZE=1><SUB>4</SUB></FONT> = 220k<IMG SRC="../../BASE/ICONES/OHM.GIF"></UL><P>Avec ces valeurs, on obtient R<FONT SIZE=1><SUB>5</SUB></FONT> = 297k<IMG SRC="../../BASE/ICONES/OHM.GIF">. On choisira la valeur normalis&eacute;e la plus proche et on recalculera le gain r&eacute;el correspondant&nbsp;: c'est cette valeur qui servira pour le calcul d'offset.<P><B>&nbsp;</B><LI TYPE="1"><B><U>Calcul de l'offset du montage</U></B><P>Il reste &agrave; calculer R<FONT SIZE=1><SUB>2</SUB></FONT> et R<FONT SIZE=1><SUB>3</SUB></FONT> pour fixer l'offset du montage, qui correspond &agrave; la temp&eacute;rature &agrave; laquelle le ventilateur commencera &agrave; se mettre en route.<P>Comme pour le gain, il faut fixer une des deux r&eacute;sistances&nbsp;: par exemple, R<FONT SIZE=1><SUB>2</SUB></FONT> = 18k<IMG SRC="../../BASE/ICONES/OHM.GIF">.<P>On peut alors &eacute;crire l'&eacute;quation [3] pour la temp&eacute;rature t<FONT SIZE=1><SUB>1</SUB></FONT>&nbsp;:<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC12.GIF"><P>soit&nbsp;:<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC13.GIF"><P>Avec les valeurs pr&eacute;c&eacute;dentes et R<FONT SIZE=1><SUB>5</SUB></FONT> = 270k<IMG SRC="../../BASE/ICONES/OHM.GIF"> (A<FONT SIZE=1><SUB>v</SUB></FONT> = 2.23), on obtient une valeur de R<FONT SIZE=1><SUB>3</SUB></FONT> = 4.76k<IMG SRC="../../BASE/ICONES/OHM.GIF">&nbsp;: on prendra 4.7k<IMG SRC="../../BASE/ICONES/OHM.GIF">.<P>Ces formules sont donn&eacute;es ici pour les plus curieux, le fichier excel fait bien entendu tout ces calculs automatiquement, et donne aussi les vraies valeurs de temp&eacute;ratures d'enclenchement et de vitesse maxi du ventilateur. Chacun pourra alors corriger &agrave; la main ces valeurs pour affiner.</OL><P><B>&nbsp;</B><H2><B><A NAME="5">R&eacute;glages et mise en &#156;uvre</A></B></H2><P><B><U>Attention !!!</U></B> Ce montage est destin&eacute; &agrave; &ecirc;tre mont&eacute; sur votre (cher&#133;) PC, sur une fonction vitale&nbsp;: le refroidissement. On a donc int&eacute;r&ecirc;t &agrave; mettre le montage au point avant de le brancher sur le PC.<P><B> En aucun cas l'auteur de ces lignes ne saurait &ecirc;tre rendu responsable d'un probl&egrave;me sur votre PC&nbsp;!</B><P>Il est conseill&eacute; de tester et r&eacute;gler au moins la partie mesure de temp&eacute;rature avant montage. On pourra le faire en trempant la thermistance dans un bain d'eau distill&eacute;e (non conductrice&nbsp;!) dont la temp&eacute;rature sera mesur&eacute;e avec un thermom&egrave;tre &agrave; alcool standard. On v&eacute;rifiera que la dynamique de 40% de la tension d'alimentation en sortie (de 30 &agrave; 70%) corresponde bien &agrave; la dynamique de temp&eacute;rature <IMG SRC="../../BASE/ICONES/DELTA.GIF">t choisie. Si ce n'est pas le cas, on retouchera le gain.<P>Si la thermistance a &eacute;t&eacute; mesur&eacute;e &agrave; priori, ces mesures de v&eacute;rification ne sont pas n&eacute;cessaires (mais pourront rassurer le propri&eacute;taire du PC modifi&eacute;&#133;)<P>On peut se contenter d'une temp&eacute;rature de 30&#176; pour le d&eacute;marrage du ventilateur&nbsp;: en dessous, les composants ne craignent pas grand chose, et le ventilateur serait tout le temps en marche, ce qui n'est pas le but du montage&nbsp;!<P><B>&nbsp;</B><H2><B><A NAME="6">Caract&eacute;risation d'une thermistance</A></B></H2><P>Les puristes voudront peut-&ecirc;tre caract&eacute;riser la thermistance achet&eacute;e avant de la monter, ou aussi pour calculer les composants du montage au plus pr&eacute;cis.<P>Rien de plus simple !<P>En fait, il faut faire quelques mesures de r&eacute;sistances &agrave; plusieurs temp&eacute;rature. Il suffit d'un multim&egrave;tre, d'un bac plein d'eau, et d'un thermom&egrave;tre &agrave; alcool (si on n'a rien sous la main, un thermom&egrave;tre de bain de b&eacute;b&eacute; fera tr&egrave;s bien l'affaire).<P>On fera quelques mesures entre 20 et 40-45&#176;C (tous les 5&#176;C environ, ce qui va nous donner 5 &agrave; 6 points de mesure).<P>On a d&eacute;j&agrave; vu que l'&eacute;quation qui r&eacute;git une thermistance est de la forme :<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC14.GIF"><P>Moyennant deux changements de variables, on peut obtenir une &eacute;quation du type lin&eacute;aire, dans le but de faire une r&eacute;gression du m&ecirc;me nom sur les points d'exp&eacute;rience et en d&eacute;duire les deux param&egrave;tres de la thermistance, &agrave; savoir R(t<FONT SIZE=1><SUB>0</SUB></FONT>) et a.<P>Les deux changements de variables sont les suivants&nbsp;:<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC15.GIF"><P>En fait, on va prendre le logarithme n&eacute;p&eacute;rien de R(t), donc l'&eacute;quation devient&nbsp;:<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC16.GIF"><P>Ou encore&nbsp;:<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC17.GIF"><P>Donc, si on mesure plusieurs valeurs de R en fonction de t, et qu'on les transforme respectivement en les variables y et x, si on trace y en fonction de x, on doit obtenir une droite.<P>Ensuite, si on fait un calcul de r&eacute;gression lin&eacute;aire sur les points (x,y), on peut obtenir les coefficients a et b. L'avantage de la r&eacute;gression lin&eacute;aire, c'est que m&ecirc;me avec excel, on peut la faire&nbsp;!<P>a est directement le coefficient de la thermistance (sa pente, valant environ 4000K), et &agrave; l'aide de b, on peut retrouver la valeur de R(t<FONT SIZE=1><SUB>0</SUB></FONT>)&nbsp;:<P ALIGN=CENTER><IMG SRC="MIC.FIG/MIC18.GIF"><P>Avec cette identification des coefficients de la thermistance, nous sommes capables de calculer compl&egrave;tement et pr&eacute;cis&eacute;ment le montage pr&eacute;c&eacute;dent pour les param&egrave;tres d&eacute;sir&eacute;s (temp&eacute;rature d'enclenchement du ventilateur, et temp&eacute;rature de vitesse maxi).<P>Tous ces calculs sont int&eacute;gr&eacute;s au fichier excel&nbsp;: il suffit de rentrer les couples r&eacute;sistance / temp&eacute;rature dans le tableau pr&eacute;vu &agrave; cet effet&nbsp;; la r&eacute;gression est faite automatiquement.<P><B>&nbsp;</B><H2><B><A NAME="7">En pratique...</A></B></H2><P>Le sch&eacute;ma complet du montage est le suivant&nbsp;:<P ALIGN=CENTER><IMG src="MIC.FIG/SCHEMA.GIF" width="543" height="173"><P ALIGN=CENTER><B>Figure 5</B><P>&nbsp;<P>La nomenclature associ&eacute;e est&nbsp;:<P ALIGN=CENTER><IMG src="MIC.FIG/BOM.GIF" width="368" height="347"><P>&nbsp;<P>Le typon (c&ocirc;t&eacute; cuivre) est disponible en fichierTIFF, &agrave; l'&eacute;chelle 10&nbsp;: il faudra le redimensionnerau 1/10e, ou red&eacute;finir la r&eacute;solution &agrave; 720ppp&nbsp;; Il est d&eacute;j&agrave; normalement livr&eacute; danscette r&eacute;solution, mais tous les logiciels ne feront pas ladiff&eacute;rence... Il est accompagn&eacute; du sch&eacute;mad'implantation (c&ocirc;t&eacute; composants, of course&nbsp;!)<P ALIGN=CENTER><A HREF="../../TELECH/EXOS/IMPLANT.ZIP"><IMG src="MIC.FIG/IMPLANTER.GIF" width="188" height="129"></A><A HREF="../../TELECH/EXOS/TYPON.ZIP"><IMG src="MIC.FIG/TYPONR.GIF" width="170" height="121"></A><P ALIGN=CENTER><B>Figure 6</B><P>&nbsp;</BODY></HTML>