<HTML><HEAD>   <TITLE>Correcteur param&eacute;trique</TITLE></HEAD><BODY BGCOLOR="#FFFFFF"><P><CENTER><B><FONT SIZE="+2">Correcteur de tonalit&eacute;param&eacute;trique</FONT></B></CENTER><P><HR><P ALIGN=RIGHT><A HREF="../../BASE/EXOS.HTM"><IMG SRC="../../BASE/ICONES/NICHE.GIF"WIDTH=102 HEIGHT=81 ALIGN=bottom></A><P><BR><P><B><FONT SIZE="+1">Pr&eacute;sentation</FONT></B><BR>On se propose d'&eacute;tudier un correcteur de tonalit&eacute;param&eacute;trique. Ce correcteur pourra sans probl&egrave;mess'interfacer sur <A HREF="../TMIX.HTM" TARGET="_blank">touteles table de mixage</A> pr&eacute;sent&eacute;es sur ce site.<BR>Ce correcteur, tout comme <A HREF="EQU.HTM"TARGET="_blank">l'&eacute;galiseur graphique 6 voies</A>, nous est unefois de plus propos&eacute; par <B>Yves Caroff.</B><BR>Cette r&eacute;alisation est bas&eacute;e sur le m&ecirc;me filtreque le correcteur graphique 6 voies. On ne refera donc pasl'&eacute;tude de cette cellule ici, on se contentera de donner led&eacute;tail qui fait toute la diff&eacute;rence : dans chaquecellule, les r&eacute;sistances du pont de wien sontremplac&eacute;es par un potentiom&egrave;tre double, ce qui permetde r&eacute;gler la fr&eacute;quence d'accord du filtre encontinu.<BR>Nous avons deux cellules en cascade, donc deux possibilit&eacute;s decorriger des d&eacute;fauts de la cha&icirc;ne sonore (ampli,enceintes accoustiques, local d'&eacute;coute).<BR>Ce correcteur sera donc utilis&eacute; essentiellement &agrave; cetusage.<P><B><FONT SIZE="+1">&nbsp;</FONT></B><P><B><FONT SIZE="+1">Sch&eacute;ma global</FONT></B><BR>Le sch&eacute;ma complet est le <A HREF="EQU.FIG/CP.GIF"TARGET="_blank">suivant</A>. La cellule est trait&eacute;ecompl&egrave;tement dans le montage de <A HREF="EQU.HTM"TARGET="_blank">l'&eacute;galiseur graphique &agrave; 6bandes</A>.<BR>&nbsp;<BR><H3>R&eacute;ponse en Fr&eacute;quence</H3><P>Un exemple de correction est donn&eacute; ci-apr&egrave;s pour unefr&eacute;quence de cassure d'environ 1000Hz. On pourra comparer avecla r&eacute;ponse du correcteur graphique. Les courbes sonttr&egrave;s l&eacute;g&egrave;rement plus arrondies (si onram&egrave;ne le niveau max &agrave; la m&ecirc;me valeur). Le niveaumaxi de correction est de 9.5dB contre 14dB pour le correcteurgraphique. Chacun pourra peaufiner son r&eacute;glage en modifiant lerapport des condensateurs du filtre ou en mettant un gaindiff&eacute;rent de 1 &agrave; l'ampli mont&eacute; en suiveur (voircorrecteur graphique).<P><CENTER><IMG SRC="EQU.FIG/CP1.GIF" WIDTH=634 HEIGHT=440ALIGN=bottom></CENTER><P>Pour finir, on peut donner la courbe des fr&eacute;quences der&eacute;sonnance en fonction de la position du potentiom&egrave;tre(filtre 50-1000Hz) :<P><CENTER><IMG SRC="EQU.FIG/CP2.GIF" WIDTH=453 HEIGHT=461ALIGN=bottom></CENTER><P>La courbe n'est pas franchement lin&eacute;aire, mais il estimp&eacute;ratif de prendre un potentiom&egrave;tre lin&eacute;aire,un mod&egrave;le log donnant des r&eacute;sultats catastrophiques dece point de vue !<P>&nbsp;</BODY></HTML>