<HTML><HEAD><TITLE>Correcteur 6 bandes</TITLE></HEAD><BODY  ><P ALIGN=CENTER><FONT SIZE=5><B>Correcteur de tonalit&eacute; multifr&eacute;quences<BR></B></FONT></P><HR><P ALIGN=RIGHT><P ALIGN=RIGHT><A HREF="../../BASE/EXOS.HTM"><IMG SRC="../../BASE/ICONES/NICHE.GIF"WIDTH=102 HEIGHT=81 ALIGN=bottom></A><P><BR><FONT SIZE=4><B>But<BR></B></FONT>On se propose d&#146;&eacute;tudier un correcteur de tonalit&eacute; multifr&eacute;quences. Ce correcteur pourra sans probl&egrave;mes s&#146;interfacer sur les <A HREF="../TMIX.HTM" TARGET="_blank">tables de mixage</A> d&eacute;crites par ailleurs, ou sur toute autre table de mixage ou pr&eacute;amplificateur.<BR>Ce correcteur nous est une fois de plus propos&eacute; par <B>Yves Caroff</B> qui l&#146;a bien entendu compl&egrave;tement r&eacute;alis&eacute; et largement test&eacute;. Toutefois, il ne cache pas qu&#146;il s&#146;est largement inspir&eacute; d&#146;une r&eacute;alisation de <B>Jean Alary</B> parue dans un &laquo;&nbsp;vieux&nbsp;&raquo; radio-plans, avec quelques adaptations.<BR>Ce dernier a &eacute;t&eacute; contact&eacute; par Yves et ne voit aucun inconv&eacute;nient &agrave; ce qu&#146;une &eacute;volution de sa r&eacute;alisation soit publi&eacute;e. Par contre, si d&#146;aucun trouve un &laquo;&nbsp;bug&nbsp;&raquo; dans le sch&eacute;ma (?!), vu qu&#146;il a &eacute;t&eacute; modifi&eacute;, c&#146;est Yves qui en endosse la responsabilit&eacute;&nbsp;: inutile de fustiger Jean Alary donc&nbsp;! Tout ceci sans parler des erreurs de calculs que j&#146;aurais pu introduire et que j&#146;assumerais sans probl&egrave;mes&#133;<BR>Cette r&eacute;alisation est ici largement comment&eacute;e, avec tous les calculs n&eacute;cessaires permettant &agrave; tout un chacun de l&#146;adapter &agrave; ses besoins.<BR><BR><FONT SIZE=4><B>Sch&eacute;ma global<BR></B></FONT>Le <A HREF="EQU.FIG/SG-EQ206.GIF" TARGET="_blank">sch&eacute;ma suivant</A> est le sch&eacute;ma complet du montage, alimentation comprise. Nous allons isoler une cellule et la traiter compl&egrave;tement&nbsp;; les autres cellules sont identiques, seules les valeurs des composants changent.<BR><BR><FONT SIZE=4><B>M&eacute;thodologie<BR></B></FONT>Nous allons faire cette &eacute;tude &agrave; l&#146;aide de la m&eacute;thode des syst&egrave;mes boucl&eacute;s (voir <A HREF="../../AOP/AOP.HTM" TARGET="_blank">cours sur les AOP</A>). Nous allons d&#146;abord identifier les blocs de ce syst&egrave;me, puis construire le sch&eacute;ma-bloc global, et enfin en d&eacute;duire la fonction de transfert.<BR>Le module de calcul symbolique de matlab a &eacute;t&eacute; utilis&eacute; pour d&eacute;terminer les diff&eacute;rentes fonctions de transfert du montage.<BR>Le logiciel de calcul vectoriel MathPad (pour Macintosh) a servi &agrave; calculer num&eacute;riquement les r&eacute;sultats des fonctions de transfert.<BR><BR><FONT SIZE=4><B>Sch&eacute;ma d&#146;une cellule<BR></B></FONT></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU01.GIF"><BR></P><P>L&#146;&eacute;l&eacute;ment central de ce filtre est un pont de Wien. Ce pont est aliment&eacute; via un ampli suiveur (adaptation d&#146;imp&eacute;dance) par un potentiom&egrave;tre pris entre l&#146;entr&eacute;e et la sortie du montage. Nous allons sch&eacute;matiser ce montage &agrave; l&#146;aide d&#146;un sch&eacute;ma-bloc pour mieux le r&eacute;soudre. Nous reviendrons ensuite sur le pont de wien et sa fonction de transfert.<BR><FONT SIZE=4><B><BR>Sch&eacute;ma bloc complet d&#146;une cellule<BR></B></FONT></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU02.GIF"><BR><BR></P><P>Sur le sch&eacute;ma ci-dessus, on peut identifier les diff&eacute;rents bloc&nbsp;:<BR><UL><LI TYPE="disc"><IMG SRC="../../BASE/ICONES/ALPHA.GIF"> correspond au pont diviseur R<SUB>1</SUB>/R<SUB>2</SUB> de l&#146;ampli inverseur d&#146;entr&eacute;e<BR><LI TYPE="disc">A<SUB>1</SUB> est l&#146;ampli-op d&#146;entr&eacute;e<BR><LI TYPE="disc">B est le pont diviseur R<SUB>2</SUB>/R<SUB>1</SUB> de la boucle de retour de l&#146;ampli d&#146;entr&eacute;e<BR><LI TYPE="disc">A<SUB>2</SUB> correspond au pont de wien ; le gain de l&#146;ampli suiveur est consid&eacute;r&eacute; comme &eacute;tant &eacute;gal &agrave; 1 quelque soit la fr&eacute;quence.<BR><LI TYPE="disc">les blocs k et (1-k) correspondent aux ponts diviseurs du potentiom&egrave;tre de r&eacute;glage, vu respectivement de l&#146;entr&eacute;e et de la sortie.<BR></UL>On peut calculer la fonction de transfert de ce bloc&nbsp;:<BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU03.GIF"><BR></P><P>On peut consid&eacute;rer que A<SUB>1</SUB> (gain en boucle ouverte de l&#146;ampli op d&#146;entr&eacute;e) est tr&egrave;s grand devant 1&nbsp;; on arrive alors &agrave; la simplification suivante&nbsp;:<BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU04.GIF"><BR></P><P>Les r&eacute;sistances R<SUB>1</SUB> et R<SUB>2</SUB> sont &eacute;gales, on obtient donc&nbsp;:<BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU05.GIF"><BR></P><P>On obtient enfin la fonction simplifi&eacute;e&nbsp;:<BR><BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU06.GIF"><BR></P><P><FONT SIZE=4><B><BR>Le pont de wien<BR></B></FONT>La cellule du pont de wien est la suivante&nbsp;:<BR><BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU07.GIF"><BR><BR></P><P>Et la fonction de transfert associ&eacute;e est :<BR><BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU08.GIF"><BR><BR></P><P>En posant&nbsp;:<BR><BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU09.GIF"><BR><BR></P><P>On obtient au final&nbsp;:<BR><BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU10.GIF"><BR></P><P><BR>Pour R=10k, C<SUB>1</SUB>=22nF, et C<SUB>2</SUB>=10nF, la <A HREF="../../AOP/ANNEXE/ANAOP07.HTM" TARGET="_blank">r&eacute;ponse de bode</A> (courbe de gain) associ&eacute;e est la suivante&nbsp;:<BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU11.GIF"><BR></P><P><FONT SIZE=4><B><BR>Fonction de transfert globale<BR></B></FONT>Il ne reste plus qu&#146;&agrave; remplacer la fonction de transfert du pont de wien par sa valeur dans la formule de r&eacute;ponse globale H du filtre ; on obtient&nbsp;:<BR><BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU12.GIF"><BR><BR></P><P>Les courbes de r&eacute;ponse en fr&eacute;quence sont calcul&eacute;es par Mathpad pour diff&eacute;rentes valeurs du potentiom&egrave;tre ( param&egrave;tre k). <A HREF="../../TELECH/EXOS/EQU.TXT" TARGET="_blank">Le fichier de calcul de Mathpad</A> est complet et permet toutes les variations possibles de param&egrave;tres et composants. <A HREF="../../TELECH/EXOS/EQU.ZIP">(T&eacute;l&eacute;chargez le fichier)</A><BR>Nous avons choisi les composants correspondant &agrave; la fr&eacute;quence centrale de 1000Hz pour la repr&eacute;sentation suivante&nbsp;:<BR><BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU13.GIF"><BR><BR></P><P><FONT SIZE=4><B>Discussion du r&eacute;sultat<BR></B></FONT>Au vu de la courbe ci-dessus, on voit appara&icirc;tre deux param&egrave;tres essentiels&nbsp;: la fr&eacute;quence de r&eacute;sonnance f<SUB>c</SUB> et l&#146;amplitude maxi des corrections G<SUB>max</SUB>.<BR>La fr&eacute;quence de r&eacute;sonnance du filtre f<SUB>c </SUB>, correspondant &agrave; la pulsation <IMG SRC="../../BASE/ICONES/PULS.GIF"><SUB>c</SUB> est &eacute;gale &agrave;&nbsp;:<BR><BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU14.GIF"><BR><BR></P><P>On retrouve facilement quelques caract&eacute;ristiques des courbes&nbsp;:<BR>Pour <IMG SRC="../../BASE/ICONES/PULS.GIF"> = 0, la fonction de transfert H tend vers -1 (soit 0dB, mais avec inversion de phase)<BR>Pour <IMG SRC="../../BASE/ICONES/PULS.GIF"> = <IMG SRC="../../BASE/ICONES/INF.GIF">, la fonction de transfert H tend aussi vers -1<BR>Pour ces deux fr&eacute;quences extr&ecirc;mes, le signal traverse donc juste le filtre sans att&eacute;nuation.<BR>Pour <IMG SRC="../../BASE/ICONES/PULS.GIF"> = <IMG SRC="../../BASE/ICONES/PULS.GIF"><SUB>c</SUB>, on a :<BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU15.GIF"><BR></P><P>Pour cette valeur particuli&egrave;re de la fr&eacute;quence, on peut calculer le module de la fonction de transfert pour des valeurs remarquables du potentiom&egrave;tre&nbsp;:<BR><UL><LI TYPE="disc">Pour k = 0 et <IMG SRC="../../BASE/ICONES/PULS.GIF"> = <IMG SRC="../../BASE/ICONES/PULS.GIF"><SUB>c</SUB>, on a&nbsp;:<BR></UL></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU16.GIF"><BR></P><P><UL><LI TYPE="disc">Pour k = 1 et <IMG SRC="../../BASE/ICONES/PULS.GIF"> = <IMG SRC="../../BASE/ICONES/PULS.GIF"><SUB>c</SUB>, on a&nbsp;:<BR></UL></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU17.GIF"><BR></P><P><UL><LI TYPE="disc">Pour k = 0.5 et <IMG SRC="../../BASE/ICONES/PULS.GIF"> = <IMG SRC="../../BASE/ICONES/PULS.GIF"><SUB>c</SUB>, on a&nbsp;:<BR></UL></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU18.GIF"><BR></P><P>Pour k=1 et 0, on obtient deux r&eacute;sultats qui sont l&#146;inverse l&#146;un de l&#146;autre&nbsp;; les gains en dB &eacute;quivalents seront donc les m&ecirc;mes au signe pr&egrave;s&nbsp;; ce gain en dB vaut&nbsp;:<BR><BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU19.GIF"><BR><BR></P><P>Dans le montage, on utilise des condensateurs dans un rapport d&#146;environ 2&nbsp;: C<SUB>1</SUB> = 2C<SUB>2</SUB><BR>Le gain vaut alors environ&nbsp;: G<SUB>maxdB</SUB> = 14dB<BR>On peut faire un calcul plus complet des fr&eacute;quences de cassure et des gains d&#146;amplification/att&eacute;nuation maxi pour chaque jeu de composants&nbsp;:<BR><BR><center><TABLE BORDER=1 width=359 height=99> <TR>  <TD bgcolor="#33FFFF" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1><B>R</B></P><P></FONT>  </TD>  <TD bgcolor="#33FFFF" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1><B>C1</B></P><P></FONT>  </TD>  <TD bgcolor="#33FFFF" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1><B>C2</B></P><P></FONT>  </TD>  <TD bgcolor="#FFFF00" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1><B>Fc (Hz)</B></P><P></FONT>  </TD>  <TD bgcolor="#FFFF00" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1><B>Gmax (dB)</B></P><P></FONT>  </TD> </TR> <TR>  <TD bgcolor="#BBBBBB" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1>100000</P><P></FONT>  </TD>  <TD bgcolor="#BBBBBB" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1> 4,7e-8</P><P></FONT>  </TD>  <TD bgcolor="#BBBBBB" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1> 2,2e-8</P><P></FONT>  </TD>  <TD bgcolor="#BBBBBB" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1>49,5</P><P></FONT>  </TD>  <TD bgcolor="#BBBBBB" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1>14,4</P><P></FONT>  </TD> </TR> <TR>  <TD align=center></P><P ALIGN=CENTER><FONT SIZE=1>56000</P><P></FONT>  </TD>  <TD align=center></P><P ALIGN=CENTER><FONT SIZE=1> 6,8e-9</P><P></FONT>  </TD>  <TD align=center></P><P ALIGN=CENTER><FONT SIZE=1> 4,7e-9</P><P></FONT>  </TD>  <TD align=center></P><P ALIGN=CENTER><FONT SIZE=1>502,7</P><P></FONT>  </TD>  <TD align=center></P><P ALIGN=CENTER><FONT SIZE=1>11,8</P><P></FONT>  </TD> </TR> <TR>  <TD bgcolor="#BBBBBB" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1>10000</P><P></FONT>  </TD>  <TD bgcolor="#BBBBBB" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1> 2,2e-8</P><P></FONT>  </TD>  <TD bgcolor="#BBBBBB" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1> 1,0e-8</P><P></FONT>  </TD>  <TD bgcolor="#BBBBBB" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1>1073,0</P><P></FONT>  </TD>  <TD bgcolor="#BBBBBB" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1>14,6</P><P></FONT>  </TD> </TR> <TR>  <TD align=center></P><P ALIGN=CENTER><FONT SIZE=1>8200</P><P></FONT>  </TD>  <TD align=center></P><P ALIGN=CENTER><FONT SIZE=1> 6,8e-9</P><P></FONT>  </TD>  <TD align=center></P><P ALIGN=CENTER><FONT SIZE=1> 3,3e-9</P><P></FONT>  </TD>  <TD align=center></P><P ALIGN=CENTER><FONT SIZE=1>4097,3</P><P></FONT>  </TD>  <TD align=center></P><P ALIGN=CENTER><FONT SIZE=1>14,2</P><P></FONT>  </TD> </TR> <TR>  <TD bgcolor="#BBBBBB" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1>27000</P><P></FONT>  </TD>  <TD bgcolor="#BBBBBB" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1> 1,0e-9</P><P></FONT>  </TD>  <TD bgcolor="#BBBBBB" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1> 4,7e-10</P><P></FONT>  </TD>  <TD bgcolor="#BBBBBB" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1>8598,2</P><P></FONT>  </TD>  <TD bgcolor="#BBBBBB" ALIGN=center></P><P ALIGN=CENTER><FONT SIZE=1>14,4</P><P></FONT>  </TD> </TR> <TR>  <TD align=center></P><P ALIGN=CENTER><FONT SIZE=1>4700</P><P></FONT>  </TD>  <TD align=center></P><P ALIGN=CENTER><FONT SIZE=1> 3,3e-9</P><P></FONT>  </TD>  <TD align=center></P><P ALIGN=CENTER><FONT SIZE=1> 1,2e-9</P><P></FONT>  </TD>  <TD align=center></P><P ALIGN=CENTER><FONT SIZE=1>17016,7</P><P></FONT>  </TD>  <TD align=center></P><P ALIGN=CENTER><FONT SIZE=1>16,3</P><P></FONT>  </TD> </TR></TABLE></center></P><P ALIGN=CENTER><BR></P><P><BR>A l&#146;aide de ces deux formules principales, chacun pourra recalculer ses propres valeurs de filtres, avec plus ou moins d&#146;amplitude de correction et des fr&eacute;quences de r&eacute;sonnance diff&eacute;rentes. On notera que les courbes sont assez &laquo;&nbsp;douces&nbsp;&raquo;, ce qui correspond &agrave; des filtres pas tr&egrave;s s&eacute;lectifs&nbsp;: on &eacute;vitera de multiplier le nombre de voies (6 voies est suffisant pour ce type de filtre&nbsp;; si on d&eacute;sire augmenter ce nombre, il sera pr&eacute;f&eacute;rable d&#146;utiliser des filtres plus s&eacute;lectifs).<BR>Astuce&nbsp;: ici, toutes les bandes ont la m&ecirc;me amplitude de correction&nbsp;; certains &eacute;quipements haut de gamme ont des amplitudes variables en fonction de la fr&eacute;quence&nbsp;: plus de correction dans les graves et les aigues, et moins dans le registre m&eacute;dium.<BR>On respecte ainsi la sensibilit&eacute; de l&#146;oreille qui est plus sensible dans le m&eacute;dium. On pourra faire des r&eacute;glages plus fins &agrave; l&#146;aide des potentiom&egrave;tres de r&eacute;glage. 4 &agrave; 6dB de correction peuvent suffire dans les bandes 1000 et 5000Hz.<BR><BR><FONT SIZE=4><B>Autres &eacute;l&eacute;ments de calcul<BR></B></FONT>On peut donner une courbe permettant de faire des choix de composants, notamment le rapport des condensateurs pour d&eacute;terminer l&#146;amplitude de la correction&nbsp;:<BR><BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU20.GIF"><BR></P><P>L&#146;abaque suivante donne la forme de la correction &agrave; la fr&eacute;quence de r&eacute;sonnance en fonction de la position du potentiom&egrave;tre et pour diverses valeurs de C<SUB>1</SUB>/C<SUB>2</SUB>. On note que les courbes sont quasiment lin&eacute;aires, et que plus C<SUB>1</SUB>/C<SUB>2</SUB> est petit (correction maxi plus faible), plus la courbe est lin&eacute;aire.<BR><BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU21.GIF"><BR></P><P><BR>Un param&egrave;tre pr&eacute;sente peu d&#146;int&eacute;r&ecirc;t&nbsp;: le gain de l&#146;ampli d&#146;entr&eacute;e doit rester &agrave; -1, sinon, les r&eacute;seaux de r&eacute;ponse pr&eacute;sentent un gain diff&eacute;rent de -1 &agrave; la position m&eacute;diane du curseur, et les courbes sont asym&eacute;triques (plus d&#146;amplification que d&#146;att&eacute;nuation ou l&#146;inverse selon le gain).<BR>Par contre, on peut mettre un l&eacute;ger gain sur le suiveur en le transformant en ampli non inverseur, car &ccedil;a permet d&#146;utiliser les m&ecirc;mes condensateurs dans la cellule de wien et de r&eacute;gler l&#146; amplitude de correction par ce gain. A titre indicatif, voil&agrave; le r&eacute;seau de courbes obtenues avec un gain de 1,22 et les deux m&ecirc;mes condensateurs (C<SUB>1</SUB> = C<SUB>2</SUB> = 22nF, R=6.8k)&nbsp;:<BR><BR></P><P ALIGN=CENTER><IMG SRC="EQU.FIG/EQU22.GIF"><BR></P><P><BR>On ne voit pas de diff&eacute;rence visible avec la courbe de r&eacute;ponse pr&eacute;c&eacute;dente, et &ccedil;a permet d&#146;utiliser des condensateurs identiques, et donc d&#146;avoir la m&ecirc;me correction pour toutes les fr&eacute;quences.</P></BODY></HTML>