<HTML><HEAD><TITLE>Cristal</TITLE></HEAD><BODY><CENTER><IMG SRC="../BASE/ICONES/NAV.GIF"></CENTER><P align=center>Si votre &eacute;cran ne se pr&eacute;sente pas comme ceci, <A HREF="CRISTAL.HTM" target="_top"> cliquez l&agrave; </A><OL TYPE=I><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="C01">INTRODUCTION</A>.</H3><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="C02">AVERTISSEMENT</A>.</H4><P>Ce cours n'a aucunement la pr&eacute;tention d'&ecirc;tre un cours de cristallographie. Il ne sera donc ni exhaustif (et de tr&egrave;s loin s'en faut&nbsp;!), ni franchement rigoureux.<P>Son but est de permettre la compr&eacute;hension des principaux ph&eacute;nom&egrave;nes de conduction qui se produisent dans les semi-conducteurs, afin de pouvoir interpr&eacute;ter leur comportement.<P>Cet expos&eacute; sera donc plus proche de la vulgarisation que du cours acad&eacute;mique, mais compte tenu du but recherch&eacute;, il sera largement suffisant pour comprendre les ph&eacute;nom&egrave;nes sans rentrer dans les d&eacute;tails fort compliqu&eacute;s de la th&eacute;orie de la conduction.<P>Les personnes d&eacute;sireuses d'approfondir cette partie (tout en conservant une vue d'ensemble) pourront se r&eacute;f&eacute;rer (entres autres) &agrave; l'ouvrage  Mat&eacute;riaux de l'&eacute;lectrotechnique  de P. Robert &eacute;dit&eacute; chez Dunod (collection  Trait&eacute; d'&eacute;lectricit&eacute;, d'&eacute;lectronique et d'&eacute;lectrotechnique ).<P>A noter que des connaissances approfondies en cristallographie ne sont indispensables que pour l'&eacute;lectronicien d&eacute;sireux de se sp&eacute;cialiser en micro-&eacute;lectronique (conception de circuits int&eacute;gr&eacute;s). On peut donc parfaitement s'en passer si on se contente d'assembler des composants discrets&nbsp;!<P>Dans l'optique de ce cours, elles vont nous permettre de comprendre l'essentiel du fonctionnement des composants utilis&eacute;s sans avoir &agrave;  parachuter  trop de notions qui resteraient alors incomprises.<P>&nbsp;<LI><H4><A NAME="C03">LIEN AVEC LE COURS D'&Eacute;LECTRONIQUE</A>.</H4><P>Tout le  secret  de l'&eacute;lectricit&eacute; r&eacute;side dans la capacit&eacute; de la mati&egrave;re &agrave; laisser circuler plus ou moins bien des charges &eacute;lectriques en son sein sous l'influence d'un champ &eacute;lectrique externe.<P>Les composants &eacute;lectroniques ob&eacute;issent aux lois g&eacute;n&eacute;rales de l'&eacute;lectricit&eacute; (revoir le chapitre&nbsp;I), et donc r&eacute;pondent &agrave; la d&eacute;finition pr&eacute;c&eacute;dente.<P>La diff&eacute;rence avec les composants &eacute;lectriques traditionnels se situe dans le mat&eacute;riau conducteur utilis&eacute;, qui va autoriser un meilleur contr&ocirc;le de la conduction &eacute;lectrique, et donc des fonctionnalit&eacute;s nouvelles.<P>L'&eacute;lectronique va alors se distinguer de l'&eacute;lectricit&eacute; par des composants dont on pourra moduler la conduction &agrave; l'aide de signaux &eacute;lectriques, chose impossible avec les composants simples de l'&eacute;lectricit&eacute;.<P>Il est par cons&eacute;quent utile de rappeler en introduction que tout ce qu'on voit en &eacute;lectronique est totalement d&eacute;pendant de la physique des solides, et qu'un aper&ccedil;u de cette derni&egrave;re est indispensable pour comprendre le fonctionnement des composants &eacute;lectriques et &eacute;lectroniques.</OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="C04">STRUCTURE DE LA MATI&Egrave;RE</A>.</H3><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="C05">RAPPEL DE LA DESCRIPTION SIMPLIFI&Eacute;E DE LA STRUCTURE DES ATOMES</A>.</H4><P>Les atomes sont des particules de base constitu&eacute;es d'un noyau autour duquel gravitent des &eacute;lectrons.<P>Le noyau est compos&eacute; de protons, particules &eacute;l&eacute;mentaires charg&eacute;es &eacute;lectriquement &agrave; la valeur +e, et de neutrons, sans charge.<P>Les &eacute;lectrons sont des particules charg&eacute;es &eacute;lectriquement &agrave; la valeur -e. Ils tournent autour du noyau sur des orbites d&eacute;finies et ont une masse n&eacute;gligeable vis &agrave; vis des neutrons et protons (qui ont eux environ la m&ecirc;me masse).<P>La charge &eacute;lectrique &eacute;l&eacute;mentaire vaut e = 1,6E-19 C (C pour Coulomb, unit&eacute; de charge &eacute;lectrique).<P>Les orbites des &eacute;lectrons ont des dimensions tr&egrave;s grandes vis &agrave; vis de celle du noyau, et l'ensemble de l'atome est &eacute;lectriquement neutre, car il comprend autant de protons que d'&eacute;lectrons.<P>Les &eacute;lectrons se r&eacute;partissent sur des orbites diff&eacute;rentes qui forment des couches. Les couches sont remplies par les &eacute;lectrons dans un ordre bien d&eacute;termin&eacute;. Dans la mesure du possible, ceux-ci s'assemblent par paires. Quand ce n'est pas possible, ils restent  c&eacute;libataires .<P>Quand l'atome poss&egrave;de plusieurs couches d'&eacute;lectrons, les couches  profondes  contiennent un nombre d'&eacute;lectrons ind&eacute;pendant de l'atome consid&eacute;r&eacute;. C'est la couche p&eacute;riph&eacute;rique qui fait la diff&eacute;rence.<P><CENTER><IMG SRC="CRISTAL.FIG/CRIST02.GIF"></CENTER><P><CENTER>Fig. 1. Structure d'un atome (silicium).<P></CENTER><P>&nbsp;<LI><H4><A NAME="C06">LES LIAISONS INTER-ATOMIQUES</A>.</H4><P>Dans la mati&egrave;re, les atomes la constituant se combinent entre eux de mani&egrave;re &agrave; lui donner une certaine coh&eacute;sion.<P>Macroscopiquement, ces liaisons, appel&eacute;es valences, vont donner la consistance du mat&eacute;riau : gaz, liquide, solide plus ou moins dur, structure cristalline <P>Pour la suite de l'expos&eacute;, nous allons d&eacute;crire seulement deux types de valences&nbsp;; il en existe d'autres que nous n'aborderons pas.<P>Ces deux liaisons sont&nbsp;:<OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C07">Les liaisons covalentes</A>.</FONT></H5><P>Les atomes se lient entre eux en mettant en commun des &eacute;lectrons c&eacute;libataires de la couche p&eacute;riph&eacute;rique (&eacute;lectrons de valence). Ces &eacute;lectrons s'associent en paires et appartiennent en commun aux deux atomes participant &agrave; la liaison. De ce fait, les liaisons obtenues sont tr&egrave;s robustes&nbsp;: il faut leur fournir une &eacute;nergie importante pour les casser.<P>Dans ce type de liaison, les &eacute;lectrons mis en commun restent tr&egrave;s li&eacute;s aux atomes qui les fournissent. Ils ne peuvent pas circuler facilement dans la mati&egrave;re.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C08">Les liaisons m&eacute;talliques</A>.</FONT></H5><P>Dans ce cas de liaison, ce ne sont pas deux atomes qui mettent en commun un ou plusieurs &eacute;lectrons pour se lier&nbsp;; un grand nombre d'atomes mettent en commun des &eacute;lectrons c&eacute;libataires.<P>Les atomes ainsi d&eacute;pouill&eacute;s de leur(s) &eacute;lectrons(s) deviennent des particules non neutres du point de vue charge &eacute;lectrique (des ions).<P>Ils forment un r&eacute;seau cristallin et baignent dans un nuage d'&eacute;lectrons tr&egrave;s mobiles appel&eacute;s &eacute;lectrons libres.</OL><P>&nbsp;<LI><H4><A NAME="C09">LA CONDUCTION &Eacute;LECTRIQUE</A>.</H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C10">D&eacute;finition</A>.</FONT></H5><P>Lorsqu'on applique un champ &eacute;lectrique ext&eacute;rieur sur un mat&eacute;riau, on a conduction si on observe la circulation d'un courant &eacute;lectrique dans le mat&eacute;riau.<P>Ce courant est d&ucirc; au d&eacute;placement de charges &eacute;lectriques dans le mat&eacute;riau.<P><CENTER><IMG SRC="CRISTAL.FIG/CRIST03.GIF"></CENTER><P><CENTER>Fig. 2. D&eacute;placement de charges dans un mat&eacute;riau.<P></CENTER>La figure 2 montre ce m&eacute;canisme&nbsp;: si on applique une diff&eacute;rence de potentiel U<SUB>AB </SUB> entre deux points A et B d'un mat&eacute;riau distants d'une longueur L, on cr&eacute;&eacute; un champ &eacute;lectrique E dans le mat&eacute;riau&nbsp;:<P><CENTER><IMG SRC="CRISTAL.FIG/CRIST04.GIF"></CENTER><P> Ce champ va cr&eacute;er des forces sur les charges &eacute;lectriques pr&eacute;sentes dans le mat&eacute;riau&nbsp;:<P><CENTER><IMG SRC="CRISTAL.FIG/CRIST05.GIF"></CENTER><P>Si la charge q est positive, la force et le champ sont de m&ecirc;me sens, si elle est n&eacute;gative, ils sont de sens oppos&eacute;s.<P>Pour que des charges se d&eacute;placent dans un champ &eacute;lectrique, encore faut-il que ces charges  mobiles  existent. Les paragraphes qui suivent vont faire le lien avec les types de liaisons atomiques vues pr&eacute;c&eacute;demment.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C11">Les isolants</A>.</FONT></H5><P>Dans le cas des mat&eacute;riaux isolants, on a affaire &agrave; des liaisons de type covalente&nbsp;: les &eacute;lectrons c&eacute;libataires de la couche p&eacute;riph&eacute;rique forment tous des liaisons avec leurs homologues issus d'autres atomes adjacents. Les liaisons sont robustes, et les charges potentiellement mobiles (les &eacute;lectrons) restent li&eacute;es aux atomes auxquelles elles appartiennent.<P>On a beau appliquer un champ &eacute;lectrique sur ces mat&eacute;riaux, aucun courant &eacute;lectrique ne circule, car il n'y a pas de charges mobiles.<P>Il faut noter que les isolants sont aussi importants que les conducteurs en &eacute;lectricit&eacute; et en &eacute;lectronique, car ce sont eux qui permettent de canaliser les courants &eacute;lectriques l&agrave; o&ugrave; on le d&eacute;sire. Ils vont s'intercaler entre les conducteurs, et aussi assurer la protection des usagers (gaines isolantes, enrobages de c&acirc;bles ).<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C12">Les conducteurs</A>.</FONT></H5><P>Les liaisons des atomes composant les mat&eacute;riaux conducteurs sont de type m&eacute;tallique. Nous avons vu pr&eacute;c&eacute;demment que dans ce type de liaisons, chaque atome  lib&egrave;re  un &eacute;lectron qui peut circuler librement dans le cristal.<P>En l'absence de champ &eacute;lectrique ext&eacute;rieur, ces &eacute;lectrons se d&eacute;placent dans un mouvement d&eacute;sordonn&eacute;, et, statistiquement, la somme de tous les d&eacute;placements est  nulle&nbsp;: il n'y a pas de courant &eacute;lectrique g&eacute;n&eacute;r&eacute;  spontan&eacute;ment  (ce qui serait l'&eacute;quivalent du mouvement perp&eacute;tuel en m&eacute;canique&nbsp;!).<P>Par contre, d&egrave;s qu'on applique un champ &eacute;lectrique ext&eacute;rieur au mat&eacute;riau conducteur, les &eacute;lectrons vont circuler dans un sens bien d&eacute;termin&eacute; par le sens du champ &eacute;lectrique, cr&eacute;ant un courant important.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C13">Interpr&eacute;tation de la loi d'Ohm</A>.</FONT></H5><P>Tout le monde conna&icirc;t la loi d'Ohm&nbsp;:<P><CENTER><IMG SRC="CRISTAL.FIG/CRIST06.GIF"></CENTER><P>Cette loi est interpr&eacute;table au niveau atomique. Nous allons en donner les principales formulations ci-dessous.<P>Certaines &eacute;quations sont bien entendues parachut&eacute;es, notamment celle qui para&icirc;t la plus simple, &agrave; savoir la mobilit&eacute; des charges. Elle d&eacute;coule de la th&eacute;orie du mod&egrave;le  boules de billard , qui assimile les particules en mouvement &agrave; des boules de billard qui se d&eacute;placent al&eacute;atoirement et qui s'entrechoquent. Nous n'entrerons pas dans cette th&eacute;orie. On se reportera &agrave; l'ouvrage pr&eacute;-cit&eacute; (p.50) pour de plus amples renseignements.<UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C14">Mobilit&eacute; des charges</A>.</FONT></H5><P>De tout ce qui a &eacute;t&eacute; dit pr&eacute;c&eacute;demment, on se doute qu'un des principaux param&egrave;tres qui va d&eacute;crire l'aptitude d'un mat&eacute;riau &agrave; conduire le courant &eacute;lectrique est la mobilit&eacute; des charges &eacute;lectriques pr&eacute;sentes dans ce mat&eacute;riau.<P>On le d&eacute;finit dans la relation suivante&nbsp;:<P><CENTER><IMG SRC="CRISTAL.FIG/CRIST07.GIF"></CENTER><P>&#181; est la mobilit&eacute; des charges exprim&eacute;e en m<SUP>2 </SUP>/Vs, v la vitesse de d&eacute;placement de ces charges dans la mati&egrave;re, et E l'intensit&eacute; du champ &eacute;lectrique appliqu&eacute; sur le mat&eacute;riau (exprim&eacute; en V/m).<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C15">Courant</A>.</FONT></H5><P>Le courant &eacute;lectrique est le d&eacute;bit de charges &eacute;lectriques circulant dans le conducteur d'une section S donn&eacute;e, &agrave; savoir la quantit&eacute; de charges &eacute;lectriques qui vont traverser cette section par unit&eacute; de temps&nbsp;:<P><CENTER><IMG SRC="CRISTAL.FIG/CRIST08.GIF"></CENTER><P>o&ugrave; n est le nombre de charges traversant la section S de conducteur &agrave; la vitesse v. Chaque particule est charg&eacute;e &agrave; la valeur &eacute;l&eacute;mentaire e = 1,6E-19C. <P>Cette d&eacute;finition est tout &agrave; fait assimilable au d&eacute;bit d'eau dans une conduite.<P>On voit ici que le courant d&eacute;pend de la section du conducteur. Pour caract&eacute;riser le mat&eacute;riau, on va utiliser une d&eacute;finition faisant abstraction de cette section&nbsp;: c'est la densit&eacute; de courant.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C16">Densit&eacute; de courant</A>.</FONT></H5><P>La densit&eacute; de courant J est tout simplement le rapport de l'intensit&eacute; &agrave; la section, soit&nbsp;:<P><CENTER><IMG SRC="CRISTAL.FIG/CRIST09.GIF"></CENTER><P>La densit&eacute; est proportionnelle &agrave; la mobilit&eacute; des charges, &agrave; leur nombre, et au champ &eacute;lectrique appliqu&eacute;.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C17">Conductivit&eacute; et r&eacute;sistivit&eacute;</A>.</FONT></H5><P>Si on reprend l'&eacute;quation [1] et la figure 2, on peut remplacer E par sa valeur dans l'&eacute;quation [5], soit&nbsp;:<P><CENTER><IMG SRC="CRISTAL.FIG/CRIST10.GIF"></CENTER><P>C'est la loi d'Ohm. La r&eacute;sistance R du tron&ccedil;on de mat&eacute;riau de section S et de longueur L est &eacute;gale &agrave;&nbsp;:<P><CENTER><IMG SRC="CRISTAL.FIG/CRIST11.GIF"></CENTER><P>Par d&eacute;finition, on appelle la conductivit&eacute; <IMG SRC="../BASE/ICONES/SIGMA.GIF" align=bottom> la valeur&nbsp;:<P><CENTER><IMG SRC="CRISTAL.FIG/CRIST12.GIF"></CENTER><P>La r&eacute;sistivit&eacute; <IMG SRC="../BASE/ICONES/RO.GIF" align=middle> est l'inverse de la conductivit&eacute;, &agrave; savoir&nbsp;:<P><CENTER><IMG SRC="CRISTAL.FIG/CRIST13.GIF"></CENTER><P>Une autre forme de la loi d'Ohm est dans ce cas&nbsp;:<P><CENTER><IMG SRC="CRISTAL.FIG/CRIST14.GIF"></CENTER><P>Exemples de valeurs de r&eacute;sistivit&eacute;&nbsp;:<P> - <IMG SRC="../BASE/ICONES/RO.GIF" align=middle> = 1E12<IMG SRC="../BASE/ICONES/OHM.GIF" align=bottom> m pour le diamant (isolant)<P> - <IMG SRC="../BASE/ICONES/RO.GIF" align=middle> = 1,7E-8<IMG SRC="../BASE/ICONES/OHM.GIF" align=bottom> m pour le cuivre (conducteur)</UL><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C18">Influence de la temp&eacute;rature</A>.</FONT></H5><P>La temp&eacute;rature, en augmentant, va accro&icirc;tre l'agitation des particules dans la mati&egrave;re, et ainsi g&ecirc;ner leur d&eacute;placement lors de l'application d'un champ &eacute;lectrique externe. La r&eacute;sistivit&eacute; du mat&eacute;riau va augmenter.<P>Cette augmentation de la r&eacute;sistivit&eacute; avec la temp&eacute;rature est une loi lin&eacute;aire, et peut se mettre sous la forme&nbsp;:<P><CENTER><IMG SRC="CRISTAL.FIG/CRIST15.GIF"></CENTER><P>a est la constante du mat&eacute;riau, <IMG SRC="../BASE/ICONES/RO.GIF" align=middle> o la r&eacute;sistivit&eacute; &agrave; To et <IMG SRC="../BASE/ICONES/RO.GIF" align=middle> la r&eacute;sistivit&eacute; &agrave; la temp&eacute;rature T.<P>a vaut 4E-3K<SUP>-1</SUP> pour le cuivre. Cela signifie que la r&eacute;sistance d'un conducteur de cuivre va varier de 1% tous les 2,5&#176;C. On en tiendra compte lorsqu'on fera de telles mesures&nbsp;!</OL></OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="C19">LES SEMI-CONDUCTEURS</A>.</H3><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="C20">INTRODUCTION</A>.</H4><P>Nous venons de voir que les charges &eacute;lectriques sont plus ou moins libres de circuler dans la mati&egrave;re sous l'influence d'un champ &eacute;lectrique externe. Cette propri&eacute;t&eacute; nous a permis de distinguer les isolants (liaisons tr&egrave;s robustes, charges &eacute;lectriques tr&egrave;s peu mobiles) des conducteurs (liaisons fragiles, charges tr&egrave;s mobiles).<P>Les semi-conducteurs se situent entre ces deux extr&ecirc;mes (d'ou leur nom&nbsp;!). On va aussi pouvoir obtenir les caract&eacute;ristiques d&eacute;sir&eacute;es en appliquant les transformations physico-chimiques ad&eacute;quates. Il en r&eacute;sultera plusieurs sortes de semi-conducteurs que l'on pourra combiner pour obtenir des fonctionnements bien d&eacute;termin&eacute;s.<P>&nbsp;<LI><H4><A NAME="C21">G&Eacute;N&Eacute;RALIT&Eacute;S SUR LES SEMI-CONDUCTEURS</A>.</H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C22">Semi conducteurs intrins&egrave;ques</A>.</FONT></H5><P>Un semi conducteur est constitu&eacute; par un r&eacute;seau cristallin de mat&eacute;riau tr&egrave;s pur. On utilise soit des &eacute;l&eacute;ments du tableau p&eacute;riodique poss&eacute;dant chacun 4 &eacute;lectrons de valence, soit des combinaisons de mat&eacute;riaux qui poss&egrave;dent 3 et 5 &eacute;lectrons de valence. Les atomes sont li&eacute;s  entre eux par des liaisons covalentes. Ces liaisons sont robustes, ce qui fait que pour arracher des &eacute;lectrons des atomes, il faut fournir une &eacute;nergie assez importante (environ 1eV, contre 0,1 eV pour les conducteurs et 5eV pour les isolants).<P><CENTER><IMG SRC="CRISTAL.FIG/CRIST16.GIF"></CENTER><P><CENTER>Fig. 3. liaisons dans un cristal de silicium.</CENTER>Les trois principaux semi conducteurs utilis&eacute;s en &eacute;lectronique sont :<P> - le silicium (Si) : c'est le mat&eacute;riau le plus utilis&eacute; actuellement pour la fabrication des composants &eacute;lectroniques.<P> - le germanium (Ge) : il est d&eacute;laiss&eacute; (trop sensible en temp&eacute;rature : courants de fuite importants, temp&eacute;rature de fonctionnement limit&eacute;e).<P> - l'arseniure de gallium (AsGa) : il est tr&egrave;s utilis&eacute; dans la fabrication de composants opto &eacute;lectroniques, et permet aussi de fabriquer des composants plus rapides que ceux en silicium ; ces applications sont cependant relativement rares.<P>Les semi conducteurs ont une r&eacute;sistivit&eacute; &eacute;lectrique interm&eacute;diaire entre les isolants (1E14 &agrave; 1E22 <IMG SRC="../BASE/ICONES/OHM.GIF" align=bottom> cm) et les bons conducteurs (1E-6 <IMG SRC="../BASE/ICONES/OHM.GIF" align=bottom> cm) : elle est  comprise entre 1E2 et 1E9 <IMG SRC="../BASE/ICONES/OHM.GIF" align=bottom> cm.<P>L'agitation thermique fait que certains &eacute;lectrons quittent leur liaison et deviennent des &eacute;lectrons libres. Ils cr&eacute;ent alors un trou qui ne demande qu'&agrave; &ecirc;tre rebouch&eacute; par un autre &eacute;lectron libre, surtout si on applique un champ &eacute;lectrique sur le cristal : &eacute;lectrons et trous se d&eacute;placent en sens inverse, engendrant ainsi un courant &eacute;lectrique.<P>Contrairement &agrave; ce qui se passe dans les conducteurs, la r&eacute;sistivit&eacute; des semi conducteurs diminue quand la temp&eacute;rature augmente : en effet, plus la temp&eacute;rature est &eacute;lev&eacute;e, plus le nombre de trous et d'&eacute;lectrons libres augmente, et plus le courant produit est intense quand on branche un g&eacute;n&eacute;rateur sur le cristal.<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C23">Semi conducteurs extrins&egrave;ques</A>.</FONT></H5><P>Les semi conducteurs intrins&egrave;ques n'ont pas une grande utilit&eacute; en tant que tels ; ils servent de base aux semi conducteurs dop&eacute;s : on y rajoute des impuret&eacute;s pour modifier leur comportement. Il existe deux types de semi conducteurs extrins&egrave;ques :<UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C24">Le semi conducteur de type P</A>.<A HREF="ANNEXE/TYPEP.GIF" target=_blank> (GIF 17ko)</A> </FONT></H5><P>On dope le cristal intrins&egrave;que avec un &eacute;l&eacute;ment poss&eacute;dant un nombre inf&eacute;rieur d'&eacute;lectrons de valence : on peut doper du silicium (4 &eacute;lectrons de valence) avec du Bore, de l'indium, du Gallium ou de l'Aluminium qui poss&egrave;dent 3 &eacute;lectrons de valence (atome accepteur).<P>Ces atomes vont prendre la place d'atomes de silicium dans le cristal. Comme ils poss&egrave;dent 1 &eacute;lectron de valence en moins, il va se cr&eacute;er des trous dans le semi-conducteur. Les trous deviennent porteurs de charges mobiles majoritaires&nbsp;: le semi conducteur est de type P. Il subsistera quelques &eacute;lectrons libres dans le cristal (porteurs minoritaires).<P>Les trous ainsi cr&eacute;&eacute;s vont &ecirc;tre susceptibles d'&ecirc;tre  bouch&eacute;s  par des &eacute;lectrons pr&eacute;sents dans le cristal (par exemple, des &eacute;lectrons issus de paires &eacute;lectron-trou g&eacute;n&eacute;r&eacute;s par l'agitation thermique).<P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="C25">Le semi conducteur de type N</A>.<A HREF="ANNEXE/TYPEN.GIF" target=_blank> (GIF 17ko)</A></FONT></H5><P>Le principe est le m&ecirc;me que pour le semi conducteur de type P, sauf qu'on dope le cristal avec des &eacute;l&eacute;ments ayant un &eacute;lectron de valence de plus (atomes donneurs)&nbsp;: le phosphore, l'arsenic et l'antimoine, qui poss&egrave;dent 5 &eacute;lectrons de valence pourront doper le silicium par exemple. 4 &eacute;lectrons vont faire des liaisons covalentes avec les atomes de silicium environnants, et le 5&egrave;me sera un &eacute;lectron libre ; tous ces &eacute;lectrons libres seront les porteurs majoritaires. Il existera encore quelques trous, mais en tr&egrave;s faible quantit&eacute;.<P>Les &eacute;lectrons libres seront pratiquement aussi mobiles que dans le cas des conducteurs (liaisons m&eacute;talliques).<P>Anoter que dans ce cas, l'atome donneur devient ion positif, mais ceci ne cr&eacute;&eacute; pas un porteur  trou  comme dans le cas du silicium P, car cette charge positive ne peut pas se d&eacute;placer dans le cristal.<P>A noter que dans les deux cas (types N et P), <STRONG>le cristal reste globalement &eacute;lectriquement neutre</STRONG>, car le noyau des atomes donneurs comporte un proton de plus que l'atome du cristal intrins&egrave;que, et un de moins dans le cas des atomes accepteurs. Le dopage permet d'avoir beaucoup plus de porteurs d'une esp&egrave;ce donn&eacute;e que de l'autre, et il a apport&eacute; une fragilit&eacute; suppl&eacute;mentaire dans les liaisons atomiques : l'&eacute;nergie n&eacute;cessaire pour arracher un porteur majoritaire d'un atome est d'environ 0,1eV : il y aura plus de charges participant &agrave; la circulation du courant que dans un cristal intrins&egrave;que.</UL></OL><P>&nbsp;<LI><H4><A NAME="C26">Conduction</A></H4><P>En pratique, seuls les &eacute;lectrons se d&eacute;placent. Au niveau mobilit&eacute; des charges, on voit que pour le silicium N, les charges mobiles sont les &eacute;lectrons  libres , dont l'&eacute;nergie de liaison se situe dans la bande de conduction (il faut tr&egrave;s peu d'&eacute;nergie pour les arracher de leur atome donneur) : ils vont donc &ecirc;tre tr&egrave;s mobiles.<P>Pour le silicium P, le d&eacute;placement de trous se fera en fait par d&eacute;placement d'&eacute;lectrons qui seront oblig&eacute;s de venir des autres liaisons covalentes (g&eacute;n&eacute;ration de paires &eacute;lectron-trou), donc de la bande de valence (il faut fournir une &eacute;nergie relativement &eacute;lev&eacute;e pour cr&eacute;er ces paires de porteurs) : ils vont &ecirc;tre beaucoup moins mobiles que les &eacute;lectrons libres du silicium N, ce qui explique que la conductivit&eacute; du silicium P soit plus faible que celle du N.<P>La conduction est le r&eacute;sultat de trois termes :<P> - Conduction par champ &eacute;lectrique : un champ externe va fournir suffisamment d'&eacute;nergie aux &eacute;lectrons libres (N) ou au  trous  (P) : en fait, les &eacute;lectrons de valence voisins du trou) pour qu'ils se d&eacute;placent. On a une conduction dans un barreau de silicium monocristal (N ou P). La conduction est meilleure dans le N &agrave; cause de ce qui a &eacute;t&eacute; dit pr&eacute;c&eacute;demment.<P> - Conduction par diffusion des porteurs : n'existe pas dans un cristal homog&egrave;ne. Ce ph&eacute;nom&egrave;ne est d&ucirc; &agrave; l'h&eacute;t&eacute;rog&eacute;n&eacute;&iuml;t&eacute; du mat&eacute;riau (jonction, dopage non homog&egrave;ne ) : il y a un gradient de concentration des charges qui se d&eacute;placent pour se r&eacute;partir de fa&ccedil;on homog&egrave;ne dans le cristal &agrave; la mani&egrave;re des gaz.<P> - Conduction par cr&eacute;ation/recombinaison de charges : ceci concerne les charges libres minoritaires, qui peuvent &ecirc;tre cr&eacute;&eacute;es de diverses mani&egrave;res : &eacute;mission photonique, avalanche, passage de la barri&egrave;re de potentiel d'une jonction  Ces charges en exc&egrave;s se recombinent avec les porteurs majoritaires selon une loi exponentielle de constante de temps &eacute;gale &agrave; la dur&eacute;e de vie des porteurs.</OL></OL></BODY></HTML>