<HTML><HEAD><TITLE>FET.HTM</TITLE></HEAD><BODY><CENTER><IMG SRC="../BASE/ICONES/NAV.GIF"></CENTER><P align=center>Si votre &eacute;cran ne se pr&eacute;sente pas comme ceci, <A HREF="FET.HTM" target="_top"> cliquez l&agrave; </A><OL TYPE=I><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="F01">INTRODUCTION.</A></H3>Nous avons vu au chapitre pr&eacute;c&eacute;dent que le transistor &agrave; jonction &eacute;tait une source de courant command&eacute;e par un courant. Cette caract&eacute;ristique permet &agrave; ce type de composants d'amplifier des signaux alternatifs.<P>Du point de vue th&eacute;orique, on peut imaginer d'autres dispositifs similaires, mais caract&eacute;ris&eacute;s par un mode d'attaque diff&eacute;rent&nbsp;: par exemple, une source de courant command&eacute;e par une tension. Le principe reste le m&ecirc;me (une source command&eacute;e), seule la nature du signal de commande change.<P>Cet objet th&eacute;orique existe&nbsp;: la famille des transistors &agrave; effet de champ (Field Effect Transistor en anglais, FET) r&eacute;pond &agrave; la d&eacute;finition pr&eacute;c&eacute;dente&nbsp;: ce sont des sources de courant command&eacute;es en tension.<P>De ce point de vue, on con&ccedil;oit ais&eacute;ment que l'&eacute;tude des FET va &ecirc;tre en tous points similaires &agrave; celle des transistors &agrave; jonction, et ce, malgr&eacute; un fonctionnement microscopique compl&egrave;tement diff&eacute;rent.<P>Il ne faudra donc surtout pas se polariser sur les diff&eacute;rences de structure et de fonctionnement prises du point de vue cristallographique, mais voir au contraire toutes les similitudes existant avec le transistor &agrave; jonction&nbsp;: polarisation, conversion courant / tension, amplification en r&eacute;gime des petits signaux <P>Ces similitudes sont dues aussi en grande partie au fait qu'on utilise les m&ecirc;mes outils de mod&eacute;lisation pour les deux composants.<P><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="F02">LE TRANSISTOR FET &Agrave; JONCTION.</A></H3><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="F03">PRINCIPE DE FONCTIONNEMENT.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F04">Constitution d'un FET.</A></FONT></H5>De m&ecirc;me qu'il existe deux types de transistors bipolaires (NPN et PNP), le FET &agrave; jonction (ou JFET) est d&eacute;clin&eacute; en deux versions&nbsp;: le <STRONG>canal N</STRONG> et le <STRONG>canal P</STRONG>.<P>Le FET &agrave; jonction canal N est constitu&eacute; d'une mince plaquette de silicium N qui va former le canal conducteur principal. Cette plaquette est recouverte partiellement d'une couche de silicium P de mani&egrave;re &agrave; former une jonction PN lat&eacute;rale par rapport au canal (Fig. 1.).<P><CENTER><IMG SRC="FET.FIG/FET01.GIF"></CENTER><CENTER><P>Fig. 1. FET &agrave; jonction &agrave; canal N (principe).<P></CENTER>Le courant circulera dans le canal, rentrant par une premi&egrave;re &eacute;lectrode, le <STRONG>drain</STRONG> et sortant par une deuxi&egrave;me, la <STRONG>source</STRONG>. L'&eacute;lectrode connect&eacute;e &agrave; la couche de silicium P sert &agrave; commander la conduction du courant dans le canal&nbsp;; on l'appelle la <STRONG>grille</STRONG>, par analogie avec l'&eacute;lectrode du m&ecirc;me nom pr&eacute;sente sur les tubes &agrave; vides.<P>Le transistor FET fonctionnera toujours avec la jonction grille-canal polaris&eacute;e en inverse.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F05">Ph&eacute;nom&egrave;ne de pincement.</A></FONT></H5><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F06">Tension drain-source nulle.</A></FONT></H5>Pour simplifier le raisonnement, nous allons consid&eacute;rer dans un premier temps un montage (Fig. 2.) o&ugrave; le canal est court-circuit&eacute; (V<SUB>DS</SUB> = 0) et o&ugrave; la grille est &agrave; un potentiel n&eacute;gatif par rapport au canal (jonction polaris&eacute;e en inverse).<P>Nous avons vu dans le chapitre consacr&eacute; &agrave; la diode que le fait de <A HREF="../DIODE/COURS.HTM#D06" target=_blank>polariser la jonction en inverse</A> cr&eacute;ait une zone vide de porteurs, appel&eacute;e zone de d&eacute;pl&eacute;tion&nbsp;: les trous de la zone P se recombinent avec les &eacute;lectrons de la zone N, cr&eacute;ant ainsi une zone neutre (il n'y a plus de porteurs pour assurer la conduction &eacute;lectrique) d'&eacute;paisseur w&nbsp;=&nbsp;k|V<SUB>GS</SUB>|.<P><CENTER><IMG SRC="FET.FIG/FET02.GIF"></CENTER><CENTER><P>Fig. 2. Modulation de conductivit&eacute; &agrave; V<SUB>DS</SUB> = 0.<P></CENTER>Il reste dans le canal N une zone conductrice d'&eacute;paisseur (h-w). La r&eacute;sistance entre drain et source sera alors &eacute;gale &agrave;&nbsp;:<P><CENTER><IMG SRC="FET.FIG/FET03.GIF"></CENTER><P>o&ugrave; b est la largeur du canal et <IMG SRC="../BASE/ICONES/RO.GIF" align=middle> sa r&eacute;sistivit&eacute;. La r&eacute;sistance R<SUB>DS</SUB> varie donc avec la tension (inverse) appliqu&eacute;e sur la jonction grille-canal. A la limite, pour V<SUB>GS</SUB> = V<SUB>P</SUB>, appel&eacute;e tension de pincement, la zone de d&eacute;pl&eacute;tion  &nbsp;ferme&nbsp;  le canal&nbsp;: il n'y a plus de porteurs, et la r&eacute;sistance entre source et drain tend vers l'infini (Fig.3.)&nbsp;: c'est le ph&eacute;nom&egrave;ne de pincement.<P><CENTER><IMG SRC="FET.FIG/FET04.GIF"></CENTER><CENTER><P>Fig. 3. Ph&eacute;nom&egrave;ne de pincement.<P> </CENTER><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F07">Tension drain-source non nulle.</A></FONT></H5>Si on reprend le montage pr&eacute;c&eacute;dent, et qu'en plus on applique une tension positive entre le drain et la source, le gradient de potentiel  pr&eacute;sent tout le long du barreau de silicium constituant le canal va modifier le profil de la zone de d&eacute;pl&eacute;tion. Vers le drain, la tension grille-canal sera sup&eacute;rieure (en valeur absolue) &agrave; ce qu'elle est vers la source. En effet, on a la relation (attention, tous les termes sont n&eacute;gatifs)&nbsp;:<P><CENTER><IMG SRC="FET.FIG/FET05.GIF"></CENTER><P>En cons&eacute;quence, la zone isolante pr&eacute;sente une forme similaire &agrave; celle donn&eacute;e sur la figure 4.<P><CENTER><IMG SRC="FET.FIG/FET06.GIF"></CENTER><CENTER><P>Fig. 4. Modulation de conductivit&eacute; pour V<SUB>DS</SUB> non nul.<P></CENTER>Sur cette figure, le canal n'est pas compl&egrave;tement bouch&eacute;. Si on augmente la tension V<SUB>DS</SUB>, &agrave; V<SUB>GS</SUB> donn&eacute;e, l'&eacute;paisseur isolante w<SUB>2</SUB> va augmenter&nbsp;; &agrave; partir d'une certaine tension V<SUB>DS</SUB>, correspondant &agrave; une largeur du canal tr&egrave;s faible, le courant va tendre vers une valeur constante, car deux ph&eacute;nom&egrave;nes contradictoires vont s'&eacute;quilibrer&nbsp;:<P> - une augmentation de V<SUB>DS</SUB> devrait entra&icirc;ner un accroissement du courant dans le canal (loi d'ohm),<P> - mais cette augmentation de V<SUB>DS</SUB> va accro&icirc;tre la tension VDG, qui aura pour effet d'agrandir la zone de d&eacute;pl&eacute;tion et entra&icirc;ner une diminution de la largeur du canal, donc, de sa r&eacute;sistivit&eacute;.<P>Un accroissement de la tension V<SUB>DS</SUB> ne va donc pas entra&icirc;ner une augmentation du courant dans le canal (le courant de drain), mais une augmentation de la r&eacute;sistivit&eacute; de ce canal. Le courant de drain va tendre vers une valeur constante.<P></UL></OL><P>&nbsp;<LI><H4><A NAME="F08">CARACT&Eacute;RISTIQUES.</A></H4>A partir de ce qui a &eacute;t&eacute; dit dans le paragraphe pr&eacute;c&eacute;dent, on peut d&eacute;j&agrave; deviner trois choses&nbsp;:<P> - Si V<SUB>GS</SUB> = V<SUB>P</SUB>, dans tous les cas, quelle que soit la tension V<SUB>DS</SUB>, le courant dans le canal sera nul. En effet, une tension V<SUB>DS</SUB> non nulle ne fera que renforcer le ph&eacute;nom&egrave;ne de pincement.<P> - Le courant de drain deviendra d'autant plus vite constant que la tension |V<SUB>GS</SUB>| sera plus &eacute;lev&eacute;e.<P> - Le courant constant maximum sera obtenu pour une tension grille-source nulle.<P>Les caract&eacute;ristiques du FET s'en d&eacute;duisent ais&eacute;ment.<P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F09">Caract&eacute;ristique d'entr&eacute;e.</A></FONT></H5>Nous avons vu que le FET sera toujours utilis&eacute; avec une polarisation grille-canal n&eacute;gative, soit V<SUB>GS</SUB> &lt; 0. La caract&eacute;ristique correspondante est donc celle d'un interrupteur ouvert&nbsp;: courant nul quelque soit la tension appliqu&eacute;e. En pratique, on aura un tr&egrave;s l&eacute;ger courant de fuite caract&eacute;ristique d'une <A HREF="../DIODE/COURS.HTM#D11" target=_blank>jonction diode polaris&eacute;e en inverse</A>. Ce courant double tous les 6&#176;C pour le silicium. A temp&eacute;rature ambiante, il sera inf&eacute;rieur au  &#181;A, et plut&ocirc;t de l'ordre de quelques nA.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F10">Caract&eacute;ristiques  de sortie et de transfert.</A></FONT></H5>La figure 5 repr&eacute;sente les caract&eacute;ristiques de transfert I<SUB>DS</SUB>&nbsp;=&nbsp;f&nbsp;(V<SUB>GS</SUB>) &agrave; gauche, et de sortie I<SUB>DS</SUB>&nbsp;=&nbsp;f&nbsp;(V<SUB>DS</SUB>&nbsp;,&nbsp;V<SUB>GS</SUB>) &agrave; droite.<P><CENTER><IMG SRC="FET.FIG/FET07.GIF"></CENTER><CENTER><P>Fig. 5. Caract&eacute;ristiques du FET &agrave; jonction.<P></CENTER>La caract&eacute;ristique de sortie peut &ecirc;tre d&eacute;compos&eacute;e en deux grandes zones&nbsp;:<P> - la partie correspondant au fonctionnement &agrave; courant constant (zone de pincement), et qui servira &agrave; l'amplification de petits signaux de la m&ecirc;me mani&egrave;re que pour le transistor bipolaire.<P> - la zone ohmique (en gris&eacute; sur la figure 5.)&nbsp;: dans cette zone, le FET est assimilable &agrave; une r&eacute;sistance dont la valeur est fonction de la tension V<SUB>GS</SUB>. On ne repr&eacute;sente que la partie positive de la caract&eacute;ristique, mais en fait, le canal conducteur peut laisser passer le courant dans les deux sens (c'est juste un barreau de silicium conducteur, ce n'est pas une jonction. Le seul d&eacute;faut qui limite les valeurs n&eacute;gatives de V<SUB>DS</SUB> est le fait qu'au del&agrave; d'une certaine tension n&eacute;gative de drain, la tension grille-drain devient positive, la jonction grille-canal &eacute;tant alors polaris&eacute;e en direct&nbsp;; le FET ne fonctionne plus correctement. N&eacute;anmoins, et &agrave; condition de rester dans le domaine des petits signaux (quelques dizaines &agrave; quelques centaines de mV), on peut consid&eacute;rer le FET comme une r&eacute;sistance dont la valeur est pilot&eacute;e en tension.<P>On notera que les caract&eacute;ristiques de sortie ont une allure connue&nbsp;: on retrouve celles du transistor bipolaire. La principale diff&eacute;rence provient du mode d'attaque, comme indiqu&eacute; en introduction&nbsp;: le FET est command&eacute; en tension, et non en courant, comme l'est le bipolaire.<P>Ce r&eacute;seau de courbes est born&eacute; en bas (I<SUB>D</SUB>&nbsp;=&nbsp;0, V<SUB>GS</SUB>&nbsp;=&nbsp;V<SUB>P</SUB>), et en haut (I<SUB>D</SUB>&nbsp;=&nbsp;I<SUB>DSS</SUB>, V<SUB>GS</SUB>&nbsp;=&nbsp;0). I<SUB>DSS</SUB> est la valeur maxi de courant de drain qui pourra circuler dans le composant. Cette valeur est de l'ordre de quelques mA &agrave; quelques dizaines de mA pour les FETs courants. La tension de pincement V<SUB>P</SUB> est de l'ordre de quelques volts (typiquement de -2 &agrave; -8V).<P>La zone ohmique est sensiblement diff&eacute;rente de la <A HREF="../TRANS/COURS.HTM#T16" target=_blank>zone de saturation du transistor bipolaire</A>. La fonction  &nbsp;r&eacute;sistance command&eacute;e&nbsp;  est sp&eacute;cifique au FET et ne peut pas &ecirc;tre r&eacute;alis&eacute;e de cette fa&ccedil;on avec un transistor bipolaire.<P>Pour une m&ecirc;me r&eacute;f&eacute;rence de FET (2N3819 par exemple), la dispersion de I<SUB>DSS</SUB> et V<SUB>P</SUB> sera tr&egrave;s importante, plus encore que la dispersion observ&eacute;e pour les caract&eacute;ristiques des transistors bipolaires. Ceci fait que ces transistors ne pourront pas &ecirc;tre utilis&eacute;s sans pr&eacute;cautions dans des montages pointus, ni &agrave; plus forte raison, dans des montages de pr&eacute;cision.<P>La caract&eacute;ristique de transfert  I<SUB>DS</SUB>&nbsp;=&nbsp;f&nbsp;(V<SUB>GS</SUB>) r&eacute;sume bien les limites du FET&nbsp;: courant de drain nul pour une tension V<SUB>GS</SUB> &eacute;gale &agrave; la tension de pincement V<SUB>P</SUB>, et courant maxi I<SUB>DSS</SUB> pour une tension V<SUB>GS</SUB> nulle. La courbe est assez bien approxim&eacute;e par une parabole d'&eacute;quation&nbsp;:<P><CENTER><IMG SRC="FET.FIG/FET08.GIF"></CENTER><P>La d&eacute;riv&eacute;e de cette loi va nous renseigner sur l'aptitude du transistor &agrave; amplifier&nbsp;: en effet, pour un courant I<SUB>DS</SUB> donn&eacute;, la d&eacute;riv&eacute;e (qu'on appelle judicieusement la pente du FET) va &ecirc;tre &eacute;gale &agrave;&nbsp;:<P><CENTER><IMG SRC="FET.FIG/FET09.GIF"></CENTER><P>Cette pente est le rapport de la variation du param&egrave;tre de sortie (I<SUB>DS</SUB>) et du param&egrave;tre d'entr&eacute;e (V<SUB>GS</SUB>)&nbsp;; elle est bien repr&eacute;sentative de l'amplification d'un signal d'entr&eacute;e. La valeur maximum, atteinte pour V<SUB>GS</SUB> = 0, vaut&nbsp;:<P><CENTER><IMG SRC="FET.FIG/FET10.GIF"></CENTER><P>On peut alors exprimer l'&eacute;quation [4] sous la forme condens&eacute;e suivante&nbsp;:<P><CENTER><IMG SRC="FET.FIG/FET11.GIF"></CENTER><P>La pente du FET est en moyenne relativement faible, soit quelques mA/V, au mieux quelques dizaines de mA/V. Elle d&eacute;pend de la tension V<SUB>GS</SUB> (la tension de polarisation)&nbsp;: comme pour le transistor bipolaire, l'amplification ne sera pas lin&eacute;aire&nbsp;; on fera l&agrave; aussi des hypoth&egrave;ses de fonctionnement en petits signaux.<P>On peut d'ailleurs faire un parall&egrave;le avec l'amplification du transistor bipolaire. A elle seule, la caract&eacute;ristique de transfert du FET correspond &agrave; la caract&eacute;ristique globale <A HREF="../TRANS/COURS.HTM#T14" target=_blank>entr&eacute;e + transfert  du bipolaire</A>. En effet, dans ce dernier, la vraie caract&eacute;ristique de transfert est une transformation courant-courant I<SUB>C</SUB>&nbsp;=f&nbsp;(I<SUB>B</SUB>), la caract&eacute;ristique d'entr&eacute;e op&eacute;rant la conversion tension-courant. De ce point de vue, on peut consid&eacute;rer le bipolaire comme un g&eacute;n&eacute;rateur de courant command&eacute; en tension (la diff&eacute;rence avec le FET est qu'il consomme du courant). La pente du transistor bipolaire (le rapport  <IMG SRC="../BASE/ICONES/DELTA.GIF" align=bottom>I<SUB>C</SUB>&nbsp;/&nbsp;<IMG SRC="../BASE/ICONES/DELTA.GIF" align=bottom>V<SUB>BE</SUB>) vaut alors&nbsp;:<P><CENTER><IMG SRC="FET.FIG/FET12.GIF"></CENTER><P>Pour un courant collecteur de 1,3mA et un <IMG SRC="../BASE/ICONES/BETA.GIF" align=middle> de 150, le h<SUB>11e</SUB> vaut 3k<IMG SRC="../BASE/ICONES/OHM.GIF">, ce qui fait une pente d'environ 50mA/V.<P>La pente du transistor bipolaire est environ 5 &agrave; 10 fois plus &eacute;lev&eacute;e que celle d'un FET typique. L'amplification qu'on pourra attendre d'un FET sera plus faible que celle obtenue dans les m&ecirc;mes conditions avec un bipolaire.<P></OL><P>&nbsp;<LI><H4><A NAME="F11">REPR&Eacute;SENTATION. SCH&Eacute;MA &Eacute;QUIVALENT.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F12">Symboles des FETs.</A></FONT></H5>Le FET est repr&eacute;sent&eacute; par les symboles suivants&nbsp;:<P><CENTER><IMG SRC="FET.FIG/FET13.GIF"></CENTER><CENTER><P>Fig. 6. Symboles &eacute;lectriques des FETs.<P></CENTER>La fl&egrave;che repr&eacute;sente la jonction grille / canal, et son sens indique quel serait le sens du courant si la jonction &eacute;tait passante.<P>Pour le FET canal N, le courant I<SUB>D</SUB> circulera dans le sens repr&eacute;sent&eacute; sur la figure 6, la tension V<SUB>DS</SUB> sera positive et la tension V<SUB>GS</SUB> n&eacute;gative.<P>Pour le FET canal P, la tension V<SUB>DS</SUB> sera n&eacute;gative et la tension V<SUB>GS</SUB> positive. Le courant de drain circulera de la source vers le drain.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F13">Sch&eacute;ma &eacute;quivalent en petits signaux.</A></FONT></H5>Ce sch&eacute;ma, comme pour le transistor bipolaire, concerne un composant convenablement polaris&eacute;&nbsp;: le fonctionnement se fera dans la zone de pincement.<P>On construit le <A HREF="../OUTILS/COURS.HTM#O60" target=_blank>sch&eacute;ma &eacute;quivalent</A> de la m&ecirc;me mani&egrave;re que pour le transistor bipolaire.<P><CENTER><IMG SRC="FET.FIG/FET14.GIF"></CENTER><CENTER><P>Fig. 7. Sch&eacute;ma &eacute;quivalent alternatif petits signaux.<P></CENTER>Le sch&eacute;ma fig. 7. est celui relatif au FET canal N. L'entr&eacute;e se fait sur la grille. On note un  &nbsp;trou&nbsp;  entre grille et source&nbsp;: l'imp&eacute;dance grille-source est tr&egrave;s &eacute;lev&eacute;e, on la consid&egrave;re en premi&egrave;re approximation comme infinie. En sortie, on retrouve les m&ecirc;mes &eacute;l&eacute;ments que pour le transistor bipolaire&nbsp;: une source de courant (command&eacute;e par la tension V<SUB>GS</SUB>, et non par un courant), et sa r&eacute;sistance parall&egrave;le <IMG SRC="../BASE/ICONES/RO.GIF" align=middle>. Comme pour le transistor bipolaire, cette r&eacute;sistance est tr&egrave;s &eacute;lev&eacute;e (plusieurs centaines de k<IMG SRC="../BASE/ICONES/OHM.GIF">), et on la n&eacute;gligera dans toutes les applications courantes.<P></OL><P>&nbsp;<LI><H4><A NAME="F14">MONTAGE SOURCE COMMUNE.</A></H4>Ce montage est le pendant du montage &eacute;metteur commun pour le bipolaire. Le fonctionnement sera donc totalement similaire. Un montage drain commun existe aussi, qui est le pendant du montage collecteur commun du bipolaire&nbsp;; ce montage n'a toutefois que peu d'int&eacute;r&ecirc;t, car le FET est un composant &agrave; tr&egrave;s forte imp&eacute;dance d'entr&eacute;e, et ce, on va le voir, m&ecirc;me lorsqu'il est utilis&eacute; en source commune.<P>Nous allons voir le montage source commune pour le FET de type N. Le montage &agrave; canal P s'en d&eacute;duit ais&eacute;ment.<P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F15">Polarisation.</A></FONT></H5>Il faut tout d'abord noter que la zone ohmique est relativement &eacute;tendue, surtout vers les fortes valeurs de I<SUB>DS</SUB>. On veillera &agrave; polariser le composant pour que la tension de repos V<SUB>DSo</SUB> ne soit pas trop faible, de mani&egrave;re &agrave; ce qu'il fonctionne dans la zone  &nbsp;g&eacute;n&eacute;rateur de courant&nbsp; .<P><CENTER><IMG SRC="FET.FIG/FET15.GIF"></CENTER><CENTER><P>Fig. 8. Montage source commune.<P></CENTER>Nous avons vu lors de l'explication du principe de fonctionnement du FET que le bon fonctionnement n&eacute;cessitait une alimentation positive pour polariser le canal drain-source, et une alimentation n&eacute;gative pour polariser la grille par rapport &agrave; la source. Ce raisonnement est valable si on place la source &agrave; la masse.<P>En pratique, on va relier la grille &agrave; la masse par une r&eacute;sistance de forte valeur&nbsp;; comme le courant qui circule dans la grille est tr&egrave;s faible (courant de fuite), le potentiel de la grille va &ecirc;tre pratiquement nul. Il reste &agrave; trouver une astuce pour mettre la source &agrave; un potentiel positif, ce qui fera V<SUB>SG</SUB> positif, donc V<SUB>GS</SUB> n&eacute;gatif. Pour ce faire, on intercale une r&eacute;sistance entre la source et la masse. Le courant de drain va circuler dans cette r&eacute;sistance et &eacute;lever le potentiel de la source par rapport &agrave; la grille. Deux ph&eacute;nom&egrave;nes vont alors se contrarier&nbsp;:<P> - Le courant de drain est maxi pour V<SUB>GS</SUB> = 0&nbsp;; au d&eacute;marrage, on aura donc un fort courant dans la r&eacute;sistance de source, donc une forte tension.<P> - mais, au fur et &agrave; mesure que la tension va augmenter, la tension |V<SUB>GS</SUB>| va augmenter aussi, ce qui va avoir pour effet de limiter le courant de drain.<P>Les deux ph&eacute;nom&egrave;nes vont s'&eacute;quilibrer. La valeur du courant de drain va d&eacute;pendre des caract&eacute;ristiques du FET (I<SUB>DSS</SUB> et V<SUB>P</SUB>), et de la r&eacute;sistance de source&nbsp;: c'est cette derni&egrave;re qui nous permettra d'ajuster le courant de drain.<P>La tension de polarisation sur R<SUB>S</SUB> sera de l'ordre de quelques volts (typiquement 1 &agrave; 3V).<P>Il ne reste plus qu'&agrave; alimenter  le drain &agrave; l'aide d'une source de tension, en intercalant une r&eacute;sistance R<SUB>D</SUB> qui aura pour fonction (comme pour le montage &eacute;metteur commun du bipolaire) la conversion courant / tension permettant d'exploiter le signal de sortie.<P>On choisira le courant de drain (ou la r&eacute;sistance R<SUB>D</SUB> ) de mani&egrave;re &agrave; ce que la chute de tension dans cette r&eacute;sistance soit &eacute;gale &agrave; la tension de polarisation V<SUB>DSo</SUB>, ceci pour assurer un maximum de dynamique au signal alternatif.<P>On rajoute un condensateur de d&eacute;couplage C<SUB>D</SUB> sur R<SUB>S</SUB> pour que la source soit effectivement &agrave; la masse en alternatif. Sans ce condensateur, on aurait un effet de contre r&eacute;action qui affaiblirait beaucoup le gain en tension.<P>Vu que la grille est au m&ecirc;me potentiel que la masse (autant dire z&eacute;ro&nbsp;!), le g&eacute;n&eacute;rateur d'entr&eacute;e, s'il d&eacute;livre uniquement un signal alternatif, peut &ecirc;tre coupl&eacute; directement &agrave; la grille, sans condensateur de liaison. La sortie se faisant sur le drain, en revanche n&eacute;cessite un condensateur de liaison pour ne pas perturber les &eacute;tages avals.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F16">Fonctionnement en petits signaux.</A></FONT></H5>Nous avons vu que la caract&eacute;ristique de transfert du FET n'est pas lin&eacute;aire&nbsp;: nous allons donc &ecirc;tre oblig&eacute;s de travailler en petits signaux pour pouvoir lin&eacute;ariser le montage et utiliser les lois fondamentales de l'&eacute;lectricit&eacute;.<P><UL TYPE=DISC><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F17">Sch&eacute;ma &eacute;quivalent.</A></FONT></H5>Le sch&eacute;ma &eacute;quivalent se construit de la m&ecirc;me mani&egrave;re que pour les montages &agrave; transistors bipolaires. On utilise le sch&eacute;ma &eacute;quivalent du FET de la figure 7, et on obtient&nbsp;:<P><CENTER><IMG SRC="FET.FIG/FET16.GIF"></CENTER><CENTER><P>Fig. 9. Sch&eacute;ma &eacute;quivalent en alternatif petits signaux.<P></CENTER>Ce sch&eacute;ma est tr&egrave;s similaire &agrave; celui de l'&eacute;metteur commun du transistor bipolaire. La diff&eacute;rence essentielle est que le g&eacute;n&eacute;rateur de courant est command&eacute; par la tension V<SUB>GS</SUB>, et non pas par un courant i<SUB>b</SUB>.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F18">Gain en tension.</A></FONT></H5>Les &eacute;quations sont quasiment triviales. En entr&eacute;e, on a&nbsp;:<P><CENTER><IMG SRC="FET.FIG/FET17.GIF"></CENTER><P>En sortie, si on n&eacute;glige <IMG SRC="../BASE/ICONES/RO.GIF" align=middle>, dont la valeur est tr&egrave;s &eacute;lev&eacute;e vis &agrave; vis de R<SUB>D</SUB>, on a :<P><CENTER><IMG SRC="FET.FIG/FET18.GIF"></CENTER><P>On en tire ais&eacute;ment le gain en tension &agrave; vide&nbsp;:<P><CENTER><IMG SRC="FET.FIG/FET19.GIF"></CENTER><P>Ce gain a une valeur relativement faible, due au fait que g ne d&eacute;passe gu&egrave;re la dizaine de mA/V&nbsp;: on aura des valeurs comprises entre 10 et 50 environ.<P>On peut faire l'analogie avec le montage &eacute;metteur commun en bipolaire, dont le gain &eacute;tait &eacute;gal &agrave;  -38,5 I<SUB>Co</SUB> R<SUB>C</SUB>. Le terme 38,5 I<SUB>Co</SUB> avait &eacute;t&eacute; appel&eacute; la  &nbsp;pente&nbsp;  du transistor. R<SUB>C</SUB> a la m&ecirc;me fonction que le R<SUB>D</SUB> du montage &agrave; FET, et pour des valeurs identiques de tension d'alimentation et de courant de drain / collecteur (par exemple 1mA), leur valeur sera la m&ecirc;me. La diff&eacute;rence se fera donc sur la pente, soit 38,5 mA/V pour le bipolaire contre 5 mA/V en typique pour le FET.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F19">Imp&eacute;dance d'entr&eacute;e.</A></FONT></H5>La solution est triviale&nbsp;:<P><CENTER><IMG SRC="FET.FIG/FET20.GIF"></CENTER><P>On veillera &agrave; ne pas choisir une valeur trop &eacute;lev&eacute;e tout de m&ecirc;me pour que la chute de tension occasionn&eacute;e par le courant de fuite de la grille soit n&eacute;gligeable. On choisira typiquement une valeur de l'ordre de quelques M<IMG SRC="../BASE/ICONES/OHM.GIF">. L'avantage sur les montages &agrave; bipolaires est &eacute;vident.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F20">Imp&eacute;dance de sortie.</A></FONT></H5>On se retrouve exactement dans le m&ecirc;me cas de figure que pour le montage &eacute;metteur commun du bipolaire. En op&eacute;rant la m&ecirc;me transformation norton-th&eacute;venin que pour ce dernier montage, on trouve &nbsp;:<P><CENTER><IMG SRC="FET.FIG/FET21.GIF"></CENTER><P>Cette valeur est moyenne, R<SUB>D</SUB> valant typiquement  quelques k<IMG SRC="../BASE/ICONES/OHM.GIF">. On ne pourra g&eacute;n&eacute;ralement pas utiliser ce montage sans un &eacute;tage adaptateur d'imp&eacute;dance en aval.<P></UL></OL><P>&nbsp;<LI><H4><A NAME="F21">UTILISATION EN R&Eacute;SISTANCE COMMAND&Eacute;E.</A></H4>Si on utilise le FET dans la zone ohmique, on peut faire varier la r&eacute;sistance du canal en modifiant la tension V<SUB>GS</SUB>. Le FET est utilis&eacute; dans un montage potentiom&eacute;trique (diviseur de tension) mettant en jeu la r&eacute;sistance R<SUB>DS</SUB> du canal et une r&eacute;sistance additionnelle R.<P>Sur le sch&eacute;ma figure 10, on remarque un r&eacute;seau r-r-C reliant le drain &agrave; la grille et &agrave; la commande. On pourrait appliquer directement la tension V<SUB>C</SUB> sur la grille, mais en rajoutant ce r&eacute;seau, on am&eacute;liore la lin&eacute;arit&eacute;, notamment pour des tensions V<SUB>E</SUB>, donc V<SUB>S</SUB> n&eacute;gatives&nbsp;: en effet, on a d&eacute;j&agrave; vu que dans ce cas, la jonction grille-canal est polaris&eacute;e en direct, et le FET ne travaille pas convenablement. En appliquant sur la grille la moiti&eacute; de la tension alternative pr&eacute;sente sur le drain, on am&eacute;liore sensiblement la lin&eacute;arit&eacute; et la tension maxi d'utilisation du FET en r&eacute;sistance command&eacute;e. Cette tension maxi demeure faible (quelques dizaines &agrave; quelques centaines de mV).<P><CENTER><IMG SRC="FET.FIG/FET22.GIF"></CENTER><CENTER><P>Fig. 10. Utilisation en r&eacute;sistance command&eacute;e.<P></CENTER>Cette fonction est utilis&eacute;e en particulier dans des amplificateurs &agrave; commande automatique de gain (CAG), qui permettent de garantir un niveau de sortie constant avec un niveau d'entr&eacute;e fluctuant (exemple&nbsp;: r&eacute;glage automatique du niveau d'enregistrement des magn&eacute;tophones &agrave; cassette audio bon march&eacute;s).<P>Une autre application d&eacute;duite de la fonction  &nbsp;r&eacute;sistance command&eacute;e&nbsp;  est le commutateur analogique&nbsp;: si on applique une tension sup&eacute;rieure ou &eacute;gale en valeur absolue &agrave; la tension de pincement V<SUB>P</SUB> sur la commande, la r&eacute;sistance de drain va devenir tr&egrave;s grande (quelques M<IMG SRC="../BASE/ICONES/OHM.GIF">). Si on choisit pour R une valeur moyenne (quelques dizaines de k<IMG SRC="../BASE/ICONES/OHM.GIF">), la tension V<SUB>S</SUB> sera quasiment &eacute;gale &agrave; la tension V<SUB>E</SUB>&nbsp;: tout le signal passe.<P>Si on applique maintenant une tension nulle sur la grille, la r&eacute;sistance du FET sera minimum (quelques centaines d'ohms), et la tension V<SUB>S</SUB> sera quasiment nulle.<P>On a ainsi r&eacute;alis&eacute; un commutateur analogique. Cette fonction est tr&egrave;s utilis&eacute;e sous forme de circuits int&eacute;gr&eacute;s et permet le multiplexage de signaux analogiques, une fonction indispensable pour les dispositifs d'acquisition de donn&eacute;es.<P><P>&nbsp;<LI><H4><A NAME="F22">SOURCE DE COURANT.</A></H4><CENTER><IMG SRC="FET.FIG/FET23.GIF"></CENTER><CENTER><P>Fig. 11. Source de courant &agrave; deux bornes.<P></CENTER>On a vu lors de la polarisation du montage source commune comment proc&eacute;der pour obtenir un courant de polarisation de drain constant. L'ajustage de la r&eacute;sistance de source d&eacute;finit le courant de drain. Si on retire du montage source commune la r&eacute;sistance de drain, on se retrouve avec un dispositif &agrave; deux bornes susceptible de garantir un courant constant dans le circuit sur lequel il sera branch&eacute;.<P>Des circuits int&eacute;gr&eacute;s existent, qui comprennent le FET et sa r&eacute;sistance de polarisation (la r&eacute;sistance de grille est ici inutile), et qui peuvent servir de sources de courant pr&eacute;r&eacute;gl&eacute;es. Des restrictions limitent toutefois leur usage&nbsp;:<P> - le composant est polaris&eacute;&nbsp;: le courant ne peut circuler que dans un seul sens.<P> - ce dispositif ne g&eacute;n&egrave;re pas de courant, il le r&eacute;gule (comme la z&eacute;ner r&eacute;gule une tension).<P> - la tension appliqu&eacute;e entre les deux bornes du composant doit &ecirc;tre au moins sup&eacute;rieure &agrave; la tension V<SUB>GS</SUB> de polarisation permettant le fonctionnement du FET dans sa zone de pincement.<P><P>&nbsp;<LI><H4><A NAME="F23">DOMAINE D'UTILISATION.</A></H4>De par sa constitution, le FET &agrave; jonction n'est pas adapt&eacute; du tout aux forts courants. Il va rester cantonn&eacute; aux applications d'amplification et de traitement des petits signaux.<P>Il est utilis&eacute; dans des montages &agrave; haute imp&eacute;dance d'entr&eacute;e et faible bruit&nbsp;: pr&eacute;amplificateurs pour signaux de faible niveau par exemple.<P>La fonction r&eacute;sistance command&eacute;e est beaucoup utilis&eacute;e. Il y a bien s&ucirc;r des restrictions d'utilisation&nbsp;: la portion de caract&eacute;ristique ohmique est lin&eacute;aire pour des faibles variations de tension (gu&egrave;re plus de 100mV), ce qui n&eacute;cessite des pr&eacute;cautions de mise en &#156;uvre.<P>Mais, le JFET, de par la dispersion de ses caract&eacute;ristiques d'un composant &agrave; l'autre reste difficile &agrave; ma&icirc;triser dans des montages &agrave; composants discrets. On a int&eacute;r&ecirc;t &agrave; les trier si on d&eacute;sire un r&eacute;sultat fiable et r&eacute;p&eacute;table.<P>Dans ces conditions, l'utilisation la plus importante qui est faite de ces transistors est l'int&eacute;gration dans des composants tels les amplificateurs op&eacute;rationnels&nbsp;: la tr&egrave;s forte imp&eacute;dance d'entr&eacute;e des JFET leur donne un avantage d&eacute;cisif par rapport aux bipolaires, et aujourd'hui, la plupart des ampli-op de qualit&eacute; poss&egrave;dent au minimum un &eacute;tage d'entr&eacute;e en JFET.<P>Pour ce qui est du volet puissance, il existe un autre composant tr&egrave;s bien adapt&eacute;&nbsp;: le MOSFET.<P></OL><P>&nbsp;<P>&nbsp;<LI><H3><A NAME="F24">LE TRANSISTOR MOS FET.</A></H3>Les transistors &agrave; MOSFET reprennent plusieurs caract&eacute;ristiques de FETs &agrave; jonction&nbsp;: ils se d&eacute;clinent en deux versions, le canal N et le canal P, et les &eacute;lectrodes vont aussi s'appeler drain, source et grille, leur fonction &eacute;tant la m&ecirc;me que pour les JFETs.<P><OL TYPE=A><P>&nbsp;<LI><H4><A NAME="F25">LE MOSFET &Agrave; CANAL INDUIT.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F26">Description.</A></FONT></H5>Dans un substrat faiblement dop&eacute; P, on ins&egrave;re deux zones N fortement dop&eacute;es. Ces deux zones seront la source et le drain du MOSFET&nbsp;; elles sont distantes d'une dizaine de &#181;m (s&eacute;par&eacute;es par le substrat P). La source est g&eacute;n&eacute;ralement reli&eacute;e au substrat.<P>La grille n'est pas directement reli&eacute;e au substrat P&nbsp;; elle en est isol&eacute;e par l'interm&eacute;diaire d'une tr&egrave;s fine (quelques nm) couche d'isolant (de l'oxyde de silicium). Cette caract&eacute;ristique donne son nom au MOSFET&nbsp;: Metal Oxyde Semiconductor.<P>La grille est ainsi <STRONG>isol&eacute;e</STRONG> du substrat&nbsp;: le courant de grille sera nul en continu.<P><CENTER><IMG SRC="FET.FIG/FET24.GIF"></CENTER><CENTER><P>Fig. 12. Sch&eacute;ma de principe d'un MOSFET canal N.<P></CENTER><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F27">Principe de fonctionnement.</A></FONT></H5>Si V<SUB>GS</SUB>  = 0, aucun courant de drain ne passera, car le circuit source-drain est compos&eacute; de deux jonctions en s&eacute;rie, l'une PN, l'autre NP&nbsp;: il y en aura toujours une en inverse.<P>Lorsqu'on applique une tension V<SUB>GS</SUB> positive, l'&eacute;lectrode de grille, l'isolant et le substrat P forment un condensateur.<P><CENTER><IMG SRC="FET.FIG/FET25.GIF"></CENTER><CENTER><P>Fig. 13. Ph&eacute;nom&egrave;ne d'inversion.<P></CENTER>Les &eacute;lectrons (porteurs minoritaires du substrat P) sont alors attir&eacute;s vers la grille. Pour une tension V<SUB>GS</SUB> suffisamment &eacute;lev&eacute;e (tension de seuil), la concentration en &eacute;lectrons dans le substrat est sup&eacute;rieure &agrave; la concentration en trous au voisinage de la grille&nbsp;; on a alors une couche N dite couche d'inversion entre les zones N de la source et du drain. Les deux jonctions disparaissent, on n'a plus qu'un canal N, et le courant peut passer entre drain et source.<P>Mais, pour une tension V<SUB>DS</SUB> sup&eacute;rieure &agrave; V<SUB>GS</SUB>, on annule la tension grille-drain, et donc l'effet condensateur&nbsp;: on a un ph&eacute;nom&egrave;ne de pincement du canal induit N comme pour le JFET. Le courant de drain tend alors vers une valeur constante, de la m&ecirc;me mani&egrave;re que pour le JFET.<P>Ce mode de fonctionnement est appel&eacute;  &nbsp;&agrave; enrichissement&nbsp; , car une tension V<SUB>GS</SUB> positive  &nbsp;enrichit&nbsp;  le canal en porteurs minoritaires, permettant le passage du courant.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F28">Caract&eacute;ristiques.</A></FONT></H5><CENTER><IMG SRC="FET.FIG/FET26.GIF"></CENTER><CENTER><P>Fig. 14. Caract&eacute;ristique de sortie du MOS canal N.<P></CENTER>La caract&eacute;ristique de sortie est similaire &agrave; celle d'un JFET, sauf que le courant de drain pourra atteindre plusieurs amp&egrave;res pour des composants de puissance. On note la zone en fonctionnement ohmique, tout &agrave; fait similaire &agrave; celle des JFETs, et permettant les m&ecirc;mes applications.<P>La caract&eacute;ristique de transfert a la forme suivante&nbsp;:<P><CENTER><IMG SRC="FET.FIG/FET27.GIF"></CENTER><CENTER><P>Fig. 15. Caract&eacute;ristique de transfert du MOS canal N.<P></CENTER>Cette caract&eacute;ristique de transfert est appel&eacute;e la transconductance du MOS, et est exprim&eacute;e en siemens (S). Pour des MOS de puissance, elle vaut plusieurs siemens (1 &agrave; 10 typiquement), soit des valeurs beaucoup plus importantes que pour les JFETs (quelques mS).<P>La tension de seuil atteint plusieurs volts (1 &agrave; 3 typique). Ce seuil varie avec la temp&eacute;rature.<P></OL><P>&nbsp;<LI><H4><A NAME="F29">LE MOSFET &Agrave; CANAL INITIAL.</A></H4><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F30">Description du principe de fonctionnement.</A></FONT></H5>Le MOSFET &agrave; canal initial a la m&ecirc;me structure que le MOS &agrave; canal induit, avec en plus, un canal faiblement dop&eacute; N entre la source et le drain.<P>Pour V<SUB>GS</SUB> nulle, Ce transistor fonctionne comme un JFET&nbsp;: un courant de drain pourra circuler&nbsp;; quand V<SUB>DS</SUB> augmente, un ph&eacute;nom&egrave;ne de pincement se produit, qui obstrue le canal&nbsp;: le courant de drain devient constant.<P>Si V<SUB>GS</SUB> est inf&eacute;rieure ou &eacute;gale &agrave; 0, on acc&eacute;l&egrave;re le pincement (le condensateur form&eacute; par la grille, l'isolant et le canal attire des trous dans le canal initial qui neutralisent les &eacute;lectrons de cette zone N)&nbsp;: on fonctionne en r&eacute;gime d'appauvrissement.<P>Au contraire, pour V<SUB>GS</SUB> sup&eacute;rieure &agrave; 0, on retrouve le fonctionnement du MOS &agrave; canal induit, et le courant de drain va cro&icirc;tre.<P><CENTER><IMG SRC="FET.FIG/FET28.GIF"></CENTER><CENTER><P>Fig. 16. MOSFET N &agrave; canal initial..<P></CENTER><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F31">Caract&eacute;ristiques.</A></FONT></H5>La caract&eacute;ristique de transfert est la suivante&nbsp;:<P><CENTER><IMG SRC="FET.FIG/FET29.GIF"></CENTER><CENTER><P>Fig. 17. Caract&eacute;ristique de transfert d'un MOS &agrave; canal initial<P></CENTER></OL><P>&nbsp;<LI><H4><A NAME="F32">UTILISATION DES MOSFETs.</A></H4>De par leur constitution, les transistors MOS sont tr&egrave;s fragiles, notamment au niveau de la grille. Les d&eacute;charges &eacute;lectrostatiques sont &agrave; proscrire, car elles peuvent casser le composant, ou pis, l'endommager sans que ses caract&eacute;ristiques ne changent&nbsp;: c'est la fiabilit&eacute; qui est compromise.<P><OL TYPE=1><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F33">MOSFET de puissance.</A></FONT></H5>Les MOS servent beaucoup en commutation de puissance, car ils sont tr&egrave;s rapides et commandables en tension. On notera toutefois qu'&agrave; fr&eacute;quence &eacute;lev&eacute;e, la grille formant un condensateur avec le substrat, elle ne pr&eacute;sente plus une imp&eacute;dance infinie, comme en statique&nbsp;!<P>Quand ils sont passants, ils fonctionnent dans la zone ohmique, et leur caract&eacute;ristique essentielle est, avec la tension V<SUB>DS</SUB> maxi, la r&eacute;sistance R<SUB>DS</SUB>, qui peut &ecirc;tre aussi basse qu'une dizaine de m<IMG SRC="../BASE/ICONES/OHM.GIF">.<P><P>&nbsp;<LI><H5><FONT SIZE="+1"><A NAME="F34">Int&eacute;gration dans les composants num&eacute;riques.</A></FONT></H5>La technologie MOS se pr&ecirc;te tr&egrave;s bien &agrave; l'int&eacute;gration &agrave; grande &eacute;chelle&nbsp;: elle permet de r&eacute;aliser des composants logiques consommant tr&egrave;s peu de courant, et permet ainsi un tr&egrave;s grand niveau d'int&eacute;gration (exemple&nbsp;: m&eacute;moires, microprocesseurs, circuits logiques divers ) Les transistors MOS sont utilis&eacute;s ici en commutation.<P></OL></OL></OL></BODY></HTML>